[
    {
        "id": 1,
        "date": "15 января, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Аутсорсинг vs инхаус-команда: что выбрать для IT-проектов",
        "title2": "Аутсорсинг vs инхаус-команда",
        "text": "<p>По данным Deloitte, около 70% компаний зовут внешних разработчиков из простого понимания: аутсорс работает как хорошо обученная команда спасателей, которая приезжает, делает свое дело и не просит выделить ей отдельный кабинет. Неудивительно, что 59% руководителей выбирают аутсорс ради экономии, хотя по факту получают еще и приятный бонус — спокойствие: хороший подрядчик работает как модуль, который просто встал в систему и делает свое дело, не устраивая ночных трагедий в духе «все упало, но мы держимся».</p><h2>Стоимость команды: инхаус и аутсорс</h2><img src=\"/assets/статьи/1/Стоимость команды.png\" alt=\"Стоимость команды: инхаус и аутсорс\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Инхаус — удовольствие не из дешевых: зарплаты, оборудование, обучение, инфраструктура, поиски редкого разработчика на рынке, похожие на соревнование компаний за ограниченный пул высококвалифицированных специалистов. Техническая база превращается в бесконечную подписку на деньги, офис — в обязательство, которое тянет бюджет вниз, а найм — в лотерею без выигрыша. В итоге собственная команда на старте почти всегда выходит дороже, чем кажется в красивой Excel-табличке.</p><p>Аутсорс работает иначе: вы платите только за результат, а все остальное — офис, оборудование, налоги и прочие заботы — берет на себя подрядчик. Внешняя команда снимает скрытые расходы на найм, обучение и замену людей, когда кто-то внезапно выпадает из процесса. Поэтому компании с ограниченным бюджетом часто идут в аутсорс по тем же причинам, по которым люди предпочитают доставку вместо готовки — быстрее, дешевле, без сюрпризов.</p><p>При этом для долгих проектов общая стоимость поддержки иногда переваливает выше расходов на собственную команду. Поэтому считайте внимательно: смотрите не только на первый чек, но и на те счета, что прилетят через год.</p><h2>Контроль данных и безопасность в инхаус и аутсорсинг</h2><img src=\"/assets/статьи/1/Контроль данных и безопасность.png\" alt=\"Контроль данных и безопасность\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Инхаус дарит полный контроль над процессом и данными: команда внутри компании работает по вашим правилам, соблюдает корпоративные стандарты и охраняет секреты словно сторожевой пес. Для тех, кто не готов делиться знаниями с внешним миром, это почти святое: права на код и интеллектуальную собственность остаются за вами, а риск утечки данных минимален.</p><p>Аутсорс приносит в игру новые риски. Передача проекта подрядчику — всегда лотерея: данные могут утечь, контроль усложняется, а если подрядчик иностранный, добавляются юридические нюансы, и повседневные решения по разработке уходят из ваших рук. NDA и усиленная кибербезопасность снижают опасность, но остаточный риск все равно выше, чем при собственной команде.</p><h2>Масштабирование команд инхаус и аутсорс</h2><img src=\"/assets/статьи/1/Масштабирование команд.png\" alt=\"Масштабирование команд\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Аутсорс умеет масштабироваться почти мгновенно: пик проекта — и подрядчик подключает нужных людей, открывая доступ к глобальному пулу экспертов. Такая гибкость ценна там, где спрос скачет как график на старте ракеты, а загрузка проекта нестабильна.</p><p>Инхаус растет медленнее: нанимать, адаптировать и обучать новых сотрудников долго и дорого. Внутренние специалисты редко вовлечены в краткосрочные задачи и не всегда используют передовые решения, которые уже опробованы в других компаниях. Итог: резкие изменения нагрузки превращаются в марафон бюрократии, где скорость измеряется в количестве подписанных документов.</p><h2>Экспертиза и качество команд инхаус и аутсорс</h2><img src=\"/assets/статьи/1/Экспертиза и качество.png\" alt=\"Экспертиза и качество команд\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Аутсорсинговые компании — как универсальные швейцарские ножи: их специалисты крутятся сразу на нескольких проектах, успевают посетить конференции, повышают квалификацию и в любой момент подключают узкоспециализированных экспертов — будь то ML-разработчики, DevOps или UI/UX-дизайнеры.</p><p>Инхаус-команда погружается в продукт с головой: она знает бизнес-процессы до последнего пикселя и вносит изменения без задержек. Минус — опыт ограничен: многие задачи уже решены где-то на рынке, а внутренние разработчики могут проходить их заново. Оптимальный вариант почти всегда гибрид: внутренние специалисты держат стратегию, внешние приходят на подстраховку с новыми технологиями и разовыми проектами.</p><h2>Так что же выбрать инхаус или аутсорсинг?</h2><img src=\"/assets/статьи/1/Так что же выбрать.png\" alt=\"Так что же выбрать инхаус или аутсорсинг\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Чтобы понять, какой подход подойдет вашей компании, стоит задать себе несколько простых, но точных вопросов.</p><p><strong>Стратегичность проекта.</strong> Насколько важно держать код и данные под личным контролем? Если каждая строчка кода и каждый мегабайт информации для вас как святая реликвия, инхаус почти обязателен: команда внутри компании понимает продукт до атома и минимизирует любые риски утечки.</p><p><strong>Срочность.</strong> Нужно быстро запустить проект или нарастить команду на пике работы? Аутсорс становится почти волшебной кнопкой: подключил нужных специалистов — и проект полетел, без бесконечных собеседований, адаптации и бюрократии.</p><p><strong>Бюджет.</strong> Есть ли у компании ресурсы на зарплаты, оборудование, обучение и офис? Если нет — аутсорс экономит средства и превращает постоянные расходы в предсказуемую стоимость результата. Деньги, как всегда, главный архитектор решений.</p><p><strong>Безопасность.</strong> Данные чувствительные и важны для репутации компании? Инхаус снижает риски: контроль в ваших руках, а вероятность утечек и юридических казусов минимальна.</p><p><strong>Доступ к экспертизе.</strong> Требуются узкоспециализированные навыки, которых нет внутри команды? Аутсорс решает эту проблему мгновенно: пул экспертов позволяет подключить нужного человека, который уже прошел похожие проекты и знает, куда не стоит наступать.</p><p>В итоге выбор почти всегда сводится к балансу между контролем, скоростью, деньгами и опытом. И почти никогда нет универсального рецепта — есть только правильный для вашей компании микс.</p><h2>Как сотрудничать с аутсорс-командой</h2><p>Аутсорс — это не просто способ сэкономить или получить доступ к экспертизе, это искусство строить отношения. Проект нельзя просто отдать сторонней команде и ждать, что все сложится как по волшебству: без продуманной коммуникации сроки срываются, качество падает, а бюджеты растут быстрее, чем график на старте ракеты.</p><p><strong>Первое, что нужно сделать, — четко сформулировать задачи.</strong> Не «сделайте красиво», а конкретно: реализуйте функционал X, интегрируйте Y и сдайте к дате Z. Подрядчик должен понимать, что именно от него ждут, иначе вы получите результат, который технически рабочий, но стратегически бесполезный.</p><p><strong>Второй элемент — внутренний координатор.</strong> В компании нужен человек, который будет общаться с командой подрядчика, расставлять приоритеты и принимать решения. Без него проект превращается в поток писем, бесконечных уточнений и бессмысленных правок, которые съедают время и мотивацию обеих сторон.</p><p><strong>Третий пункт — прозрачные метрики.</strong> Дедлайны, спринты, тесты, показатели прогресса — все должно быть измеримо. Так вы видите, где отстают, и вовремя принимаете меры, а не обнаруживаете проблему, когда уже поздно ее исправлять.</p><p><strong>Юридическая защита не менее важна.</strong> NDA, SLA и права на интеллектуальную собственность — это не бюрократия ради галочки, а способ спать спокойно. Юридические условия не заменяют контроль, но дают страховку на случай спорных ситуаций и непредвиденных сложностей.</p><p><strong>Синхронизации должны быть регулярными.</strong> Встречи раз в неделю или короткие ежедневные синки позволяют вовремя выявлять недопонимания, корректировать приоритеты и предотвращать накопление багов. Чем раньше вы увидите проблему, тем быстрее ее устраните.</p><p><strong>Не бойтесь корректировать команду.</strong> Если эксперты не справляются, подрядчик должен быстро подключить нужных людей или заменить специалистов. Это не слабость аутсорса, а его гибкость, которую умеют использовать опытные компании.</p><p><strong>И наконец, сохраняйте стратегический контроль.</strong> Даже если проект полностью внешний, внутри остается «ядро»: менеджеры, архитекторы, продуктологи. Они следят, чтобы решения соответствовали бизнес-целям, и держат руку на пульсе, чтобы внешняя команда не ушла в технические дебри, забыв о стратегии.</p><p>В итоге эффективный аутсорс — это слаженный механизм: четко заданные цели, прозрачные метрики, постоянная коммуникация и внутреннее ядро, которое задает направление. Только так внешняя команда превращается в инструмент, а не в источник новых головных болей.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/1/1.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": 2,
        "date": "20 января, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Что такое эмоциональный ИИ и как на этом заработать",
        "title2": "Эмоциональный ИИ",
        "text": "<p>Сегодня компании соревнуются в умении чувствовать клиента. Эмоциональный ИИ превращает догадки в данные: он замечает улыбку, улавливает раздражение в голосе, читает настроение между строк. Машина становится инструментом, который помогает бизнесу понимать человека не по шаблону, а по живым реакциям.</p><p>По данным Markets and Markets, объем рынка эмоционального ИИ вырастет с 19 до 37 миллиарда долларов к 2026 году. Такой рост говорит сам за себя. Эмоции становятся новой метрикой эффективности, и компании, которые научатся считывать их точно, получают преимущество, недоступное цифрам отчёта.</p><p>Пора разобраться, как это работает и почему это важно именно для вас.</p><h2>Как система распознает эмоции</h2><p>Эмоциональный ИИ — это технологии, которые учат машины распознавать чувства. Камеры и микрофоны считывают мимику, голос и взгляд, превращая эмоции в данные. Иногда подключаются датчики, фиксирующие пульс и дыхание, но чаще достаточно бесконтактного наблюдения, чтобы понять, радуется человек или сдерживает раздражение.</p><h2>Что ИИ считывает эмоции</h2><p>Эмоциональный ИИ считывает эмоции так, как это не удаётся обычным алгоритмам. Он превращает мимику, голос, движения тела и даже ритм сердца в измеримые данные. Система работает на трёх уровнях: визуальном, аудиальном и физиологическом, каждый открывает отдельную грань эмоционального состояния.</p><h3>1. Визуальный анализ</h3><p>Камеры фиксируют лицо и ищут ключевые точки — брови, глаза, уголки рта, носогубные складки, движение глаз и микровыражения, которые человек сам не замечает. Алгоритм сначала обрабатывает изображение, затем выявляет Action Unit'ы — мельчайшие микродвижения мышц. Нейросеть сравнивает эти точки с миллионами паттернов эмоций и видит мельчайшие микродвижения мышц: поднятые уголки губ, напряженные брови, морщинки на лбу. По этим сигналам система различает настоящую радость, усталость, или вежливую улыбку, оценивая интенсивность эмоции.</p><h3>2. Голос и речь</h3><p>Голос раскрывает вторую перспективу. Алгоритм анализирует тон, тембр, громкость, скорость речи, паузы и лексику. Стресс делает голос выше и быстрее, грусть — монотонным и слабым. Совмещение звучания и слов позволяет ИИ видеть настроение с высокой точностью.</p><h3>3. Физиология</h3><p>Для максимальной точности подключают сенсоры, которые считывают пульс, сердечные ритмы, мышечные импульсы и дыхание. Эти показатели отражают внутреннее напряжение и уровень возбуждения. Даже если лицо улыбается, тело выдает настоящие эмоции.</p><h2>Как ИИ перерабатывает эмоции в цифру</h2><img src=\"/assets/статьи/2/Как ИИ перерабатывает.png\" alt=\"Как ИИ перерабатывает эмоции в цифру\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h3>1. Сбор данных</h3><p>Первый шаг — наблюдение. Камеры фиксируют лицо, микрофоны записывают голос, сенсоры считывают пульс, дыхание и мышечные импульсы. Даже мельчайшие движения глаз или изменение тона голоса попадают в объектив.</p><h3>2. Обработка и нормализация</h3><p>Сырые данные слишком шумные и несовершенные. Камеры могут ловить тень, микрофон — фоновые шумы, датчики — помехи. Алгоритмы вычищают лишнее, приводят показатели к единому стандарту и выделяют ключевые признаки: поднятие бровей, ускорение речи, учащенный пульс. Всё это превращается в числовые векторы — база, на которой строятся дальнейшие выводы.</p><h3>3. Сопоставление с паттернами</h3><p>Теперь начинается работа нейросети. Система сравнивает каждый сигнал с миллионами примеров из базы данных: радость, удивление, грусть, раздражение. Алгоритм смотрит на сочетания микродвижений, тон голоса и физиологию, чтобы определить, какая эмоция скрыта за поведением человека. Каждому признаку присваивается оценка, и на выходе мы получаем первую цифровую карту эмоций.</p><h3>4. Оценка интенсивности</h3><p>Эмоции бывают разной силы. ИИ определяет, насколько радость настоящая или вежливая, стресс поверхностный или сильный, удивление лёгкое или шоковое. Микродвижения мышц, ритм речи и физиологические показатели объединяются в числа, которые отражают интенсивность каждой эмоции. Это позволяет видеть оттенки, которые человек сам может не осознавать.</p><h3>5. Комбинация сигналов</h3><p>Последний этап — слияние всех каналов в единую карту. Визуальные признаки, голосовые паттерны и физиология соединяются, чтобы показать полную картину эмоций. Это как собрать пазл из сотен кусочков: только когда они соединены, видна настоящая реакция человека. На выходе бизнес получает не просто оценку «радость/грусть», а цифры, которые отражают сложную эмоциональную динамику.</p><h2>Где компании уже зарабатывают на эмоциональном ИИ</h2><img src=\"/assets/статьи/2/Где компании уже зарабатывают на эмоциональном ИИ.png\" alt=\"Где компании уже зарабатывают на эмоциональном ИИ\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Эмоциональный ИИ перестал быть футуристической игрушкой и стал реальным инструментом бизнеса. Он измеряет эмоции, которые раньше оставались за кадром, и показывает, что люди на самом деле думают и чувствуют.</p><h3>Розница и маркетинг</h3><p>Самое очевидное применение — магазины и рекламные экраны. Cloverleaf и Affectiva создали электронные ценники shelfPoint с камерами. Проходящий покупатель автоматически попадает в поле зрения ИИ: система считывает выражение лица и меняет рекламу под реакцию. P&G, Walmart и другие тестировали технологию: продажи выросли на 10–40%, вовлеченность покупателей — в 3–5 раз. Система понимает, что вам нравится, и показывает это на экране, замечает разочарование — предлагает альтернативу.</p><p>Российский Promobot пошел дальше. Их роботы-консультанты с эмоциональным ИИ не просто отвечают на вопросы, они смотрят на лицо, слушают голос, считывают пульс и подстраивают тон. Видят стресс — становятся спокойнее, видят скуку — добавляют энергии. Люди доверяют им больше, потому что они ощущаются как собеседники, а не машины. Promobot работает в 34 странах в роли гидов, консультантов и промоутеров.</p><h3>Кино и развлечения</h3><p>Disney в 2017 году сняла эксперимент: 3179 зрителей, 16 миллионов изображений, камеры и алгоритмы распознавания эмоций. Система училась видеть, когда зрители смеются, вздрагивают или расстраиваются, и уже через несколько минут могла предсказать реакцию аудитории на фильм.</p><p>YouTube тестирует видео через YouFirst: зрители разрешают веб-камере фиксировать эмоции, нейросеть отслеживает реакции и передает данные авторам: где смех, где скука, где отвлечение.</p><p>Игры тоже подстраиваются под эмоции. Психологический триллер Nevermind от Affectiva реагирует на стресс игрока: если вы напряжены — игра становится жестче, если успокоитесь — расслабляет. Игра буквально «чувствует» вас.</p><h3>Образование и HR</h3><img src=\"/assets/статьи/2/Образование и HR.png\" alt=\"Образование и HR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>В Перми «Ростелеком» и New Vision создали «Умную и безопасную школу». Камеры анализируют эмоции учеников во время уроков, выявляют стресс или агрессию и позволяют вовремя вмешаться. Система работает с точностью 72%.</p><p>В HR эмоциональный ИИ тестирует кандидатов на собеседованиях. HireVue смотрит на выражение лица, слушает интонацию, анализирует движения, оценивает уверенность и честность. Результат — объективная оценка без предубеждений интервьюера.</p><h2>Что нужно знать перед внедрением эмоционального ИИ</h2><p>Эмоциональный ИИ впечатляет, но до телепатии ему далеко. Он видит эмоции, но не всегда понимает, что за ними стоит. Система фиксирует улыбку, но не знает, откуда она — радость, вежливость, сарказм или нервозность. Когда вы улыбаетесь продавцу, это не обязательно значит, что вам нравится товар. Без контекста ИИ теряет смысл, потому что человек живет не только в кадре, но и в собственном настроении.</p><p>Есть и технические нюансы. Чтобы ИИ работал точно, нужны:</p><ul><li>качественная камера и хорошее освещение;</li><li>чистый аудиосигнал без фоновых шумов;</li><li>корректное расположение устройств;</li><li>отсутствие масок и очков, закрывающих лицо.</li></ul><p>Как говорит Виталий Виноградов из Ivideon, при правильной настройке точность достигает 90–95%, но дешёвая техника сводит эту цифру к случайности.</p><p>Не все эмоции читаются одинаково. Культура, характер и даже привычка держать лицо влияют на результат. Одни люди реагируют открыто, другие — как актеры на допросе. Поэтому эмоциональный ИИ лучше работает с массовыми данными. Когда система анализирует тысячи людей, она видит не случайную улыбку, а тенденции, которые помогают бизнесу понять аудиторию.</p><h2>Тренды в развитии эмоционального ИИ</h2><img src=\"/assets/статьи/2/Тренды в развитии эмоционального ИИ.png\" alt=\"Тренды в развитии эмоционального ИИ\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>К 2026 году больше половины онлайн-рекламы будут создавать с помощью эмоционального ИИ, прогнозирует Gartner. Рынок анализа эмоций удваивается каждые 2–3 года, а компьютерное зрение становится одной из главных технологий ближайших пяти лет.</p><p><strong>Тренды:</strong></p><ul><li><strong>Мультимодальные системы</strong> — одновременно смотрят на лицо, голос, тело и физиологию, видят эмоции точнее и не теряют контекст.</li><li><strong>Обработка на периферии</strong> — смартфоны, очки и часы анализируют эмоции прямо на устройстве, быстрее и безопаснее.</li><li><strong>Интеграция с IoT</strong> — умные дома, машины и города замечают усталость, скуку или стресс и реагируют.</li><li><strong>Сложные эмоции</strong> — скука, замешательство, волнение, разочарование станут такими же измеримыми, как радость или злость.</li></ul>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/2/2.jpg",
        "animationDelay": "500ms"
    },
    {
        "id": 3,
        "date": "25 января, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Что такое технология дополненной реальности (AR) и как с ней работать бизнесу",
        "title2": "AR технологии для бизнеса",
        "text": "<p>Дополненная реальность (AR) — это способ добавить к привычному миру немного цифрового слоя. Через смартфон или очки можно увидеть объекты, подписи и подсказки, которых нет в реальности, но которые помогают лучше ориентироваться и взаимодействовать с пространством.</p><p>AR не создает цифровой мир, а просто накладывает на него дополнительную информацию. В итоге стол может «ожить» мини-роботом, а на улице появятся подсказки с названиями зданий — как будто интерфейс пророс сквозь привычное окружение.</p><h2>Как работает AR</h2><p>AR видит мир вокруг и добавляет к нему цифровые объекты, которые реагируют на движение, взгляд и пространство. Камеры и сенсоры собирают данные в реальном времени, алгоритмы мгновенно обрабатывают их, а сцена вокруг превращается в интерактивный слой информации, который работает вместе с вами.</p><h3>Шаг 1. Сбор данных</h3><p>Камеры, лидары, GPS и датчики движения считывают мир до миллиметра — цвета, формы, расстояния. AR замечает то, мимо чего мы обычно проходим, и превращает фон в данные.</p><h3>Шаг 2. Анализ</h3><p>Алгоритмы выделяют ключевые точки и по ним собирают 3D-карту — процесс называется SLAM. Система распознает, где пол, где стены, где предметы, и решает, куда вписать цифровой объект. Все это происходит за доли секунды, как будто устройство на лету понимает, как устроен мир вокруг.</p><h3>Шаг 3. Визуализация</h3><p>Движок — Unity, Unreal или собственный, расставляет объекты так, чтобы они «вписались» в пространство: учитывает свет, тени, физику. Цифровые элементы реагируют на движение и освещение, будто цифровая лампа правда стоит в комнате. Это уже не картинка, а часть сцены, с которой можно взаимодействовать.</p><h3>Шаг 4. Взаимодействие</h3><p>AR замечает мир и добавляет к нему слой взаимодействия. Навигация, стрелки, виртуальные объекты откликаются на движение и взгляд, меняясь вместе с вами. Реальность становится интерфейсом.</p><h2>В чем отличие AR от VR</h2><p>AR и VR часто путают, но это разные вещи. VR полностью погружает в цифровой мир — шлем на голову, и вы уже не на кухне, а в симуляции. Это как вход в отдельную вселенную: удобно для тренировки хирургов или проектирования зданий, но требует оборудования и подготовки.</p><p>AR накладывает цифровой слой на привычный мир. На улице или в офисе появляются подсказки, 3D-объекты, анимации. Это как если бы ваша реальность ожила и начала подсказывать, что делать. VR создаёт мир с нуля, AR делает привычное пространство интерактивным. Для бизнеса AR выгоднее: ускоряет обучение, помогает продавать и улучшает сервис без перестройки процессов.</p><h2>В каких отраслях применяется AR?</h2><img src=\"/assets/статьи/3/В каких отраслях.png\" alt=\"В каких отраслях применяется AR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h3>Ритейл</h3><p>Проблема «непощупанного» товара — вечный камень преткновения онлайн-шопинга. AR решает ее почти на лету. В IKEA Place мебель можно поставить прямо в своей комнате и сразу понять, как она вписывается в интерьер.</p><p>Lamoda, Nike и Wildberries внедряют AR-примерочные: одежда, косметика, аксессуары «надеваются» через камеру. Sephora пошла дальше с «умными зеркалами», где макияж примеряется в реальном времени. В итоге конверсия растет, возвраты падают, и клиент сразу видит, почему именно этот оттенок ему подходит.</p><h3>Маркетинг</h3><img src=\"/assets/статьи/3/Маркетинг.png\" alt=\"Маркетинг\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>AR делает рекламу интерактивной и забавной. Pepsi оживила лондонскую автобусную остановку тигром и НЛО, видео стало вирусным, а люди еще неделю рассказывали друзьям, что видели фантастику в реальной жизни.</p><p>Lego оживляют конструктор: наведите камеру и на экране появляется анимация, которую хочется показывать всем. AR превращает рекламу в мини-шоу, где бренды становятся режиссерами, а зрители — актерами.</p><h3>Промышленность</h3><img src=\"/assets/статьи/3/Промышленность.png\" alt=\"Промышленность\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>AR снижает риск ошибок и повышает безопасность. Boeing показывает инструкции по сборке проводки прямо перед глазами рабочих: меньше бумаги, меньше недопониманий, меньше пожаров и электрических искр.</p><p>Siemens использует AR для удаленного сопровождения инженеров: эксперт видит глазами техника и дает точные указания. Это как иметь наставника, который сидит у вас за спиной, но без микроменеджмента и раздражающих советов.</p><h3>Обучение</h3><img src=\"/assets/статьи/3/Обучение.png\" alt=\"Обучение\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>AR переносит знания в практику без риска. Студенты-медики через AR-очки изучают анатомию, видят органы в 3D и могут «оперировать», не трогая настоящего пациента.</p><p>Shell и Airbus используют AR-тренажеры для обучения опасным процессам. Ошибки больше не угрожают жизни, а обучение проходит быстрее и увлекательнее — мозг лучше усваивает то, что видит и делает одновременно.</p><h3>Недвижимость</h3><img src=\"/assets/статьи/3/Недвижимость.png\" alt=\"Недвижимость\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>AR позволяет увидеть будущий дом еще до строительства. Девелоперы показывают квартиры прямо на пустом участке, а архитекторы дают клиентам возможность пройтись по проекту и внести изменения до того, как на площадке появится первый кирпич.</p><p>Это как примерка очков виртуальной реальности, но без шлема: клиент гуляет по своей будущей квартире и решает, где будет шкаф, а где диван. Продажа становится осмысленным выбором, а не слепым бронированием.</p><h3>Автоиндустрия</h3><img src=\"/assets/статьи/3/Автоиндустрия.png\" alt=\"Автоиндустрия\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>AR делает вождение безопаснее и информативнее. BMW, Mercedes и Audi выводят подсказки, скорость и навигацию прямо на лобовое стекло. Водитель видит, что происходит, и забывает про GPS на телефоне.</p><p>В сервисе механики используют очки с подсказками по ремонту: инструкции прямо перед глазами, инструменты под рукой, ошибок меньше. Авто превращается в живую инструкцию, где каждый шаг виден и понятен.</p><h3>Туризм и развлечения</h3><img src=\"/assets/статьи/3/Туризм и развлечения.png\" alt=\"Туризм и развлечения\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Москва все активнее погружается в цифровое искусство и медиа-арт, добавляя городу новые краски через AR. В приложении ВДНХ от CDI можно гулять по парку и видеть перед собой 3D-модели исторических зданий и арт-объекты. Веселые маскоты становятся гидами, рассказывают истории и делают прогулку живой и увлекательной.</p><p>Похожая идея была реализована для RUSSPASS «Зима в Москве». Игровая механика позволяла собирать AR-персонажей прямо на улицах города. Герои появлялись на маршрутах, превращая обычные прогулки в маленькие приключения и делая их яркими и заметно живыми.</p><h2>Зачем бизнесу AR</h2><p>AR ускоряет обучение, снижает ошибки и делает работу с продуктом более естественной. Сотрудники быстрее осваивают процессы, а клиенты видят товар еще до покупки. Это инструмент роста: сокращает расходы, повышает вовлеченность и помогает принимать решения наглядно через визуализацию данных.</p><h2>Как внедрять AR</h2><p><strong>Первое. Определите цели.</strong> Зачем вашей компании AR: продажи, обучение, сервис, визуализация? Четкое понимание поможет выбрать правильные инструменты и не тратить ресурсы впустую.</p><p><strong>Второе. Проанализируйте процессы.</strong> Где клиенты взаимодействуют с продуктом, где сотрудники делают ошибки, какие задачи требуют визуализации и интерактива. Часто внедрение начинают с пилотного проекта, чтобы потом масштабировать успешные решения.</p><p><strong>Третье. Выберите платформу и устройство.</strong> Смартфоны и планшеты подходят для ритейла, очки вроде HoloLens или Magic Leap — для обучения и промышленности. Для маркетинга используют приложения и AR-фильтры. Учитывайте мощность, точность трекинга и автономность.</p><p><strong>Четвертое. Разработайте контент.</strong> Нужны качественные 3D-модели, анимация и интерактив, которые органично вписываются в пространство. Дизайнеры, разработчики и аналитики работают вместе, чтобы контент был полезным и технически корректным.</p><p><strong>Пятое. Проведите пилотное тестирование.</strong> Проверяйте одну локацию, продукт или процесс, собирайте обратную связь. Пилот позволяет выявить ошибки до масштабного внедрения.</p><p><strong>Шестое. Масштабируйте и интегрируйте.</strong> AR внедряют в другие процессы, связывают с CRM и ERP, обучают сотрудников, автоматизируют поддержку контента. AR становится частью работы компании, а не отдельным проектом.</p><p><strong>Седьмое. Займитесь аналитикой и улучшением.</strong> Измеряйте эффективность, вовлеченность, сокращение времени на обучение, ROI. Регулярная аналитика помогает корректировать сценарии и получать от AR максимум пользы.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/3/3.jpg",
        "animationDelay": "700ms"
    },
    {
        "id": 4,
        "date": "30 января, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Что такое IT-консалтинг и зачем он нужен",
        "title2": "IT-консалтинг",
        "text": "<p>Давайте сразу разберемся: IT-консалтинг — это не про то, чтобы продавать модные программы или громоздкие серверы и говорить «вот вам решение». Это про то, чтобы технологии перестали быть проблемой и начали работать на бизнес. Представьте, что ваша компания — автомобиль. Обычный консалтинг говорит: «Заводите мотор, едем». IT-консалтинг подходит как мастер-диагност: проверяет масло, тормоза, рулевое, электронику, и только потом говорит, как разогнаться, не разбив машину.</p><p>Эксперт IT-консалтинга изучает инфраструктуру, процессы и методы работы сотрудников. Он ищет узкие места, которые вызывают простои и ошибки, и предлагает решения. Данные исследований подтверждают: грамотное внедрение IT-консалтинга снижает расходы на технологии на 20–30% и ускоряет ключевые задачи на 15–25%.</p><h2>Как работает IT-консалтинг</h2><p>Начало работы всегда одно и то же: аудит. И это не просто галочка «проверили сервера». Консультант изучает все: оборудование, сети, программное обеспечение, рабочие процессы, поведение сотрудников. Где тормозит система? Где сотрудники тратят время впустую? Какие риски безопасности реальны, а какие надуманы?</p><p>После аудита формируется план оптимизации. Он может включать: автоматизацию процессов, внедрение новых инструментов, усиление безопасности и обучение команды.</p><p>Кейсы показывают, что производительность сотрудников растет на 10–20% уже в первые месяцы. Люди начинают работать быстрее, меньше ошибок, меньше простоев. Если раньше технологии были «живыми бомбами», которые могут взорваться в любой момент, то после IT-консалтинга они превращаются в предсказуемый инструмент.</p><h2>Направления IT-консалтинга</h2><p><strong>Стратегический консалтинг</strong> — формирует IT-стратегию и интегрирует ее с бизнес-целями. Он отвечает на вопрос: «Какие технологии принесут максимальную пользу в долгосрочной перспективе?»</p><p><strong>Процессный консалтинг</strong> — смотрит на внутренние процессы, выявляет повторяющиеся задачи и предлагает автоматизацию. Это снижает нагрузку на сотрудников и ускоряет работу компании.</p><p><strong>Технический консалтинг</strong> — выбирает и внедряет оборудование, софт и облачные решения.</p><p><strong>Консалтинг по кибербезопасности</strong> — оценивает риски, защищает данные и обучает сотрудников, чтобы они не превращались в живые уязвимости.</p><p>Проще говоря, IT-консалтинг превращает хаотичную систему в управляемую машину.</p><h2>Отличие IT-консалтинга от обычного</h2><img src=\"/assets/статьи/4/Отличие ITконсалтинга.png\" alt=\"Отличие IT-консалтинга от обычного\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Обычный консалтинг говорит: «Вот ваши проблемы, вот рекомендации, решайте сами». На бумаге все выглядит красиво: диаграммы, таблицы, стратегии. На практике — мало кто понимает, как это внедрять, как новые решения работают с вашей инфраструктурой и людьми. Руководитель остается с планом, но без инструментов, чтобы его реализовать.</p><p>IT-консалтинг работает иначе. Он не наблюдает со стороны, а погружается в процессы компании, разбирается, где теряются данные, где буксует коммуникация и почему технологии не приносят ожидаемого эффекта. Вместо общих советов формируется конкретная схема действий: какие инструменты внедрять, как связать их с текущей инфраструктурой, что автоматизировать, а где сохранить человеческий контроль. Результат — управляемая, прозрачная система которая усиливает бизнес.</p><p>IT-консалтинг от CDI превращает идеи в управляемые процессы. Мы не заменяем стратегию, а делаем ее выполнимой и показываем, как технологии работают на бизнес. В отличие от обычного консалтинга, где остаются только диаграммы и вопросы, мы делаем результат.</p><h2>Задачи IT-консалтинга</h2><p><strong>Оптимизация инфраструктуры.</strong> Анализ оборудования, сетей, софта и выявление узких мест. Сокращение простоев и лишних расходов.</p><p><strong>Повышение эффективности процессов.</strong> Автоматизация рутинных задач, внедрение инструментов, которые ускоряют работу сотрудников.</p><p><strong>Интеграция новых технологий.</strong> Облака, мессенджеры, системы удаленной работы — все должно работать без конфликтов с существующей инфраструктурой.</p><p><strong>Информационная безопасность.</strong> Выявление угроз, создание системы защиты и обучение сотрудников. Риск утечек снижается до 40%.</p><p><strong>Поддержка стратегических решений.</strong> Оценка, какие технологии принесут максимальную отдачу, а какие окажутся пустой тратой денег и времени.</p><h2>Кому нужен IT-консалтинг</h2><p>IT-консалтинг актуален не только для корпораций. Он нужен малому и среднему бизнесу, особенно если компания масштабируется или внедряет новые технологии. Когда бизнес переходит на облачные сервисы, интеграция без ошибок превращается в маленькое чудо. Консультанты помогают сделать переход плавным и безопасным, освобождают команду от рутины и ускоряют выполнение задач.</p><p>Компании, которые используют IT-консалтинг системно, отмечают ускорение внедрения технологий и снижение операционных рисков уже в первые шесть месяцев работы с консультантом.</p><h2>Практический эффект IT-консалтинг</h2><p>Эффект IT-консалтинга всегда измерим: сокращение затрат на IT, рост производительности сотрудников, ускорение процессов. Автоматизация снижает ручной труд, внедрение защиты данных уменьшает финансовые и репутационные риски. Реальные цифры: до 30% высвобожденных ресурсов, ускорение ключевых задач, предсказуемая инфраструктура.</p><p>В результате технологии перестают быть источником проблем и превращаются в инструмент роста. Для руководителей это значит меньше хаоса, меньше рисков и больше скорости. IT-консалтинг не продает мечты, он делает технологии реальным ресурсом.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/4/4.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": 5,
        "date": "05 февраля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Внедрение геймификации в продукт: как использовать механику игры для роста бизнеса",
        "title2": "Геймификация в продукте",
        "text": "<p>Современные цифровые продукты все чаще сталкиваются с тем, что пользователи перестают реагировать на привычные стимулы: скидки, рассылки, баннеры. На помощь приходит геймификация, инструмент, который делает привычное неожиданным и скучное захватывающим, превращая клик в маленькую победу и рутину в мини-эпопею.</p><h2>Что такое геймификация</h2><p>В классическом понимании геймификация — это внедрение игровых механик в неигровой контекст. Но в реальности — это про мотивацию. Про внутренний двигатель, который запускается без внешней команды.</p><p>В CRM, корпоративных порталах, SaaS-продуктах и обучении она помогает там, где обычно скучно. И да, продукт без геймификации тоже может работать. Просто он как велосипед без цепи: вроде есть колеса, но ехать далеко не получится.</p><p>Продуманная игровая логика формирует привычку. А привычка — это двигатель роста. С ней пользователи возвращаются не потому, что надо, а потому, что хочется еще один уровень, еще одну серию, еще одну галочку прогресса.</p><h2>Почему бизнесу стоит «играть»</h2><p>Геймификация тот случай, когда выигрывают обе стороны. Пользователь получает ощущение движения и признания. Компания — рост удержания, LTV и вовлеченности.</p><p>Duolingo делает это гениально просто: баллы XP, уровни, «серии побед». Детская логика, но взрослые играют с азартом. Результат — удержание 60% активных пользователей в первые три месяца, в 2,5 раза выше среднего по EdTech. Deloitte видит то же самое: геймифицированные курсы завершают до 40% чаще, а вовлеченность сотрудников растет на 22–25 пунктов eNPS. Когда видишь прогресс, хочешь продолжать. Когда видишь признание уже не можешь остановиться.</p><h2>Элементы геймификации</h2><img src=\"/assets/статьи/5/Элементы геймификации.jpg\" alt=\"Элементы геймификации\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Любая игровая система держится на трех китах: механика, динамика и награда. Вместе они формируют замкнутый цикл: действие — эмоция — стимул — повторение.</p><h3>Механики — структура и прогресс</h3><ul><li><strong>Баллы и уровни</strong> — показывают рост. Видишь прогресс, хочешь еще.</li><li><strong>Прогресс-бары</strong> — наглядно: куда идешь и сколько осталось.</li><li><strong>Квесты и миссии</strong> — задачи превращаются в сюжет. Делаешь задание — как проходишь мини-историю.</li><li><strong>Рейтинги и streak‑серии</strong> — азарт соревноваться. Не хочешь ломать цепочку успеха.</li></ul><h3>Динамики — эмоции и поведение</h3><ul><li><strong>Соревнование</strong> — активирует азарт. Хочешь быть первым.</li><li><strong>Сотрудничество</strong> — объединяет общей целью. Вместе легче и интереснее.</li><li><strong>Достижение и статус</strong> — признание и гордость. Каждый видит твой прогресс.</li><li><strong>Любопытство</strong> — подталкивает исследовать. Исследуешь — остаешься.</li></ul><h3>Награды — закрепление успеха</h3><ul><li><strong>Материальные</strong> — бонусы, скидки, призы.</li><li><strong>Символические</strong> — бейджи, титулы, статусы.</li><li><strong>Социальные</strong> — признание в команде или сообществе.</li></ul><p>Геймификация не работает по кусочкам. Это сценарий, который ведет пользователя от первого клика до возвращения. Как хороший сериал: не хочется выключать, пока не узнаешь, чем закончится.</p><h2>Примеры геймификации: как это выглядит на практике</h2><img src=\"/assets/статьи/5/Примеры геймификации.jpg\" alt=\"Примеры геймификации\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h3>Стрик-серии и уровни — Duolingo</h3><p>Duolingo. Классика жанра. Изучение языков превращается в ежедневный челлендж. Каждый день — новый уровень, новая серия. Пропустил день — потерял streak. И ты возвращаешься, даже если не хочешь.</p><p>Эффект: удержание 60% активных пользователей за первые три месяца. Это почти как собирать наклейки в детстве, только вместо стикеров — новые слова.</p><h3>Квесты и награды — CDI и Russpass</h3><img src=\"/assets/статьи/5/Квесты и награды.jpg\" alt=\"Квесты и награды\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Город превращался в игровое поле: через AR пользователи собирали снежинки и зверей, исследуя точки интереса. За каждую активность — гарантированные баллы, без лотерей и случайностей. Баллы можно было обменять на промокоды и подарки через платформу «Миллион призов».</p><p>Эффект: игра мотивировала гулять, возвращаться и открывать новые места. Каждый участник знал, что за участие всегда ждет награда.</p><h3>Прогресс-бары и временные миссии — Unisender</h3><img src=\"/assets/статьи/5/Прогресс бары и временные миссии.jpg\" alt=\"Прогресс-бары и временные миссии\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Unisender. Компания добавила игровой путь для новичков: прогресс-бары, бейджи и миссии. Настройка email-кампании превращается в серию шагов с наградами за каждый этап.</p><p>Эффект: рост активных пользователей на 14%, время настройки сократилось на 20%. Пользователь видит свой путь и не хочет останавливаться на середине.</p><h3>Соревнования и социальные награды — Nike Run Club</h3><img src=\"/assets/статьи/5/Соревнования и социальные награды.jpg\" alt=\"Соревнования и социальные награды\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Здесь геймификация — в чистом виде соревнования. Совместные челленджи, рейтинги, социальные награды. Никто не хочет подвести команду. Никто не хочет быть последним.</p><p>Эффект: пользователи возвращаются, бегают чаще, выполняют челленджи регулярно. Это как видеоигра, только со своими ногами вместо джойстика.</p><h2>IT-инструменты для геймификации</h2><img src=\"/assets/статьи/5/IT-инструменты для геймификации.jpg\" alt=\"IT-инструменты для геймификации\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Одной идеи мало. Геймификация требует инструментов, которые превращают задумку в живой продукт, держат внимание и делают процесс интересным. Это не просто технологии, а маленькие победы, неожиданные сюрпризы и привычки, которые пользователь собирает сам, шаг за шагом, как коллекционер редких карточек.</p><ul><li><strong>Мобильные приложения</strong> — привычка в кармане. Push-уведомления, миссии, напоминания.</li><li><strong>ИИ</strong> — ваш персональный тренер. Подбирает задания под уровень пользователя, как делает Duolingo: прогресс кажется естественным.</li><li><strong>AR (дополненная реальность)</strong> — превращает офис или магазин в игровое поле. Виртуальные бонусы, квесты на реальных столах и полках.</li><li><strong>Gamification-платформы (SaaS)</strong> — готовые движки для бейджей, миссий, рейтингов.</li><li><strong>Интеграции с корпоративными системами (CRM, LMS, ERP)</strong> — когда игра встроена в работу, а не мешает ей.</li></ul><h2>Как внедрить геймификацию по шагам</h2><p>Геймификация не появляется «по щелчку». Это не плагин, который включил — и все заработало. Это сценарий, в котором вы должны точно понимать, где игрок, кто он, и что его держит в процессе. Вот шесть шагов, без которых игра не заработает.</p><h3>1. Диагностика</h3><p>Начните с честного вопроса: где люди теряют интерес?</p><p>Обычно это три зоны:</p><ul><li><strong>onboarding</strong> — пользователи не доходят до конца регистрации или первого действия;</li><li><strong>использование</strong> — зашли один раз и забыли;</li><li><strong>обучение</strong> — начинают, но не заканчивают.</li></ul><p>Соберите данные, посмотрите на тепловые карты, опросите пользователей. Найдите «точку скуки» — ту самую, где человек отвлекся и ушел. Именно туда и нужно добавить игру.</p><h3>2. Целевая модель поведения</h3><p>Прежде чем придумывать бейджи, определите, чего вы хотите от игрока:</p><ul><li>чаще логиниться,</li><li>проходить обучение до конца,</li><li>возвращаться к продукту каждую неделю,</li><li>оставлять отзывы.</li></ul><p>Сформулируйте это максимально конкретно: «чтобы пользователь X делал действие Y с частотой Z». Без этого любая геймификация превратится в фейерверк ради фейерверка.</p><h3>3. Подбор механик</h3><p>Теперь соедините мотивацию с действием. Если вы хотите:</p><ul><li><strong>повысить частоту входов</strong> — введите streak-серии: не заходил — потерял прогресс;</li><li><strong>обучить новичков</strong> — добавьте миссии и сюжет: шаг за шагом, как в игре;</li><li><strong>повысить активность</strong> — рейтинги и командные челленджи;</li><li><strong>сформировать привычку</strong> — прогресс-бары и уровни.</li></ul><p>Главное — не перегружать. Слишком много элементов превращают игру в инструкцию по технике безопасности.</p><h3>4. Прототипирование сценария</h3><p>Любая игра строится вокруг цели, уровня и награды. Опишите путь пользователя: от первого клика до достижения результата. Где у него момент радости? Где сомнение? Где награда? Протестируйте сценарий на реальных людях — пусть попробуют пройти путь. Если человек запутался или заскучал, значит, где-то вы перепутали механику с бюрократией.</p><h3>5. Метрики</h3><p>Геймификация без аналитики — это просто веселая кнопка. Отслеживайте показатели:</p><ul><li>вовлеченность (DAU/MAU),</li><li>churn rate,</li><li>время в продукте,</li><li>LTV,</li><li>частоту возвращений.</li></ul><p>Хорошая геймификация заметна в цифрах. Если показатели растут, значит, вы попали в нужную мотивацию.</p><h3>6. Адаптация</h3><p>Игра живет, пока она удивляет. Постоянно обновляйте сценарии: добавляйте временные миссии, редкие награды, спецсобытия. Пусть пользователи знают: что-то может измениться, и это стоит проверить.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/5/5.jpg",
        "animationDelay": "500ms"
    },
    {
        "id": 6,
        "date": "10 февраля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Топ-6 голосовых помощников на рынке: гид по выбору для бизнеса",
        "title2": "Голосовые помощники для бизнеса",
        "text": "<p>Российский рынок голосовых технологий в 2025 году вырос до 561 млн долларов. Рост 40–80% в год. Голосовые помощники уже давно стали рабочими лошадками бизнеса: они обрабатывают до 80% звонков без участия человека, сокращают время ответа на 60% и экономят треть бюджета колл-центра. Кажется, что робот понимает клиентов лучше, чем живой оператор, и при этом не капризничает и не берет отпуск.</p><p>Этот текст для тех, кто устал от бесконечных звонков и хочет, чтобы клиентский сервис работал. Для компаний, которым нужен инструмент, который разгрузит колл-центр и принесет результаты. Разбираемся, какие голосовые помощники есть на рынке, что они умеют и как их внедрить в рабочие процессы.</p><h2>Как работает голосовой помощник</h2><p>Современный голосовой ассистент — это сложная система из трех ключевых компонентов:</p><p><strong>Первый — ASR, распознавание речи.</strong> Система слушает не просто голос, а все вокруг: лай собаки, шум дороги, крики детей. Она вычленяет главное и игнорирует остальное. Современные алгоритмы настолько уверенные, что акцент или плохой микрофон перестали быть проблемой.</p><p><strong>Второй — NLP, обработка естественного языка.</strong> Тут машина пытается понять, что вы имели в виду. «Где моя посылка?» и «хочу узнать про заказ» для нее одно и то же. Она ловит контекст, настроение и даже недосказанность, почти как внимательный собеседник, только без скучных комментариев.</p><p><strong>Третий — TTS, синтез речи.</strong> На этом этапе система подбирает интонации, ставит паузы и ударения. Технологии вроде Яндекс SpeechKit или Google WaveNet создают голоса, которые звучат по-человечески: с дыханием, с теплом и даже с легкой усталостью, будто кто-то действительно стоит на другом конце линии и живо отвечает.</p><p>Все три компонента работают за доли секунды. Вы задаете вопрос, ассистент слушает, думает и выдает осмысленный ответ.</p><h2>Топ 6 голосовых помощников</h2><h3>1. Алиса от Яндекса</h3><img src=\"/assets/статьи/6/1.Алиса от Яндекса.jpg\" alt=\"Алиса от Яндекса\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Алису знают почти все: больше 90% российских пользователей хотя бы раз сталкивались с ней. С 2017 года она постепенно расползлась по экосистеме Яндекса — от Музыки и карт до такси и навигатора.</p><p>За всем этим стоит YandexGPT. Он понимает речь, разбирает сложные запросы на простые действия и даже в играх подсказывает, что происходит на экране, как ассистент, который видит больше, чем вы сами.</p><p><strong>Что умеет:</strong></p><ul><li>Управляет умным домом: свет, кондиционер, пылесос.</li><li>Переводит тексты на 100+ языков.</li><li>Развлекает и обучает детей, напоминает о делах.</li><li>Создает голосовые сценарии для вечера: сама подключает устройства, запускает таймеры, присылает уведомления.</li><li>Управляет автомобилем в Яндекс Авто: стекла, климат, дистанционно через Яндекс Станцию или приложение «Дом с Алисой».</li></ul><p><strong>Для бизнеса:</strong></p><ul><li>Алиса помогает компаниям создавать свои навыки и работать с клиентами через Яндекс.Диалоги. Все просто, без программистов, с помощью визуального конструктора. В 2025 году она встроилась в Яндекс.Браузер и научилась анализировать страницы, давать ответы и собирать нужные ссылки.</li><li>Создает навыки через Яндекс.Диалоги без кода.</li><li>Анализирует страницы в Яндекс.Браузере и формирует краткий ответ.</li><li>Новый режим «Рассуждения» дает развернутые ответы без изучения первоисточников.</li></ul><p><strong>Где работает:</strong> Смартфоны (iOS, Android), умные колонки, ТВ, компьютеры, автомобили. Алиса почти везде и уже не просто голос — а помощник, с которым приходится считаться.</p><h3>2. Салют от Сбера</h3><img src=\"/assets/статьи/6/2. Салют от Сбера.jpg\" alt=\"Салют от Сбера\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Сбер не ограничился одним голосовым помощником. На платформе GigaChat живут сразу три: Джой, Афина и Сбер. В 2023 году они решали около 70% клиентских вопросов в контакт-центре банка, а к ноябрю 2023-го число пользователей Салюта достигло 19,5 млн в месяц.</p><p><strong>Что умеет:</strong></p><ul><li>Салют понимает естественную речь, отвечает на вопросы, участвует в брейнштормах, управляет умным домом и выполняет поручения.</li><li>Поиск информации и переводы через СберБанк Онлайн.</li><li>Оплата услуг, запись к врачу через госуслуги, проверка задолженностей.</li><li>Заказ еды, подбор музыки по вкусу, рассказ последних новостей.</li><li>Поиск фильмов и телеканалов, управление умными устройствами.</li><li>Генерация идей, редактирование текста, написание кода через мультимодальную нейросеть GigaChat.</li></ul><p><strong>Для бизнеса:</strong></p><ul><li>Салют позволяет компаниям создавать навыки и приложения через SmartApp Studio. Разработчики публикуют их в каталоге SmartMarket, а проверенные модерацией приложения получают статус «смартап» — готовое к использованию решение.</li><li>Платформа умного дома SberDevices интегрирована с виртуальным ассистентом Салют и открыта для сторонних разработчиков через API.</li><li>Компании могут интегрировать Салют в свои сервисы, включая гостиницы — помощь гостям, управление сервисами, бронирование.</li><li>Интеграция AI во все бизнес-процессы в 2023 году принесла Сберу 350 млрд рублей дополнительного дохода.</li></ul><p><strong>Где работает:</strong> Мобильные приложения «Сбербанк Онлайн» и «Салют» (бывш. «Сбер Салют»), умные устройства Sber и устройства сторонних производителей (первым интеграцию объявил HONOR), десктопная версия «Сбербанк Онлайн». Android, iOS, веб, умные колонки, ТВ — почти везде, где есть пользователь.</p><h3>3. Google Assistant</h3><img src=\"/assets/статьи/6/3. Google Assistant.jpg\" alt=\"Google Assistant\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Google Assistant — один из самых сильных голосовых помощников, потому что встроен во всю экосистему Google. По данным компании, около 70% мировых фирм уже используют или собираются внедрять ИИ-технологии.</p><p><strong>Что умеет:</strong></p><p>Google Assistant помогает с информацией, мультимедиа, организацией дня и умным домом:</p><ul><li>Поиск информации: погода, новости, ответы на вопросы.</li><li>Переводы денег через Google Pay.</li><li>Работа с галереей и мультимедиа на телефоне.</li><li>Построение маршрутов и поиск локаций через Google Карты.</li><li>Перевод текста, напоминания и будильники через Google Календарь.</li><li>Запись и отправка сообщений, звонки.</li><li>Управление умным домом.</li></ul><p><strong>Для бизнеса:</strong></p><p>Google Assistant улучшает продуктивность и экономит время:</p><ul><li>Голосовые напоминания и заметки: скажите «Ок, Гугл», надиктуйте заметку или напоминание. Система учтет расписание, привычки, пробки и подберет оптимальное время.</li><li>Планирование и назначение встреч: Assistant проверяет расписания, предлагает свободное время и выбирает место для встреч без сложных команд.</li><li>Google Voice для организаций: сотрудникам выдаются номера для звонков, SMS и голосовой почты, которые можно связать с любым мобильным или стационарным номером. Администратор настраивает группы вызова, автосекретаря и управляет лицензиями.</li><li>Автоматизация бизнес-процессов: интеграция с Gmail, Google Calendar, Google Drive и Google Sheets позволяет ускорить рабочие задачи и уменьшить рутину.</li></ul><p><strong>Где работает:</strong> iOS, Android, умные часы, компьютеры, ТВ — Assistant доступен почти на всех устройствах Google и не только.</p><h3>4. Siri от Apple</h3><img src=\"/assets/статьи/6/4. Siri от Apple.jpg\" alt=\"Siri от Apple\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Siri — один из первых голосовых помощников, появившийся в 2011 году. Она работает во всех устройствах Apple и управляет экосистемой компании, от iPhone до HomePod.</p><p><strong>Что умеет:</strong></p><p>Siri отвечает на вопросы, управляет устройствами и помогает выполнять повседневные задачи:</p><ul><li>Отвечает на вопросы о погоде, новостях и курсах валют.</li><li>Управляет устройствами Apple и системой умного дома HomeKit.</li><li>Выполняет поручения: отправка сообщений, создание напоминаний, будильников, запуск музыки, подкастов, видео.</li><li>Строит маршруты и помогает с навигацией.</li></ul><p><strong>Для бизнеса:</strong></p><p>Siri экономит время и помогает автоматизировать работу:</p><ul><li>Поиск контактной информации — находит телефоны, адреса и почту в сохраненных контактах.</li><li>Телефонные звонки — совершает звонки без участия рук, просто по имени контакта.</li><li>Apple Business Chat — канал для общения компаний с клиентами через «Сообщения». Пользователь может задать вопрос, записаться на прием, получить ссылку или оплатить покупку через Apple Pay прямо в чате.</li><li>Модернизация 2025 года — Apple переписала Siri с применением больших языковых моделей. Теперь она управляет функциями приложений: открывает документы, сортирует заметки, удаляет письма, делится ссылками и запускает новости.</li><li>Обновленная Siri обрабатывает цепочки команд: может расшифровать аудиозапись, выделить ключевые моменты и отправить резюме коллеге.</li><li>Обработка данных выполняется локально или в облаке, а безопасность обеспечивается системой Apple Chips in Data Centers (ACDC)</li></ul><p><strong>Где работает:</strong> iPhone, iPad, Mac, Apple Watch.</p><h3>5. Amazon Alexa</h3><img src=\"/assets/статьи/6/5. Amazon Alexa.jpg\" alt=\"Amazon Alexa\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>На 2025 год Alexa поддерживает более 600 миллионов активных устройств по всему миру. Это включает не только колонки Echo, но и телевизоры, холодильники, термостаты, лампочки и даже автомобили.</p><p><strong>Что умеет:</strong></p><p>Alexa управляет домом, ищет информацию и берет на себя рутину:</p><ul><li>Находит ответы на вопросы и озвучивает актуальные данные.</li><li>Воспроизводит музыку и подкасты.</li><li>Составляет списки покупок и дел.</li><li>Управляет освещением, климатом и безопасностью дома.</li></ul><p><strong>Для бизнеса:</strong></p><p>Amazon выпустила корпоративную версию — Alexa for Business. Голосовой помощник помогает делать работу быстрее и проще. Компании используют его, чтобы искать информацию голосом, показывать нужный контент и продвигать свои продукты.</p><ul><li>Голосовое управление совещаниями: «Alexa, присоединись к встрече», «Alexa, заверши совещание».</li><li>Работа с календарем, напоминаниями и расписаниями.</li><li>Интеграция с корпоративными системами — Cisco TelePresence, Zoom Rooms, Polycom.</li><li>Создание частных навыков для внутренних приложений вроде Salesforce или ServiceNow.</li><li>Централизованное управление корпоративными устройствами и доступом.</li></ul><p><strong>Где работает:</strong> Умные колонки, смартфоны, планшеты, корпоративные конференц-залы.</p><h3>6. Кастомные голосовые ассистенты от CDI</h3><p>Это не еще одна Алиса или Siri, которые есть у всех. Это инструмент, построенный полностью под ваш бизнес, ваши процессы и ваш бренд. Если готовые ассистенты ограничены шаблонными навыками и однотипными ответами, кастомный ассистент от CDI — это адаптивный инструмент, который понимает ваши задачи и умеет говорить так, как нужно вашему бренду, а не «по книжке».</p><p><strong>Что умеет:</strong></p><ul><li><strong>Говорит как нужно.</strong> Вы сами выбираете тон, фразы и стиль. Ассистент может быть солидным, дружелюбным или отражать индивидуальность вашей компании.</li><li><strong>Работает со всеми системами.</strong> ERP, CRM, базы данных, корпоративные приложения — подключается и выполняет задачи без участия человека.</li><li><strong>Снимает рутину.</strong> Повторяющиеся звонки, сообщения, бронирования, рассылки — ассистент делает все сам. Эконом до половины времени сотрудников.</li><li><strong>Подстраивается под клиента.</strong> Понимает настроение, меняет ответы на лету. Раздраженный посетитель получит аккуратный совет, увлеченный — развернутый и полезный ответ.</li></ul><h3>Как это работает на практике</h3><p>Пример ВДНХ показывает, как работает кастомный голосовой ассистент от CDI. Это не «Алиса» и не «Siri», а инструмент, созданный под конкретную площадку. Территория огромная, событий тысячи, вопросов сотни — и ассистент справляется с этим в реальном времени. Он сразу понимает запросы посетителей: наука, концерты под открытым небом, мастер-классы для детей. Спросили «Какие завтра события?» — получаете подборку. «Куда с детьми?» — готовые маршруты и шоу, с учетом истории ваших запросов.</p><p>Сотрудники ВДНХ больше не тратят время на однотипные вопросы. Ассистент работает круглосуточно и превращает большую площадку в управляемый персонализированный сервис. Это голосовой помощник, который экономит время и облегчает работу посетителям и администрации.</p><h3>Почему это важно для бизнеса</h3><ul><li>Голосовой ассистент полностью подстраивается под компанию: ответы, сценарии и рекомендации отражают бренд и процессы.</li><li>Он берет на себя рутинные задачи: обработку однотипных запросов, подборки событий, маршруты, уведомления.</li><li>Экономит время сотрудников: меньше однотипной работы, больше сил на задачи, где нужен человек.</li><li>Снижает ошибки и задержки: работает круглосуточно, без усталости, пропусков и раздражения.</li><li>Делает сервис удобным для клиентов: персонализированные рекомендации, быстрые ответы и точные подсказки повышают лояльность и вовлеченность.</li></ul><p><strong>Где работает:</strong> Мобильные приложения (iOS, Android), веб, голосовые устройства, колл-центры, корпоративные системы. Ассистент работает там, где нужны быстрые, точные и персонализированные ответы, сохраняя единую логику общения с пользователем.</p><h2>Как выбрать голосового помощника для бизнеса</h2><p><strong>Шаг 1. Определите цель.</strong> Решите, зачем вам ассистент: отвечать на частые вопросы, обрабатывать заказы, информировать клиентов, обзванивать базу или стать полноценным виртуальным консьержем.</p><p><strong>Шаг 2. Оцените масштаб задач.</strong> Посчитайте, сколько запросов в день будет обрабатывать помощник, нужна ли круглосуточная работа и какая глубина интеграции с существующими системами требуется.</p><p><strong>Шаг 3. Учитывайте экосистему.</strong> Если ваш бизнес работает внутри Яндекса, Сбера, Google или Apple, выбирайте соответствующего помощника для максимально гладкой интеграции.</p><p><strong>Шаг 4. Проанализируйте аудиторию.</strong> Поймите, где находятся ваши клиенты, какими устройствами пользуются и предпочитают ли они голосовое или текстовое взаимодействие.</p><p><strong>Шаг 5. Рассчитайте бюджет.</strong> Готовые решения вроде Алисы, Салюта, Маруси, Google Assistant или Siri подходят для базовых задач. Корпоративные версии, такие как Alexa for Business или Олег от Т‑Банка, требуют вложений, но окупаются быстро.</p><p><strong>Шаг 6. Тестируйте перед масштабированием.</strong> Начните с пилотного проекта на небольшой группе клиентов, собирайте обратную связь, дорабатывайте сценарии и только потом расширяйте.</p><p><strong>Шаг 7. Комбинируйте ассистента с операторами.</strong> Оптимальный уровень автоматизации — 40‑50 % звонков. Голосовые помощники снимают рутину, а сложные задачи остаются за живыми специалистами. Сегодня почти каждый третий звонок совершается нейросетью, количество переводов на оператора снизилось на 40 %.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/6/6.jpg",
        "animationDelay": "700ms"
    },
    {
        "id": 7,
        "date": "15 февраля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Компьютерное зрение: как машины учатся видеть и что это значит для бизнеса",
        "title2": "Компьютерное зрение",
        "text": "<p>Машины наконец-то научились «смотреть» и теперь делают это с особой сосредоточенностью. Камеры, раньше мирно пылившиеся на потолке офиса, теперь анализируют: кто зашел, сколько времени смотрел на витрину и доволен ли качеством помидоров. Компьютерное зрение стало тем коллегой, который не устает, не моргает и не уходит на обед, но при этом знает о нас чуть больше, чем хотелось бы.</p><p>К 2024 году мировой рынок компьютерного зрения дорос до $20 миллиардов. Российский — до 38 миллиардов рублей. Дальше — больше: камеры будут не только смотреть, но и понимать. На заводах — искать дефекты лучше любого технолога, в медицине — замечать то, что ускользает от глаза врача, в городах — превращаться в нейросетевые «глаза» умной инфраструктуры. Мир становится под присмотром, и, кажется, впервые в истории не человек наблюдает за машинами, а наоборот.</p><h2>Что такое компьютерное зрение</h2><p>Компьютерное зрение (computer vision) — это способ научить машину воспринимать визуальный мир осмысленно. Разбираться в том, что именно попало в кадр. Камера фиксирует изображение, алгоритм решает, что перед ним: человек, автомобиль, упаковка товара или дефект на детали. Все просто до тех пор, пока не начинаешь понимать, сколько труда вложено в то, чтобы компьютер понял очевидное.</p><p>Система CV состоит из двух частей:</p><p><strong>Аппаратная.</strong> Камеры, сенсоры, лидары и другие устройства, которые собирают изображение с предельной точностью. Они не устают, не отвлекаются и не теряют фокус.</p><p><strong>Программная.</strong> Алгоритмы и нейросети, способные вычленять на картинке объекты, распознавать их и делать выводы. Здесь пиксели превращаются в смысл.</p><p>Современные CV-системы способны определять не только форму или цвет предмета, но и контекст: кто находится в кадре, какие действия совершаются, есть ли отклонения от нормы.</p><h2>Как работает компьютерное зрение</h2><p>Каждое изображение для компьютера — это не закат над морем и не селфи с котом, а таблица из миллионов чисел. Каждое число отвечает за яркость и цвет одной пиксельной точки. Мы видим картинку целиком, компьютер — набор цифр. Его нужно научить замечать закономерности там, где человек полагается на интуицию. Для этого придумали нейронные сети, вдохновленные устройством мозга.</p><p>Процесс выглядит почти как тренировка спортсмена, только вместо гантелей — терабайты данных:</p><ul><li><strong>Съемка.</strong> Камера фиксирует сцену и передает ее в виде цифрового массива чисел.</li><li><strong>Предобработка.</strong> Алгоритмы убирают шум, выравнивают освещение, подчеркивают контуры.</li><li><strong>Сверточная нейросеть (CNN).</strong> Специальные фильтры «просматривают» изображение, выделяя линии, углы, текстуры.</li><li><strong>Глубокие слои.</strong> Сеть постепенно учится понимать сложные формы: глаза, лицо, автомобиль, деталь механизма.</li><li><strong>Классификация.</strong> Алгоритм сопоставляет найденные признаки с тем, что уже видел, и выносит вердикт: «человек», «кошка», «трещина на поверхности».</li></ul><p>Обучение идет по принципу обратной связи. Сеть делает предположение, сверяется с правильным ответом и немного умнеет. Миллионы итераций спустя машина начинает видеть мир не хуже человека.</p><h2>Как обучается компьютерное зрение</h2><img src=\"/assets/статьи/7/Как обучается компьютерное зрение.jpg\" alt=\"Как обучается компьютерное зрение\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Чтобы научить компьютер «видеть», ему нужны тысячи примеров. Машина не знает, что такое кот — ей показывают сотни тысяч изображений, где кот есть и где его нет. Алгоритм ищет закономерности: форму ушей, контуры морды, тени усов. Чем больше и разнообразнее набор данных, тем точнее становится модель. Если ошибки все еще велики, систему дообучают, как студента, который не выучил билет.</p><p>Обучение происходит в облаке, где мощные GPU обрабатывают гигабайты изображений. Алгоритм проходит три ключевых этапа:</p><ul><li><strong>Классификация</strong> — определяет, к какому типу относится объект.</li><li><strong>Локализация</strong> — находит его на картинке.</li><li><strong>Реконструкция</strong> — очищает изображение и выделяет главное.</li></ul><p>Для этого применяются методы вроде размытия по Гауссу и алгоритмы SIFT, SURF, HOG. Они превращают картинку в набор чисел — дескрипторов, которые затем группируются и упрощаются. В результате машина перестает смотреть на изображение как на набор пикселей и начинает видеть смыслы.</p><h2>Где используется компьютерное зрение</h2><img src=\"/assets/статьи/7/Где используется компьютерное зрение.jpg\" alt=\"Где используется компьютерное зрение\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h3>1. Ритейл</h3><p>Компьютерное зрение научилось смотреть на покупателей так, как раньше могли только маркетологи с десятилетним стажем и таблицами Excel. Камеры с ИИ считают прохожих у витрин, фиксируют, кто задержался у полок и какие товары вызвали живой интерес. Все это без усталости и лишних эмоций.</p><p>Магазины формата Amazon Just Walk Out позволяют просто взять товар и уйти — камеры с CV сами определят покупку и спишут оплату. Российские сети тоже не отстают: «Магнит» и «Лента» отмечают рост среднего чека на 17–19% после внедрения систем, анализирующих поведение покупателей и оптимизирующих полки.</p><h3>2. Промышленность</h3><p>На производстве компьютерное зрение превратилось в рабочий инструмент, который не моргает и не ошибается. Камеры с нейросетями проверяют детали с точностью до микронов. Алгоритм видит то, что ускользает от человеческого глаза: трещины, неровности, перекосы, износ. Ошибка становится статистическим исключением, а контроль качества — непрерывным процессом, где нет усталости и субъективности.</p><p>По данным TAdviser, в России рынок CV-решений достиг 38 млрд рублей, из них 78% — отечественные разработки. Лидируют нефтегаз (41% проектов) и сельское хозяйство (19%), но именно промышленность превращает CV в инструмент операционного превосходства. Там, где раньше стояли контролеры, теперь работают умные камеры, делающие производство почти безошибочным.</p><h3>3. Транспорт и логистика</h3><p>Беспилотные автомобили, такие как Tesla и беспилотники от Яндекса не могли бы существовать без компьютерного зрения. Камеры и лидары считывают дорогу, разметку, пешеходов и препятствия в реальном времени, словно невидимый шофер с миллионными рефлексами.</p><p>CV нашло применение и в логистике. С его помощью сортируют посылки, распознают номера машин и учитывают грузы. Компания DHL уже автоматизировали процесс, обрабатывая до 4500 посылок в час с точностью 99,97%. Скорость и аккуратность, которых человеку не достичь без ошибок.</p><h3>4. Сельское хозяйство</h3><p>Компьютерное зрение становится новым агрономом — точным и внимательным. Камеры и алгоритмы следят за полями, оценивают состояние растений и почвы, замечают малейшие отклонения, которые человек часто пропускает.</p><p>Система Sonoma управляет теплицей почти полностью автономно. Камеры и датчики фиксируют влажность, температуру и освещенность, а искусственный интеллект регулирует полив и питание. Результат — урожай стабильно высокого качества при минимальных затратах. Ферма превращается в умную экосистему, где решения принимаются не интуицией, а данными.</p><h3>5. Умные города и безопасность</h3><p>Компьютерное зрение стало глазами современного города. Камеры с ИИ распознают лица, фиксируют нарушения, анализируют транспортный поток и даже пытаются предсказать, где может возникнуть опасная ситуация.</p><p>В крупных городах мира: в Москве, Лондоне, Пекине уже действуют платформы, объединяющие миллионы камер с центрами аналитики. Они отслеживают инциденты в реальном времени, регулируют движение, выявляют узкие места и оперативно реагируют на ЧП. Каждое событие фиксируется, анализируется и становится частью общей картины. CV делает управление городом быстрее, точнее и менее зависимым от человеческой интуиции.</p><h2>Почему это важно для бизнеса</h2><p>Компьютерное зрение научилось превращать визуальные данные в управленческие решения почти мгновенно. То, что раньше требовало часов наблюдений, десятков сотрудников, теперь делается автоматически, быстро и без ошибок.</p><p><strong>Преимущества виртуального зрения:</strong></p><ul><li><strong>Автоматизация и экономия.</strong> CV берет на себя рутинные задачи: подсчет товаров, контроль качества, анализ видео. Компания экономит время и деньги, будто нажала кнопку «сделай все сама» и получила результат без ошибок.</li><li><strong>Безопасность и точность.</strong> Биометрия ускоряет обслуживание и почти исключает человеческий фактор, превращая идентификацию в процесс без сюрпризов.</li><li><strong>Повышение производительности.</strong> Алгоритмы работают круглосуточно, не устают и постоянно учатся, делая результаты с каждой итерацией точнее.</li><li><strong>Рост доходов.</strong> В ритейле CV увеличивает средний чек и оптимизирует выкладку, на производстве снижает брак и потери, в логистике ускоряет обработку заказов. Процессы становятся почти совершенными.</li><li><strong>Прозрачность процессов.</strong> Система фиксирует все: действия сотрудников, состояние оборудования, упрощая аудит и управление. Все становится видимым и управляемым, как на дисплее умного города.</li></ul>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/7/7.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": 8,
        "date": "20 февраля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Что такое LLM, NLP, ML и DL: полное руководство для бизнеса",
        "title2": "LLM, NLP, ML и DL",
        "text": "<p>Рынок ИИ в России за прошлый год вырос на 18%. Звучит громко, но если присмотреться, окажется, что четверть компаний до сих пор не понимают, зачем им весь этот искусственный интеллект. Для них «LLM» и «NLP» — что-то вроде непонятных ингредиентов на этикетке: вроде знакомые буквы, а смысл ускользает. При этом по расчетам «Яков и Партнеры» к 2028 году ИИ может добавить к ВВП до 4% — а это триллионы рублей, которые словно появляются из пустоты.</p><p>Проблема проста: незнание. Треть руководителей честно говорят, что не понимают, что это за зверь и как его приручить. Одни компании уже обучают нейросети вести переговоры и считать закупки, а другие до сих пор живут страшилками из новостей про «роботов, которые всех уволят». Поэтому мы попробуем разложить по полочкам: чем отличаются ML, DL, NLP и LLM и почему путать их примерно то же самое, что ставить чайник на плиту и ждать, что он выведет спутник на орбиту.</p><h2>Искусственный интеллект: общая картина</h2><p>Искусственный интеллект (AI) — это общее название для технологий, которые пытаются воспроизвести человеческое мышление. Внутри него находятся машинное обучение (ML), еще глубже — обработка естественного языка (NLP) и глубокое обучение (DL). Внутри DL развивается генеративный ИИ, а уже в нем — большие языковые модели (LLM).</p><p>Проще всего представить это как матрешку. Каждый уровень не отменяет предыдущий, а уточняет его.</p><ul><li>ML учит компьютер находить закономерности;</li><li>NLP понимает человеческую речь;</li><li>DL работает со сложными структурами вроде изображений или речи;</li><li>LLM специализируются на языке — понимает, пишет и общается.</li></ul><h2>Machine Learning (ML) – машинное обучение</h2><img src=\"/assets/статьи/8/Machine Learning (ML) – машинное обучение.png\" alt=\"Machine Learning (ML) – машинное обучение\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Машинное обучение — это технология, которая позволяет компьютерам самим находить закономерности в данных. Здесь никто не прописывает пошаговый алгоритм «если Х, то делай Y». Системе показывают массу примеров, а она сама учится связывать вход и выход. В итоге компьютер перестает быть «исполнителем инструкций» и превращается в что-то вроде студента, который после сотни задач начинает понимать общий принцип.</p><p>У машинного обучения есть три главные ветки:</p><p><strong>Обучение с учителем.</strong> У модели есть размеченные данные, где каждому примеру соответствует правильный ответ. Она буквально «учится у преподавателя»: смотрит на тысячи медицинских карт с диагнозами и по ним учится находить признаки болезни у новых пациентов.</p><p><strong>Обучение без учителя.</strong> Здесь правильных ответов нет, и алгоритм сам ищет закономерности. Например, делит клиентов интернет-магазина на группы по поведению: кто покупает один раз в год, кто каждую неделю, а кто только смотрит каталог и уходит.</p><p><strong>Обучение с подкреплением.</strong> Это уже не «учебник с ответами» и не «самостоятельная работа», а жизнь по принципу проб и ошибок. Алгоритм получает поощрение за удачные действия и наказание за ошибки. Так учат роботов держаться на ногах или игрового бота выигрывать в шахматы.</p><h3>Практическое применение ML в бизнесе</h3><p>Машинное обучение сегодня используется практически во всех отраслях:</p><p>В маркетинге ML анализирует поведение клиентов, их предпочтения и историю покупок и на основе этого формирует персональные предложения. Для компаний это почти как консультант, который знает каждого клиента лучше, чем он сам. 92% компаний уже используют ML для персонализации.</p><p>Прогнозирование спроса стало настоящим «гаданием на кофейной гуще», только без ошибок. Алгоритмы вычисляют, сколько товаров понадобится завтра, как оптимально расставить запасы и избежать дефицита. Amazon применяет ML для динамического ценообразования: цена меняется в реальном времени, подстраиваясь под спрос.</p><p>Чат-боты и виртуальные ассистенты на базе ML работают круглосуточно, отвечают на вопросы клиентов и снимают нагрузку с операторов. В финансах ML стал настоящим сторожем: анализирует транзакции и ловит мошенников еще до того, как клиент заметит проблему.</p><p>В России машинное обучение активно внедряют. Сбер использует свои модели для клиентского сервиса и автоматизации процессов, а промышленность применяет ML для оптимизации производства — 68% компаний уже пользуются этим инструментом. Машинное обучение перестало быть «игрушкой для айтишников», оно стало реальным инструментом, который экономит деньги, предсказывает будущее и делает бизнес более предсказуемым.</p><h2>Natural Language Processing (NLP) – обработка естественного языка</h2><img src=\"/assets/статьи/8/Natural Language Processing (NLP) – обработка естественного языка.png\" alt=\"Natural Language Processing (NLP) – обработка естественного языка\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Обработка естественного языка, или NLP, — это то, что позволяет компьютеру понимать человеческую речь не как набор слов, а как смысловые конструкции с нюансами, эмоциями и контекстом. Машина учится видеть разницу между «все нормально» и «все нормально?» и понимать, когда фраза на самом деле значит противоположное.</p><h3>Практическое применение NLP в бизнесе</h3><p>NLP сегодня превращает компьютеры в тех, кто не просто читает текст, а действительно понимает, о чем он.</p><p>Автоматический перевод — самый наглядный пример: системы учитывают стиль, терминологию, интонацию и нередко выдают результат лучше, чем средний профессиональный переводчик.</p><p>Анализ настроений клиентов стал привычным инструментом маркетологов. NLP разбирает отзывы, комментарии и обратную связь, выявляя, как аудитория воспринимает бренд. Решения вроде Success KPI анализируют тональность звонков и сообщений в контакт-центрах, превращая эмоции клиентов в конкретные инсайты.</p><p>Умные чат-боты работают почти как живой оператор. Они понимают естественный язык, ведут диалог и умеют подстраиваться под пользователя. T‑Mobile, например, использует NLP для поиска ключевых слов в текстовых сообщениях и выдачи персонализированных рекомендаций.</p><p>Обработка документов еще одна сфера, где NLP незаменим. В страховании, медицине, юриспруденции модели автоматически просматривают огромные объемы текстов, извлекают информацию и защищают конфиденциальные данные.</p><p>В России примеры тоже есть: платформа SaluteSpeech от Сбера умеет распознавать и синтезировать речь, внедряя понимание естественного языка в разные продукты. NLP перестает быть «экспериментом для айтишников» и становится инструментом компаний, который автоматизирует процессы, помогает работать с большими объемами информации и извлекать из них смысл.</p><h2>Deep Learning (DL) – глубокое обучение</h2><img src=\"/assets/статьи/8/Deep Learning (DL) – глубокое обучение.png\" alt=\"Deep Learning (DL) – глубокое обучение\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Глубокое обучение стало тем самым зрением машин, которое делает их способными видеть, чувствовать и предсказывать. Компьютерное зрение с помощью сверточных нейронных сетей учит алгоритмы различать лица, предметы, тексты — и делает это с точностью, недостижимой для человеческого глаза. В бизнесе компьютерное зрение помогает отслеживать качество продукции, анализировать медицинские изображения, повышать безопасность.</p><h3>Практическое применение DL в бизнесе</h3><p>В финтехе глубокое обучение работает как следователь — замечает малейшие отклонения в поведении пользователей и ловит мошенников по следу цифровых следов. Оно само учится, подстраивается, эволюционирует быстрее, чем появляются новые схемы обмана.</p><p>В продажах нейросети прогнозируют, кто из клиентов готов к разговору, кто — к покупке, сокращая звонки и увеличивая встречи. Они анализируют речь, мимику, эмоции, чтобы понять не просто «что сказал человек», а «что он имел в виду».</p><p>В промышленности глубокое обучение стало инструментом профилактики: предсказывает поломки, оптимизирует процессы, следит за оборудованием. Системы, вроде внедренной компанией DHL, контролируют десятки тысяч машин и снижают издержки и простои — так, как раньше не мог ни один инженер.</p><p>В России технологии глубокого обучения уже встроены в реальность: они распознают лица в метро, анализируют металлургические процессы, управляют потоками данных и принимают решения быстрее любого оператора. Машины начали видеть, думать и учиться — и делают это все лучше.</p><h2>Large Language Models (LLM) – большие языковые модели</h2><img src=\"/assets/статьи/8/Large Language Models (LLM) – большие языковые модели.png\" alt=\"Large Language Models (LLM) – большие языковые модели\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Большая языковая модель — это нейросеть, которая учится говорить на человеческом языке, переваривая терабайты текстов: от научных статей до форумных переписок. Она понимает контекст, строит связи и предсказывает, какое слово должно быть следующим. LLM стоит на пересечении трех технологий:</p><ul><li>NLP учит ее понимать смысл;</li><li>ML — извлекать закономерности из данных;</li><li>DL — видеть глубже, сквозь слои смысла.</li></ul><p>Чтобы создать GigaChat, разработчики обработали 7,5 петабайта текстов — это примерно как если бы собрать полсотни Ленинских библиотек и заставить их разговаривать между собой.</p><h3>Трансформация бизнес-процессов через LLM</h3><p>Большие языковые модели становятся новым мотором цифровой трансформации бизнеса. В клиентском сервисе они заменяют целые отделы поддержки: Т-Банк запустил экосистему помощников — секретарь отвечает на звонки, финансовый ассистент анализирует траты, персональный шопер подбирает товары. В Klarna чат-бот на базе ChatGPT взял на себя две трети обращений, фактически заменив работу семисот сотрудников и сократив время решения проблем с 11 до 2 минут.</p><p>В сфере контента языковые модели превращаются в соавторов. Они пишут тексты, адаптируют их под SEO и формат площадки, генерируют идеи и правят формулировки, сохраняя тон бренда. В юридической практике LLM анализируют договоры, находят смысловые расхождения и оценивают финансовые риски, экономя часы рутинной проверки.</p><p>Корпоративные базы знаний. Они становятся коллективной памятью компании, хранят контекст проектов, инструкции, кейсы и ответы на типовые вопросы. В ТТК уже внедрен цифровой консультант на базе нейросетей: он помогает новым сотрудникам быстрее адаптироваться и разгружает HR-отдел.</p><p>В аналитике LLM действуют как мгновенный исследователь. Там, где команда собирала данные неделями, модель за часы формирует отчеты, выделяет тренды и подсказывает решения. В автомобильной отрасли языковые модели уже работают с клиентами напрямую — объясняют характеристики, сравнивают модели, рассказывают об условиях покупки.</p><h2>Как выбрать ML DL NLP или LLM для вашей компании</h2><img src=\"/assets/статьи/8/Как выбрать ML DL NLP или LLM для вашей компании.png\" alt=\"Как выбрать ML DL NLP или LLM для вашей компании\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Мы разобрались, что такое ML, DL, NLP и LLM, но какая технология подойдет именно для вашего бизнеса. Кратко объясняем:</p><h3>Когда использовать ML</h3><p>Выбирайте машинное обучение для задач с структурированными данными, где важны скорость принятия решений и интерпретируемость результатов:</p><ul><li>скоринг клиентов;</li><li>прогнозирование спроса;</li><li>оптимизация логистики;</li><li>выявление мошенничества в реальном времени.</li></ul><h3>Когда выбрать DL</h3><p>Глубокое обучение выбирают там, где нужно работать с изображениями, видео, аудио или текстом. Оно незаменимо:</p><ul><li>в системах контроля качества;</li><li>медицинской диагностике;</li><li>безопасности;</li><li>распознавании речи.</li></ul><h3>Применение NLP</h3><p>Natural Language Processing незаменим при работе с текстовыми данными и человеческой речью:</p><ul><li>автоматизация службы поддержки;</li><li>анализ социальных сетей;</li><li>обработка документооборота;</li><li>голосовые интерфейсы.</li></ul><h3>Внедрение LLM</h3><p>Большие языковые модели подходят для комплексной работы с текстовой информацией и создания ИИ помощников:</p><ul><li>генерация контента;</li><li>корпоративные базы знаний;</li><li>сложная аналитика документов;</li><li>персонализированное общение с клиентами.</li></ul><h3>Российский опыт внедрения</h3><p>90% из топ-100 крупнейших российских компаний уже используют технологии машинного обучения. В Т-Банке ИИ интегрирован в продукты экосистемы из 45 миллионов клиентов — от финансовых сервисов до телеком и лайфстайл-решений.</p><p>Российские компании активно создают собственные решения: GigaChat от Сбера, YandexGPT от Яндекса, различные отраслевые системы на базе ML и DL. Особенно активно технологии внедряются в производстве — Северсталь, НЛМК, ММК, Газпром нефть используют ИИ для оптимизации процессов и предиктивной аналитики.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/8/8.jpg",
        "animationDelay": "500ms"
    },
    {
        "id": 9,
        "date": "25 февраля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Что такое RAG-система и как заставить ИИ не лгать",
        "title2": "RAG-система",
        "text": "<p>ИИ любят представлять как робота, который никогда не ошибается. На самом деле без должных правил он быстро начинает фантазировать и лгать. В этой статье мы покажем, как RAG превращает горы документов и данных в рабочую систему: находит нужное, собирает понятные ответы, указывает источники и экономит время всем, кто каждый день работает в информации.</p><h2>Что такое RAG-система</h2><img src=\"/assets/статьи/9/Что такое RAG-система.jpg\" alt=\"Что такое RAG-система\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>RAG (Retrieval Augmented Generation) — это не «умный бот», а полноценная архитектура знаний: инструкции, CRM, база клиентов, документы, внешние источники — и каждая деталь влияет на ответ. Если хоть что-то устарело или неправильно структурировано, система выдаст ложь. Векторный поиск тут главный герой: он не ловит слова, а понимает смысл, превращая массив информации в картину, которой можно доверять и на основе которой реально принимаются решения.</p><h2>Как работает RAG</h2><img src=\"/assets/статьи/9/Как работает RAG.jpg\" alt=\"Как работает RAG\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Работа RAG — это два простых шага. Без них система остаётся красивой игрушкой, которая болтает, но не помогает.</p><p><strong>Первый шаг — поиск.</strong> Не «погуглить по словам», а реально понять, что вы имеете в виду, и достать именно тот кусок данных, который отвечает на вопрос. Это как когда вы спрашиваете у коллеги: «Где свежие тарифы?» — и он не кидает вам стопку папок, а открывает нужный файл и показывает нужный абзац. Векторные базы делают ровно это: ищут по смыслу, а не по букве.</p><p><strong>Второй шаг — генерация ответа.</strong> Языковая модель берет найденные куски и превращает их в связный текст. Разница с обычным ИИ видна сразу. Простая модель на вопрос «какие у нас тарифы?» выдаст данные за прошлый год, потому что в её памяти ничего свежее нет. А RAG сначала поднимет актуальный документ, потом аккуратно соберёт из него ответ — без фантазий и лишней воды. В итоге человек получает не абстрактное «что-то про цены», а конкретные цифры за текущий год.</p><h2>Применение RAG в бизнесе</h2><p>Современный бизнес живет в режиме «все меняется каждый день»: тарифы, контракты, учебные программы обновляются мгновенно, а устаревшие данные могут дорого стоить. Здесь на сцену выходит RAG: система находит точные данные в актуальных источниках и формирует понятный ответ. Ниже, где это реально работает:</p><h3>Клиентская поддержка</h3><p><strong>Проблема:</strong> сотрудники и чат-боты отвечают на сотни однотипных вопросов клиентов, которые постоянно меняются: тарифы, акции, условия доставки. Обычные языковые модели иногда дают устаревшую информацию или даже «придумывают» ответы.</p><p><strong>Как справляется RAG:</strong> система достает актуальные данные из документов, CRM и внешних источников и формирует точный, понятный ответ.</p><h3>Внутренние инструкции и документация</h3><p><strong>Проблема:</strong> огромные корпоративные базы знаний, инструкции и регламенты разбросаны по десяткам файлов. Сотрудники тратят часы на поиск нужной информации.</p><p><strong>Как справляется RAG:</strong> извлекает нужные фрагменты документов по смыслу, а не по ключевым словам. Сотрудник получает готовый ответ, не листая сотни документов.</p><h3>Аналитика и отчетность</h3><p><strong>Проблема:</strong> подготовка отчетов требует сбора данных из множества источников, фильтрации и агрегирования. Ошибки из-за устаревшей информации могут дорого стоить.</p><p><strong>Как справляется RAG:</strong> собирает актуальные данные, фильтрует их по смыслу и создает связный текст или сводный отчет.</p><h3>Образование и обучение</h3><p><strong>Проблема:</strong> преподаватели и образовательные платформы должны давать персонализированные ответы на вопросы учеников и учитывать постоянное обновление учебных материалов.</p><p><strong>Как справляется RAG:</strong> извлекает актуальные данные из учебников, методических указаний и онлайн-ресурсов, создавая точный и понятный ответ под конкретного ученика. Так формируются адаптивные программы обучения и автоматизируется помощь студентам.</p><h3>Продажи и консультации</h3><p><strong>Проблема:</strong> менеджеры по продажам должны быстро предоставлять клиентам точную информацию о продуктах, условиях, скидках и новых предложениях. Ошибки в коммуникации снижают продажи и доверие.</p><p><strong>Как справляется RAG:</strong> проверяет актуальные документы и CRM, выдавая корректные данные в удобном виде для клиента. Менеджеры работают быстрее, а риск ошибки минимален.</p><h3>Юридическая и финансовая проверка</h3><p><strong>Проблема:</strong> проверка договоров, контрактов и финансовых документов требует точности и актуальности. Любая ошибка может дорого стоить.</p><p><strong>Как справляется RAG:</strong> извлекает релевантные фрагменты из документов и внешних источников, формирует ответы с ссылками на источники. Юристы и аудиторы получают прозрачную проверку фактов без риска «галлюцинаций» ИИ.</p><h2>Преимущества RAG перед другими методами</h2><p>RAG решает две главные проблемы обычных языковых моделей: устаревшие знания и склонность выдумывать факты.</p><h3>Свежие данные без лишней головной боли</h3><p>Проблема классических моделей в том, что они «заморожены» на момент обучения. Каждое обновление данных требует переобучения, что дорого и долго. RAG работает иначе: он берет информацию из внешних источников. База документов обновляется регулярно и модель всегда отвечает по последним данным. Экономия очевидна, а актуальность — на уровне новостной ленты.</p><h3>Прозрачность и проверяемость</h3><p>RAG не просто выдает ответ, он показывает, откуда этот ответ взялся. Это как если бы у эксперта стоял рядом список источников: к каждому утверждению можно прикрепить ссылку на документ или страницу, где оно подтверждается. Для проверяющих, юристов и специалистов по безопасности это огромный плюс: факты не «витают в воздухе», а имеют конкретный источник.</p><h3>Меньше выдуманных фактов</h3><p>Главная сила RAG в том, что он перестает «галлюцинировать». Поскольку ответы строятся на конкретных документах, вероятность придуманных фактов сильно снижается. Но идеальной точности не бывает: критически важные данные все равно требуют двойной проверки. Можно сказать, RAG — это надежный напарник, который почти никогда не врет, но за ним все равно нужно присматривать.</p><h2>Сравнение RAG с другими методами языковых моделей</h2><p><strong>RAG</strong> — Достает актуальные данные из реальных источников, не «галлюцинирует», можно цитировать ссылки. Все обновляется в реальном времени — инструмент для бизнеса, где ценят точность и скорость. Недостатки: нужно заранее подготовить базу и настроить поисковый индекс. Без инженеров система быстро превращается в красивый, но бесполезный интерфейс.</p><p><strong>Fine-Tuning</strong> — Модель можно заставить говорить в нужном стиле и давать точные ответы по узкой теме — почти как хорошо дрессированная собака, которая выполняет только обученные команды. Недостатки: обучение долгое и дорогое, данные устаревают вместе с временем, любая корректировка входных данных превращает результат в хаос.</p><p><strong>LLM с длинным контекстом</strong> — Можно зашить все данные в промпт и получить быстрый ответ — удобно для анализа небольших массивов информации. Недостатки: с большими объемами данных легко запутаться: точность падает, модель начинает «фантазировать» — как пытаться выучить лекцию по памяти без шпаргалки.</p><p><strong>Классический поиск</strong> — Дешево и быстро: можно получить список ссылок и проверить самому. Недостатки: нет связного ответа, пользователь сам должен разгрести хаос. Легко пропустить важное, работать долго и без гарантий результата.</p><h2>Инструкция по внедрению RAG в компанию</h2><p>Внедрение RAG в бизнес — это не кнопка «включить ИИ» и расслабиться. Это создание инструмента, который не выдумывает ответы и не заставляет сотрудников проверять фантазии модели. Если хотите, чтобы ИИ перестал галлюцинировать и начал давать точные, актуальные ответы, следуйте нашей инструкции:</p><h3>1. Подготовка базы знаний</h3><p>Сначала соберите все, что может пригодиться модели: инструкции, договоры, отчеты, CRM‑данные, релевантные внешние источники. Важно не просто «собрать файлы», а убедиться, что информация структурирована и актуальна. Старые документы и разрозненные заметки — ужас любой RAG‑системы</p><h3>2. Настройка механизма поиска</h3><p>Поиск информации — сердце RAG. Обычные совпадения ключевых слов тут не работают. Векторные базы ищут по смыслу. Они понимают, что стоит за формулировкой, и находят подходящие фрагменты. Настройка индекса и поиска — отдельная инженерная задача, но без этого вы получаете «галлюцинирующий» ИИ, который плохо понимает контекст.</p><h3>3. Интеграция языковой модели</h3><p>Далее подключаем языковую модель, которая формирует связный текст на основе данных. Важно, чтобы модель умела ссылаться на источники, иначе доверие к системе будет падать. Модель должна быть готова генерировать ответы в нужном формате: для внутренних сотрудников, клиентов или аналитиков. Продумайте стиль и тон, чтобы ИИ не разговаривал «как робот», а давал информацию по делу.</p><h3>4. Создание интерфейса</h3><p>Даже самая умная система бесполезна, если ею невозможно управлять. Создайте интерфейс, где сотрудники смогут задавать вопросы и получать ответы, с возможностью уточнений и обратной связи. Это может быть чат-бот, корпоративный портал или встроенный модуль в CRM.</p><h3>5. Безопасность и соответствие требованиям</h3><p>RAG часто работает с конфиденциальной информацией. Настройте права доступа, шифрование и аудит действий. Убедитесь, что система соответствует внутренним политикам безопасности и требованиям законодательства о персональных данных.</p><h3>6. Тестирование и оптимизация</h3><p>Запуск системы — это только начало. Наблюдайте за ее работой, собирайте обратную связь от сотрудников, фиксируйте ошибки и дорабатывайте базу знаний и поиск. RAG — это живой инструмент, который нужно постоянно поддерживать, иначе эффективность падает, а сотрудники начинают игнорировать систему.</p><h3>7. Экономика и ресурсы</h3><p>Хорошая новость: внедрение RAG позволяет экономить на дообучении моделей. Модель тянет актуальные данные напрямую из базы, что снижает расходы на переобучение и ускоряет работу команды. Но учтите, что настройка индекса, интеграция и поддержка требуют ресурсов: без инженеров и менеджеров проекта RAG превратится в дорогую игрушку.</p><h2>Как внедрять RAG без головной боли</h2><p>Согласны, внедрение RAG выглядит страшно: десятки документов, индексы, модели. Без должного опыта система быстро превращается в путаный инструмент. Чтобы этого не было, мы в CDI берем весь процесс на себя: собираем базу, настраиваем поиск, интегрируем модель и обучаем команду, чтобы в итоге вы получили надежного ИИ‑сотрудника.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/9/9.jpg",
        "animationDelay": "700ms"
    },
    {
        "id": 10,
        "date": "01 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Цифровая зрелость: что это такое и как ее измерить",
        "title2": "Цифровая зрелость",
        "text": "<p>Цифровая зрелость компании — это не модное словечко для презентаций, а реальный тест на выживание в цифровой экономике. Представьте: зрелая компания, как маркетплейс или банк, уже давно автоматизировала процессы, принимает решения на основе данных и запускает новые продукты за месяцы вместо нескольких лет. Стратегия, кадры, культура и технологии работают в унисон. А у нецифровой организации — как у небольшого локального магазина: Excel ведет учет продаж, отчеты собираются вручную, а каждая новая цифровая фишка — как пластыри на дырявом парашюте.</p><h2>Зачем измерять цифровую зрелость бизнеса</h2><img src=\"/assets/статьи/10/Зачем измерять цифровую зрелость бизнеса.jpg\" alt=\"Зачем измерять цифровую зрелость бизнеса\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Оценка цифровой зрелости нужна, чтобы понять, где настоящие проблемы и какой шаг в трансформации реально сработает. По данным Gartner, компании с высоким уровнем цифровизации на 26% прибыльнее конкурентов и имеют на 12% выше рыночную капитализацию. При этом исследования McKinsey показывают: 80% компаний увеличили инвестиции в цифровые технологии, но желаемого результата достигла лишь треть. В переводе на простой язык, без измерения зрелости деньги могут улететь в никуда — как вложения в модное ПО, которое никто не использует.</p><p><strong>Выгоды измерения цифровой зрелости:</strong></p><ul><li><strong>Выявление проблем и приоритетов.</strong> Аудит показывает, какие процессы требуют автоматизации и где стоит запускать новые сервисы. Без этого вы рискуете потратить деньги на софт, который никому не нужен.</li><li><strong>Повышение эффективности.</strong> Внедрение цифровой платформы сокращает время обработки процессов на 30–40%, а операционные и логистические затраты — на 20–25%.</li><li><strong>Рост прибыльности.</strong> Зрелые компании быстрее реагируют на спрос и запускают новые сервисы. Примеры есть на поверхности: банки «Тинькофф» и «Альфа» вложились в аналитику и цифровые каналы и уже обошли многих зарубежных конкурентов по качеству сервисов.</li></ul><h2>4 уровня цифровой зрелости компании</h2><img src=\"/assets/статьи/10/4 уровня цифровой зрелости компании.jpg\" alt=\"4 уровня цифровой зрелости компании\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Практика показывает, что цифровую зрелость можно разбить на четыре ступени: начальный, базовый, продвинутый и передовой.</p><h3>Нулевой (Initial)</h3><p>Процессы ручные. Данные разрозненные. Excel рулит, бумажки в ходу, CRM почти нет. Решения — на опыте руководителей. Типичный пример: локальные кафе или мастерские могут иметь сайт «для галочки», но фактически ведут продажи и общение с клиентами через телефон и мессенджеры.</p><h3>Базовый (Managed)</h3><p>Цифровые инструменты для отдельных процессов: продажи, бухгалтерия, склад. Появляется отчетность, базовая аналитика. Решения строятся частично на данных. Так работают, например, региональные сети аптек или застройщики: они объединяют склад, продажи и финансы в единую систему, что позволяет быстрее реагировать на изменения спроса и оптимизировать закупки.</p><h3>Продвинутый (Advanced)</h3><p>Почти все процессы цифровые. Данные объединены в единую платформу, BI-системы работают, автоматизация включена. Решения строятся на аналитике. Хороший пример — банки «Тинькофф» или «Альфа-Банк»: они строят сервисы на основе анализа клиентских данных, быстро выводят новые продукты и персонализируют предложения.</p><h3>Наивысший (Leading)</h3><p>Полная цифровизация. ИТ — стратегический актив. Процессы автоматизированы с ИИ, RPA, предиктивной аналитикой, большими данными. Решения мгновенно масштабируются. На таком уровне работают, например, «X5 Group» или «ВТБ»: они внедряют рекомендательные системы, цифровых двойников и аналитику, выстраивая экосистемы сервисов вокруг клиента.</p><h2>Как оценить и измерить цифровую зрелость</h2><img src=\"/assets/статьи/10/Как оценить и измерить цифровую зрелость.jpg\" alt=\"Как оценить и измерить цифровую зрелость\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Оценку цифровой зрелости проводят двумя способами: готовыми методиками или собственными аудитами. Международные модели — CDMM от Microsoft, SAP, MIT DMMM, Deloitte, KPMG, Forrester — смотрят на стратегию, технологии, процессы и организацию. Deloitte, к примеру, оценивает 5 направлений, 28 субизмерений и 179 показателей. Главное не таблицы, а понимание, где компания реально уязвима.</p><p>Есть и отраслевые подходы. Для девелоперов – Artsofte Consulting, он оценивает 9 блоков — от стратегии до компетенций команды. В маркетинге популярны Digital IQ (Gartner) и Digital Maturity Benchmark (BCG+Google), в банках — SDI-360, учитывающий соцсети, маркетинг и продажи. Смысл один: понять, где компания готова к цифровому будущему, а где нужна прокачка.</p><p>Когда бюджета мало, компании делают самооценку:</p><ul><li>Составляют чек-листы по ИТ, процессам, культуре и кадрам.</li><li>Проверяют: данные в облаке или на локальных серверах, есть ли CRM и BI, автоматизирована ли отчетность, есть ли нужные навыки у команды.</li><li>Оценка по шкале формирует «цифровой паспорт» компании.</li></ul><p>Часто подключают внешних экспертов: совместно ставят цели, проводят опросы и интервью, а потом получают отчет с рекомендациями и дорожной картой развития.</p><h2>6 шагов до цифровой зрелости компании</h2><h3>1. Соберите команду и зафиксируйте цели</h3><p>Назначьте ответственного. Сведите IT, бизнес и HR. Решите, чего хотите: ускорить процессы, внедрить технологии, увеличить прибыль. Без команды и целей оценка превратится в формальность.</p><h3>2. Выберите блоки для оценки</h3><p>Технологии, процессы, кадры, культура, данные и аналитика. Для каждого блока составьте конкретные вопросы: есть ли CRM, BI, автоматизация, навыки у сотрудников. Структура экономит время и снижает субъективность.</p><h3>3. Соберите факты</h3><p>Поговорите с руководителями и ключевыми сотрудниками, анализируйте процессы, заполните чек-листы, используйте опросы и наблюдения. Факты выявляют реальные проблемы, а не предполагаемые.</p><h3>4. Проанализируйте результаты</h3><p>Сложите баллы, постройте визуальную карту сильных и слабых сторон. Сразу видно, где компания готова к следующему шагу, а где нужна прокачка.</p><h3>5. Определите приоритеты и составьте план действий</h3><p>Выберите самые «болючие» блоки. Разработайте проекты, назначьте ответственных и сроки. Без плана найденные проблемы останутся на бумаге.</p><h3>6. Внедряйте и контролируйте</h3><p>Запускайте проекты, отслеживайте результаты, собирайте обратную связь. Повторяйте оценку каждые 6–12 месяцев. Цифровая зрелость — это марафон, а не спринт.</p><h2>Выводы</h2><p>Измерение цифровой зрелости — это не формальность. Оно показывает, что реально работает, а что надо менять. Определив свой уровень, компания получает опору для роста. Появляются понятные метрики, обоснованные приоритеты и план действий. Цифровая зрелость не разовый проект, это непрерывный цикл улучшений, который помогает бизнесу действовать быстрее, точнее и увереннее в современном мире.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/10/10.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": 11,
        "date": "05 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Топ-10 AI-помощников и сервисов 2025 года",
        "title2": "AI-помощники 2025",
        "text": "<p>В 2025 году ИИ-ассистенты стали обязательной частью работы. Без них рутинные задачи пожирают время, почта и таблицы превращаются в хаос, а вы все еще перелистываете вкладки в поисках нужной информации. Они пишут письма, собирают аналитику, переводят документы, создают презентации, видео и даже сценарии для корпоративных стендапов.</p><p>Команда CDI протестировала и собрала 10 лучших AI-сервисов. Они ведут проекты, собирают аналитику, готовят отчёты, пишут код и делают презентации, пока вы решаете стратегические вопросы. Неправильный выбор — и вы снова в офисе 2020-го: куча вкладок, бессонные ночи и вечный крик «где мой отчёт?!».</p><h2>GigaChat (Сбер)</h2><img src=\"/assets/статьи/11/GigaChat (Сбер).png\" alt=\"GigaChat (Сбер)\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Российский аналог «западным моделям». В 2025-м это уже не лабораторный эксперимент, а полноценный инструмент для бизнеса: пишет тексты, анализирует данные и интегрируется с сервисами. Max-версия держит в памяти до 262 тысяч токенов — хватит, чтобы «проглотить» целую «Войну и мир» и не потерять нить сюжета. Полностью доступен в России без VPN.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Обработка больших данных.</strong> Анализирует базы и длинные документы без потери контекста — пригодится аналитикам и исследовательским командам, которые тонут в таблицах.</li><li><strong>Создание текстов на русском.</strong> Генерирует отчеты, письма и презентации — удобно маркетологам, менеджерам и преподавателям, которым не хватает времени.</li><li><strong>Автоматизация процессов.</strong> Агенты формируют цепочки задач и отчеты без участия человека — для команд, усталых от ручного копирования и вставки.</li><li><strong>Интеграция с сервисами Сбера.</strong> Подключается к корпоративным базам — помогает крупным компаниям не тратить время на перенос данных.</li><li><strong>Поддержка исследовательских проектов.</strong> Анализирует большие данные и готовит материалы — полезно лабораториям, университетам и R&D-отделам.</li></ul><h2>DeepSeek</h2><img src=\"/assets/статьи/11/DeepSeek.png\" alt=\"DeepSeek\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Инструмент, который берет всю рутину, с которой вы обычно сражаетесь по пять вкладок сразу, и превращает её в порядок. Он обрабатывает данные, планирует задачи и ускоряет рабочие процессы так, что вы наконец занимаетесь стратегией, а не копаетесь в таблицах и письмах. Полностью доступен в России без VPN.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Автоматизация офисных задач.</strong> DeepSeek составляет письма, отчёты, напоминания и резюме документов, беря на себя рутину, чтобы вы не теряли голову и время.</li><li><strong>Умная работа с данными.</strong> Анализирует таблицы, документы и базы данных, подставляет нужные значения, ищет закономерности и готовит сводки — без ручного копирования и проверки формул.</li><li><strong>Поиск и обработка информации.</strong> Находит данные в интернете, корпоративных документах и локальных файлах, превращая хаос ссылок в аккуратные отчеты и ответы.</li><li><strong>Планирование и организация работы.</strong> Расставляет приоритеты, строит планы и отслеживает выполнение задач, освобождая менеджеров и команды от бесконечных напоминаний.</li><li><strong>Креативная поддержка.</strong> Генерирует идеи для презентаций, коммуникаций и маркетинговых материалов, создавая отправную точку для мозгового штурма и ускоряя процесс креатива.</li></ul><h2>GitHub Copilot</h2><img src=\"/assets/статьи/11/GitHub Copilot.png\" alt=\"GitHub Copilot\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Швейцарский нож для разработчика: все под рукой и работает точно. Он не просто подсказывает строки кода, а разбирается в проектах, пишет тесты и экономит часы, которые обычно уходят на бесконечный поиск. В России доступен в популярных IDE, так что даже джуны выглядят чуть умнее, а тимлиды успевают выпить кофе.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Генерация кода.</strong> Подсказывает строки, шаблоны и структуры для разных языков — пригодится джунам и разработчикам, которым лень писать рутину вручную.</li><li><strong>Автодополнение и отладка.</strong> Исправляет ошибки и ускоряет разработку — для тимлидов и разработчиков среднего уровня, чтобы не тратить часы на мелочи.</li><li><strong>Создание тестов.</strong> Генерирует юнит-тесты и сценарии QA — для QA-инженеров и команд, которым надо проверять код без вечного переписывания.</li><li><strong>Разбор чужих проектов.</strong> Облегчает понимание архитектуры — для разработчиков, которые наследуют чужие репозитории и хотят не сойти с ума.</li><li><strong>Ускорение командной работы.</strong> Поддержка джунов и тимлидов в совместной разработке — для команд, где без автоматизации каждый день превращается в хаос.</li></ul><h2>Buildin.ai</h2><img src=\"/assets/статьи/11/Buildin.ai.png\" alt=\"Buildin.ai\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Умный органайзер, который никогда не теряет данные и всегда под рукой. Он фиксирует заметки, структурирует задачи, создает черновики и работает с таблицами без постоянных переключений между вкладками. В России полностью доступен и идеально подходит для команд и фрилансеров, которым нужен порядок без лишней суеты.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Создание и организация контента.</strong> Buildin.AI умеет работать с Markdown, двусторонними ссылками, drag-and-drop блоками, настраиваемыми шрифтами и цветами — всё, чтобы ваши заметки и документы не превращались в хаос.</li><li><strong>Интеграция с внешними сервисами.</strong> Подключайте изображения, видео, таблицы, код, формулы, задачи и аудио — Buildin.AI умеет подхватывать данные из любого источника и держать их под рукой.</li><li><strong>Управление проектами.</strong> Таблицы, списки, доски, таймлайны и календари — всё в одном интерфейсе, чтобы ваша команда не терялась в бесконечных вкладках и могла работать слаженно.</li><li><strong>Поиск и анализ информации.</strong> Платформа быстро ищет данные в интернете, корпоративных документах и локальных файлах, превращая горы информации в понятные отчёты.</li><li><strong>Планирование и организация работы.</strong> Buildin.AI помогает расставлять приоритеты, строить планы и отслеживать выполнение задач, избавляя менеджеров от постоянных напоминаний.</li><li><strong>Креативная поддержка.</strong> Генерация идей для презентаций, маркетинга и коммуникаций — всё для того, чтобы мозговой штурм не превращался в мучение.</li></ul><h2>Jasper</h2><img src=\"/assets/статьи/11/Jasper.png\" alt=\"Jasper\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Jasper — как маркетолог на стероидах: генерирует посты, рассылки и статьи быстрее, чем вы успеете открыть Google Docs, и при этом не теряет ни тон, ни структуру. В России доступ через VPN, но для тех, кто работает с контентом, это мелочь по сравнению с тем, сколько часов вы экономите.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Генерация короткого контента.</strong> Создает посты, CTA и описания для соцсетей — для маркетологов и SMM‑щиков, которым нужны идеи быстрее, чем кофе успеет остыть.</li><li><strong>Создание длинных статей и блогов.</strong> Формирует структуру и текст, оптимизированный для SEO — полезно копирайтерам и контент‑менеджерам, которые хотят писать быстрее и без мучительного поиска структуры.</li><li><strong>Поддержка SEO-продвижения.</strong> Анализирует ключевые слова и проверяет выдачу — для специалистов по SEO, которым важно не просто написать текст, а чтобы его еще и нашли.</li><li><strong>Интеграция с CMS.</strong> Публикует материалы без ручного копирования — для команд, которые устали держать десятки вкладок открытыми.</li><li><strong>Автоматизация цепочек задач.</strong> Генерация, SEO, публикация и отчет — для агентств и контент‑отделов, которые устали от бесконечного «копировать‑вставить» и хотят, чтобы работа реально двигалась.</li></ul><h2>ChatGPT (OpenAI)</h2><img src=\"/assets/статьи/11/ChatGPT (OpenAI).png\" alt=\"ChatGPT (OpenAI)\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Ваш виртуальный многостаночник: пишет код, придумывает дизайн, строит стратегии и автоматизирует рутину, на которую раньше уходили целые отделы. В России доступ ограничен, но корпоративные версии и VPN позволяют использовать его почти без заминок.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Генерация текстов и сценариев.</strong> Пишет статьи, письма, презентации, маркетинговые тексты и диалоги — для тех, кто устал мучиться с пустым листом и хочет результат сразу.</li><li><strong>Код и автоматизация.</strong> Создает скрипты, проверяет код и ускоряет разработку — полезно разработчикам и тимлидам, которым нужны часы, а не дни на рутину.</li><li><strong>Анализ данных.</strong> Обрабатывает таблицы, отчеты и сводки — для аналитиков и команд, которые иначе тонут в цифрах и формулировках.</li><li><strong>Идеи для креатива.</strong> Генерирует концепции интерфейсов, визуализаций и презентаций — для дизайнеров и продакт-менеджеров, которым нужен толчок для мозгового штурма.</li><li><strong>Интеграция с системами.</strong> Подключается через плагины и API к CRM, календарям и другим сервисам — для команд, которым надо, чтобы инструменты работали вместе, а не друг против друга.</li></ul><h2>Claude 3 (Anthropic)</h2><img src=\"/assets/статьи/11/Claude 3 (Anthropic).png\" alt=\"Claude 3 (Anthropic)\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Это тихий трудяга. Не галдит в медиа, но умеет работать с миллионом токенов текста и минимизировать галлюцинации. В России доступ ограничен, требуется корпоративная лицензия, зато качество аналитики компенсирует любые неудобства.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Структурный анализ документов.</strong> Разбирает длинные тексты и готовит отчеты — для аналитиков и исследователей, которым важно видеть суть без лишнего шума.</li><li><strong>Фактчекинг.</strong> Проверяет данные и ссылки — для журналистов и команд, которые устали от галлюцинаций в отчетах и презентациях.</li><li><strong>Подготовка аналитики.</strong> Сводки, графики и рекомендации — для менеджеров и исследовательских групп, которым нужно быстро принимать решения.</li><li><strong>Юридическая поддержка.</strong> Работа с договорами и стандартами — для юристов и корпоративных команд, которым критически важна точность и безопасность.</li><li><strong>Обработка больших текстов.</strong> Для исследовательских и корпоративных задач — когда обычные инструменты просто ломаются под объемом информации.</li></ul><h2>DeepL Translator</h2><img src=\"/assets/статьи/11/DeepL Translator.png\" alt=\"DeepL Translator\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Переводит тексты так, что они остаются человеческими, сохраняет контекст, стиль и тон документа, а ошибок почти нет. В России доступ через VPN.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Перевод больших текстов.</strong> Сохраняет смысл и стиль — для компаний и специалистов, которым важен аккуратный и понятный перевод без потери нюансов.</li><li><strong>Глоссарии.</strong> Создает корпоративные словари — чтобы команды не спорили о терминах и перевод всегда был единым.</li><li><strong>Документы и презентации.</strong> Минимизирует ручное исправление — полезно для менеджеров и PR‑специалистов, которым нужно быстро подготовить материалы.</li><li><strong>Контекстная адаптация.</strong> Подбирает правильные формулировки — для профессионалов, которым важна точность и естественность текста.</li><li><strong>Ускорение работы с международными проектами.</strong> Подходит для отчетов, договоров и PR‑материалов — чтобы работа шла быстрее, а коммуникация с партнерами не тормозила.</li></ul><h2>Perplexity AI</h2><img src=\"/assets/статьи/11/Perplexity AI.png\" alt=\"Perplexity AI\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Спасение для тех, кто тонет в море ссылок и не знает, с чего начать поиск. Вместо сухих URL он выдает аккуратный, проверенный фактами ответ, собирая информацию из интернета и локальных источников. Отлично подходит аналитикам, журналистам и студентам, которым важна скорость и надежность данных.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Поиск и анализ информации.</strong> Вместо сухих ссылок выдает связанный и структурированный ответ — для аналитиков и студентов, которым не хочется рыться в десятках вкладок.</li><li><strong>Фактчекинг.</strong> Проверяет данные и источники — чтобы отчеты и материалы не превращались в набор домыслов.</li><li><strong>Подготовка исследований.</strong> Создает краткие и понятные сводки — для команд, которым важна суть без лишнего шума.</li><li><strong>Диалог с источниками.</strong> Позволяет уточнять детали без повторного поиска — экономит время исследователей и журналистов.</li><li><strong>Экономия времени.</strong> Быстро отделяет зерна от информационного мусора — для всех, кто устал тонуть в потоке данных.</li></ul><h2>Runway Gen-2</h2><img src=\"/assets/статьи/11/Runway Gen-2.png\" alt=\"Runway Gen-2\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Runway превращает текст в видео и превращает скучные идеи в визуальные прототипы за считанные минуты. Это скорее «Photoshop для видео», чем простой генератор роликов — контроль над сценой, композицией и эффектами на уровне профессионала. Идеально для видеомейкеров, агентств и контент‑криэйторов, которым нужно быстро создавать прототипы без долгих монтажей.</p><p><strong>Что умеет:</strong></p><ul><li><strong>Создание видео из текста.</strong> Превращает текстовые подсказки в клипы — для видеомейкеров и команд, которым важно быстро визуализировать идеи.</li><li><strong>Редактирование и эффекты.</strong> Добавляет музыку, переходы и фильтры — чтобы ролики выглядели профессионально без долгого монтажа.</li><li><strong>Прототипирование роликов.</strong> Быстро проверяет визуальные идеи — полезно для агентств и креативных команд на этапе концепта.</li><li><strong>Интеграция с графикой.</strong> Подключает изображения и анимации — для тех, кто хочет собрать видео из разных источников без лишней работы.</li><li><strong>Поддержка контент‑криэйторов.</strong> Подходит для маркетинга и соцсетей — ускоряет создание материалов для публикаций и кампаний.</li></ul><h2>Вместо вывода</h2><p>AI‑помощники пишут тексты, кодят, анализируют данные, делают видео и управляют задачами, пока вы решаете, чем заняться по-настоящему. Универсального решения нет — побеждают связки: маркетолог таскает GigaChat, Jasper и Kling, разработчик живёт с Copilot и Claude, дизайнер скачет между MidJourney и Photoshop. По тестам один кажется круче, но ваши задачи он заваливает. Если не хотите терять месяцы на эксперименты и нервы, CDI внедрит AI-инструменты, обучит команду и настроит процессы так, чтобы технологии наконец начали работать на вас.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/11/11.png",
        "animationDelay": "500ms"
    },
    {
        "id": 12,
        "date": "10 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "Зачем бизнесу нужны чат-боты и главные ошибки при их внедрении",
        "title2": "Чат-боты для бизнеса",
        "text": "<p>Чат-боты стали неотъемлемой частью практически любого сервиса или онлайн-магазина: почти три четверти россиян являются их активными пользователями. Кому действительно стоит внедрять такие решения, и с какими ошибками сталкивается бизнес, который хочет «подружить» свои процессы с виртуальным ассистентом — рассказывает Максим Малышев, генеральный директор digital-агентства CDI.</p><h2>Зачем бизнесу нужны чат-боты</h2><p>Чат-боты — это виртуальные помощники, использующие искусственный интеллект и обработку естественного языка для имитации взаимодействия с пользователями. Они обеспечивают непрерывное взаимодействие с клиентами, оперативно отвечают на их запросы и предоставляют необходимую информацию в любое время суток.</p><p>Первым прообразом современных чат-ботов стала программа «Элиза», созданная профессором Джозефом Вейценбаумом в середине 1960-х годов. Она использовала текстовые шаблоны для симуляции диалога между пациентом и психотерапевтом. И хотя «Элиза» была примитивной по современным стандартам, она заложила основу для систем, способных обрабатывать естественный язык.</p><p>Запуск ChatGPT, созданного компанией OpenAI в 2022 году, ознаменовал начало эпохи современных чат-ботов, активно использующих генеративный искусственный интеллект. По словам Малышева, это вдохновило множество компаний на разработку собственных решений, и рынок ИИ начал стремительно развиваться, в том числе, и в России. Так, по данным Национального центра развития искусственного интеллекта при Правительстве РФ, в 2024 году в стране зафиксировано почти 300 кейсов внедрения ИИ-решений в самых различных отраслях.</p><p>Малышев отмечает, что для бизнеса использование чат-ботов обеспечивает целый ряд преимуществ:</p><h3>Повышение эффективности</h3><p>Он предлагает представить работника, который никогда не уходит в отпуск, не делает перерывов на обед и готов ответить на любой вопрос клиента в любое время дня и ночи. Чат-бот значительно сокращает время ожидания для клиентов и минимизируют риск ошибок, которые могут возникнуть из-за усталости или невнимательности у тех, кто подвержен «человеческому фактору». Все это значительно повышает качество обслуживания для решения стандартных запросов, отмечает он.</p><h3>Экономия ресурсов</h3><p>Чат-боты берут на себя рутинные процессы, освобождая команду для более важных задач. Они могут одновременно обрабатывать сотни запросов, что значительно повышает производительность. А это не только сокращает затраты на персонал, но и позволяет бизнесу расти без необходимости постоянно расширять штат, поясняет Малышев.</p><h3>Маркетинговые возможности</h3><p>Он также отмечает, что в чат-бот можно «вместить» полноценную воронку продаж прямо в мессенджере. Они позволяют клиентам совершать покупки и оплачивать заказы, не покидая чата, с их помощью можно выстраивать персонализированные сценарии: от приветственных сообщений с промокодами и скидками, которые будут стимулировать повторные покупки, до полезного контента, который решает «боли» клиентов и ненавязчиво рассказывает о продуктах. В бот можно интегрировать игровые механики, викторины или конкурсы, которые превратят общение с брендом в увлекательное приключение. А еще они собирают ценные данные о клиентах, помогая бизнесу лучше понимать их потребности.</p><h2>Ошибки, которые чаще всего совершают компании при внедрении чат-ботов</h2><p>По словам Малышева, внедрение чат-ботов — это не просто тренд, а инструмент, который требует осмысленного подхода. Избегая этих ошибок, компании могут использовать технологии с максимальной пользой.</p><h3>Ошибка 1. Полностью полагаться на автоматизированные решения</h3><p>Современные чат-боты, как правило, интегрированы с нейросетями. Но даже в такой усовершенствованной форме они не должны быть единственным источником информации для принятия решений, утверждает эксперт.</p><p>Он приводит в пример чат-бот на основе ИИ, который способен быстро предложить альтернативные варианты решения, однако окончательный выбор всегда должен оставаться за человеком. «Золотое правило делегирования здесь работает как никогда: важно сохранять контроль над ключевыми операциями», — говорит он.</p><h3>Ошибка 2. Гнаться за технологией ради хайпа</h3><p>Еще одна частая ошибка, по мнению Малышева, заключается в внедрении чат-бота без четкого понимания, зачем он нужен. Не всегда использование технологии оправдано, особенно если в бизнесе царит хаос. Когда цель не ясна, бот не только не поможет, но и усугубит ситуацию. «Как говорит мой коллега: \"Автоматизировать хаос — это последнее дело\"», — рассказывает эксперт.</p><h3>Ошибка 3. Не прогнозировать стоимость решения</h3><p>По слова Малышева, эта ошибка обусловлена ростом стоимости использования чат-ботов на базе платных ИИ-сервисов. Например, если бизнес завязан для чатах с клиентами, увеличение числа пользователей может привести к резкому росту расходов. То, что на малых объемах оценивалось в копейки, на больших масштабах может стать значительной статьей затрат, утверждает эксперт. Поэтому, по его словам, необходимо заранее продумать возможность замены платного чат-бота на более дешевый аналог, чтобы избежать финансовых потерь при неожиданном масштабировании задач. Следует изучить возможные альтернативы еще на этапе начала работы над проектом.</p><h3>Ошибка 4. Не озаботиться интеграцией с существующими IT-системами</h3><p>Малышев отмечает, что компании, особенно если она обладает развитой IT-структурой, нужно заранее продумать, как чат-бот будет взаимодействовать с CRM и ERP системами, и к каким внутренним данным он будет иметь доступ. Особые проблемы, по словам эксперта, могут возникнуть, если предприятие использует устаревшие программы, которые несовместимы с современными IT-решениями. Игнорирование подобных рисков может привести к целому спектру проблем: от утери данных до сбоев при функционировании чат-ботов.</p><h3>Ошибка 5. Игнорировать риски в сфере кибербезопасности</h3><p>Чат-бот в бизнесе функционирует на основе предоставленных данных. Например, как отмечает эксперт, при выработке рекомендаций он может опираться на конфиденциальные данные о клиенте (история покупок, финансовое положение, геолокация и т.д.). Теоретически эти данные надежно защищены. Но, как показывает статистика, только в 2024 году в сеть утекло 1,5 миллиарда личных записей россиян (+30% г/г). Утечка конфиденциальной информации не только влечет юридические и административные разбирательства, но и наносит ущерб репутации компании. Именно поэтому, по словам Малышева, разработчики чат-ботов, такие как CDI, сейчас уделяют особое внимание вопросам кибербезопасности.</p><p>Какие можно сделать выводы из приведенного списка? При внедрении чат-ботов нужно заранее: определить его место в компании и системе управления; просчитать финансовую составляющую и озаботиться интеграцией с существующими IT-системами. И не экономить на кибербезопасности, заключает Малышев.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/12/12.png",
        "animationDelay": "700ms"
    },
    {
        "id": 13,
        "date": "15 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Разработка",
        "title": "Тонкие грани High Load: как понять, что ваша система действительно высоконагруженная",
        "title2": "High Load системы",
        "text": "<p>Как понять, что ваша система действительно «высоконагруженная», а не просто плохо спроектированная?</p><p>High Load (хайлоад, hiload, highload) - очень популярный термин в кругах IT. Но так сложилось, что у него нет четкого определения. Все понимают, что это связано с высокими нагрузками, но метрики для определения этих нагрузок у каждого свои.</p><h2>Показатели и порог наступления High Load</h2><p>Мне очень нравится определение с сайта компании \"Жить в небе\": Высоконагруженными (highload) интернет-проектами считаются сайты, приложения и системы, способные обслужить на порядок больше пользовательских запросов, чем обслужили бы аналогичные проекты с точно такими же ресурсными конфигурациями серверов и стандартными (дефолтными) настройками. Иными словами, высокие нагрузки для любой системы начинаются там, где серверы начинают работать медленно, страницы перестают загружаться, соединения обрываются, а приложения начинают тормозить или утилизируют 100% серверных ресурсов.</p><p>Соответственно, High Load для проекта начинается тогда, когда начинаются проблемы с производительностью.</p><p>Пример - сайт интернет-магазина на Битрикс. В стандартной конфигурации без оптимизаций на виртуальном сервере 4CPU 8GB RAM он может обслужить сотни пользователей в минуту. Но только стоит увеличить число пользователей (например, объявить скидки), сайт начнет испытывать проблемы - страницы начнут медленно отдаваться, могут появиться различные ошибки, могут быть проблемы с работой админпанели.</p><p>Здесь для этого проекта уже начался High Load.</p><img src=\"/assets/статьи/13/почти 300 кейсов внедрения ИИ-решений в самых различных отраслях..png\" alt=\"Показатели и порог наступления High Load\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h2>Метрики для диагностики настоящей высокой нагрузки</h2><p>Но можно же оптимизировать проект, применить кэширование, увеличить мощности сервера, улучшить код? - спросите вы. Да, конечно, можно. И нужно, если вы уже сталкиваетесь с артефактами, описанными выше. Тогда система станет оптимизирована для бОльших нагрузок. И текущая планируемая нагрузка уже не станет для нее High Load. Но это не убережет от возможных проблем с замедлениями при еще большем числе посетителей.</p><p>И тут уже другие методы борьбы с высокими нагрузками вступают в бой - разделение проекта на микросервисы, внедрение очередей, горизонтальное масштабирование ресурсов.</p><p>Однако и это при каких-то высоких для данного проекта нагрузках может не уберечь от проблем с производительностью. Такую борьбу можно продолжать очень долго. Все зависит от бизнес-задач, возможностей проекта и выделяемого бюджета. А бюджет на некоторых проектах только на сервера может уходить за сотни тысяч рублей в месяц. И не каждый бизнес готов такие суммы выделять на оптимизацию проектов для растущих нагрузок.</p><p>Таким образом, High Load для проектов с разной архитектурой наступает по-разному. И количественные показатели наступления High Load тоже разные.</p><p>Пример из жизни: работаем над интернет-магазином, все устойчиво, по всем параметрам системы хороший запас. И тут отдел маркетинга решил объявить невиданные скидки, разослали клиентам пуши в мобильном приложении - и наша система упала от неожиданного наплыва людей. High Load случился там, где не ждали. И здесь очень важно, чтобы бизнес свои желания согласовывал с техническими возможностями. Ведь в данном случае подготовиться можно было вполне к пиковой нагрузке, если знать о ней заранее.</p><h2>Разница между High Load и интенсивной нагрузкой</h2><p>Следует разделять понятия \"High Load\" и \"интенсивная нагрузка\". Например, мы проектируем сервис хранения файлов на базе облачного S3-хранилища. Заведомо известно, что S3-хранилище будет очень широко и интенсивно использоваться в системе по сравнению с остальными ее узлами. Но эта нагрузка будет заранее известна, учтена при проектировании системы, и не должна оказывать негативного влияния на работу всей системы в целом. Таким образом интенсивная нагрузка - это не показатель High Load. Она должна быть учтена при разработке системы.</p><h2>High Load или ошибки разработки</h2><p>Разберем отношение плохо спроектированных систем и High Load. Я считаю, если система выполняет заявленные на момент ее разработки параметры по нагрузке, она хорошо и на достаточном уровне спроектирована. При превышении допустимой нагрузки и появляющихся при этом проблемах уже стартует High Load. И систему нужно дорабатывать.</p><p>Случай из жизни. Заказчик обращается с просьбой о помощи - некоторые страницы сайта очень долго открываются, притом по Яндекс метрике он не видит каких-то неожиданных всплесков посещений. Начали разбираться - нашли на этих страницах множественные запросы в цикле. Налицо ошибка разработки. Поправив запросы, все стало работать вполне быстро. Такое поведение системы не стоит называть High Load. В данном случае система не выполняла заданные для нее параметры из-за некорректно написанного кода.</p><h2>Количественные показатели High Load</h2><p>По количественным показателям High Load все довольно просто. Смотрим на метрики сервера, и, если процессор и оперативная память загружены более чем на 80 процентов, то это можно считать High Load для данной системы. И нужно начинать предпринимать какие-то действия по оптимизации системы.</p><p>Например, High Load может наступить для блога на виртуальном хостинге при 50 запросах в минуту, для интернет-магазина на облачном сервисе - при 500 запросах в минуту, для государственного сервиса на выделенных серверах - при нескольких десятках тысяч запросов в минуту. Для каждого проекта свои показатели.</p><p>Бывают более тривиальные случаи, когда и все параметры системы \"по железу\" в норме, но все работает медленно. Это может быть связан с ограничениями ПО. Например, установлено слишком низкое число воркеров nginx или малое число коннектов в базе данных.</p><p>Конечно, и ошибки разработки никуда не уходят. Те же неоптимальные запросы к базе данных могут давать большие последствия. И устранение программных просчетов может занять много времени и средств. Но, снова повторюсь, если система соответствует всем нормам, указанным в техническом задании, то даже с неоптимальными запросами она может считаться вполне нормальной.</p><p>Можно сделать вывод что High Load - это ненормальное состояние системы. Если нам нужно большое количество пользователей, если предполагаются изначально высокие нагрузки по каким-либо показателям, при этом система спроектирована с учетом заданных показателей и реализована по ТЗ, в этой системе нет High Load, насколько бы сложной эта система не была и какие бы мощные нагрузки она не держала.</p><p>В пример можно привести всеми любимые и знакомые соцсети. Для них большое число посетителей, запросов к базам данных, к хранилищам файлов, к каким-то смежным системам - это нормальное состояние. Да, можно сказать, что соцсети работают в условиях High Load - все это поймут, там действительно такие метрики, до которых далеко обычным проектам. Но эти системы на такие нагрузки рассчитаны и для них состояние High Load наступает при выходе за расчетные параметры и следующих из-за этого проблемах.</p><h2>В какой момент компании переходить к архитектуре High Load</h2><p>Как определить, работает-ли ваша система в режиме High Load? Снова возвратимся к \"железным\" метрикам по использованию процессоров и оперативной памяти. Если один из этих параметров используется больше, чем на 80% - вы уже в режиме High Load.</p><p>На практике можно определить, когда ваша система придет в режим High Load. Достаточно для нее провести нагрузочное тестирование. Для обычных веб-ресурсов нагрузочное тестирование делается такими утилитами, как Yandex Tank, Apache AB или другие. Эти сервисы генерируют разную нагрузку и смотрят на реакцию системы. Если система стала выдавать ошибки, увеличилось время ответа или возросли до критичных параметры загрузки сервера - мы попали в зону High Load. И эта нагрузка становится нашей критической нагрузкой.</p><p>Подытожим сказанное. High Load - это критическое состояние системы, связанное с ее некорректной работой вследствие нагрузки, превышающей заданные при проектировании параметры.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/13/13.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": 14,
        "date": "20 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Разработка",
        "title": "High Load: как понять, что ваша система действительно высоконагруженная",
        "title2": "High Load системы",
        "text": "<p>Как понять, что ваша система действительно «высоконагруженная», а не просто плохо спроектированная?</p><p>High Load (хайлоад, hiload, highload) - очень популярный термин в кругах IT. Но так сложилось, что у него нет четкого определения. Все понимают, что это связано с высокими нагрузками, но метрики для определения этих нагрузок у каждого свои.</p><h2>Показатели и порог наступления High Load</h2><p>Мне очень нравится определение с сайта компании \"Жить в небе\": Высоконагруженными (highload) интернет-проектами считаются сайты, приложения и системы, способные обслужить на порядок больше пользовательских запросов, чем обслужили бы аналогичные проекты с точно такими же ресурсными конфигурациями серверов и стандартными (дефолтными) настройками. Иными словами, высокие нагрузки для любой системы начинаются там, где серверы начинают работать медленно, страницы перестают загружаться, соединения обрываются, а приложения начинают тормозить или утилизируют 100% серверных ресурсов.</p><p>Соответственно, High Load для проекта начинается тогда, когда начинаются проблемы с производительностью.</p><p>Пример - сайт интернет-магазина на Битрикс. В стандартной конфигурации без оптимизаций на виртуальном сервере 4CPU 8GB RAM он может обслужить сотни пользователей в минуту. Но только стоит увеличить число пользователей (например, объявить скидки), сайт начнет испытывать проблемы - страницы начнут медленно отдаваться, могут появиться различные ошибки, могут быть проблемы с работой админпанели.</p><p>Здесь для этого проекта уже начался High Load.</p><h2>Метрики для диагностики настоящей высокой нагрузки</h2><p>Но можно же оптимизировать проект, применить кэширование, увеличить мощности сервера, улучшить код? - спросите вы. Да, конечно, можно. И нужно, если вы уже сталкиваетесь с артефактами, описанными выше. Тогда система станет оптимизирована для бОльших нагрузок. И текущая планируемая нагрузка уже не станет для нее High Load. Но это не убережет от возможных проблем с замедлениями при еще большем числе посетителей.</p><p>И тут уже другие методы борьбы с высокими нагрузками вступают в бой - разделение проекта на микросервисы, внедрение очередей, горизонтальное масштабирование ресурсов.</p><p>Однако и это при каких-то высоких для данного проекта нагрузках может не уберечь от проблем с производительностью. Такую борьбу можно продолжать очень долго. Все зависит от бизнес-задач, возможностей проекта и выделяемого бюджета. А бюджет на некоторых проектах только на сервера может уходить за сотни тысяч рублей в месяц. И не каждый бизнес готов такие суммы выделять на оптимизацию проектов для растущих нагрузок.</p><p>Таким образом, High Load для проектов с разной архитектурой наступает по-разному. И количественные показатели наступления High Load тоже разные.</p><p>Пример из жизни: работаем над интернет-магазином, все устойчиво, по всем параметрам системы хороший запас. И тут отдел маркетинга решил объявить невиданные скидки, разослали клиентам пуши в мобильном приложении - и наша система упала от неожиданного наплыва людей. High Load случился там, где не ждали. И здесь очень важно, чтобы бизнес свои желания согласовывал с техническими возможностями. Ведь в данном случае подготовиться можно было вполне к пиковой нагрузке, если знать о ней заранее.</p><h2>Разница между High Load и интенсивной нагрузкой</h2><p>Следует разделять понятия \"High Load\" и \"интенсивная нагрузка\". Например, мы проектируем сервис хранения файлов на базе облачного S3-хранилища. Заведомо известно, что S3-хранилище будет очень широко и интенсивно использоваться в системе по сравнению с остальными ее узлами. Но эта нагрузка будет заранее известна, учтена при проектировании системы, и не должна оказывать негативного влияния на работу всей системы в целом. Таким образом интенсивная нагрузка - это не показатель High Load. Она должна быть учтена при разработке системы.</p><h2>High Load или ошибки разработки</h2><p>Разберем отношение плохо спроектированных систем и High Load. Я считаю, если система выполняет заявленные на момент ее разработки параметры по нагрузке, она хорошо и на достаточном уровне спроектирована. При превышении допустимой нагрузки и появляющихся при этом проблемах уже стартует High Load. И систему нужно дорабатывать.</p><p>Случай из жизни. Заказчик обращается с просьбой о помощи - некоторые страницы сайта очень долго открываются, притом по Яндекс метрике он не видит каких-то неожиданных всплесков посещений. Начали разбираться - нашли на этих страницах множественные запросы в цикле. Налицо ошибка разработки. Поправив запросы, все стало работать вполне быстро. Такое поведение системы не стоит называть High Load. В данном случае система не выполняла заданные для нее параметры из-за некорректно написанного кода.</p><h2>Количественные показатели High Load</h2><p>По количественным показателям High Load все довольно просто. Смотрим на метрики сервера, и, если процессор и оперативная память загружены более чем на 80 процентов, то это можно считать High Load для данной системы. И нужно начинать предпринимать какие-то действия по оптимизации системы.</p><p>Например, High Load может наступить для блога на виртуальном хостинге при 50 запросах в минуту, для интернет-магазина на облачном сервисе - при 500 запросах в минуту, для государственного сервиса на выделенных серверах - при нескольких десятках тысяч запросов в минуту. Для каждого проекта свои показатели.</p><p>Бывают более тривиальные случаи, когда и все параметры системы \"по железу\" в норме, но все работает медленно. Это может быть связан с ограничениями ПО. Например, установлено слишком низкое число воркеров nginx или малое число коннектов в базе данных.</p><p>Конечно, и ошибки разработки никуда не уходят. Те же неоптимальные запросы к базе данных могут давать большие последствия. И устранение программных просчетов может занять много времени и средств. Но, снова повторюсь, если система соответствует всем нормам, указанным в техническом задании, то даже с неоптимальными запросами она может считаться вполне нормальной.</p><p>Можно сделать вывод что High Load - это ненормальное состояние системы. Если нам нужно большое количество пользователей, если предполагаются изначально высокие нагрузки по каким-либо показателям, при этом система спроектирована с учетом заданных показателей и реализована по ТЗ, в этой системе нет High Load, насколько бы сложной эта система не была и какие бы мощные нагрузки она не держала.</p><p>В пример можно привести всеми любимые и знакомые соцсети. Для них большое число посетителей, запросов к базам данных, к хранилищам файлов, к каким-то смежным системам - это нормальное состояние. Да, можно сказать, что соцсети работают в условиях High Load - все это поймут, там действительно такие метрики, до которых далеко обычным проектам. Но эти системы на такие нагрузки рассчитаны и для них состояние High Load наступает при выходе за расчетные параметры и следующих из-за этого проблемах.</p><h2>В какой момент компании переходить к архитектуре High Load</h2><p>Как определить, работает-ли ваша система в режиме High Load? Снова возвратимся к \"железным\" метрикам по использованию процессоров и оперативной памяти. Если один из этих параметров используется больше, чем на 80% - вы уже в режиме High Load.</p><p>На практике можно определить, когда ваша система придет в режим High Load. Достаточно для нее провести нагрузочное тестирование. Для обычных веб-ресурсов нагрузочное тестирование делается такими утилитами, как Yandex Tank, Apache AB или другие. Эти сервисы генерируют разную нагрузку и смотрят на реакцию системы. Если система стала выдавать ошибки, увеличилось время ответа или возросли до критичных параметры загрузки сервера - мы попали в зону High Load. И эта нагрузка становится нашей критической нагрузкой.</p><p>Подытожим сказанное. High Load - это критическое состояние системы, связанное с ее некорректной работой вследствие нагрузки, превышающей заданные при проектировании параметры.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/14/14.png",
        "animationDelay": "500ms"
    },
    {
        "id": 15,
        "date": "25 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Что такое MVP и зачем он нужен",
        "title2": "MVP: минимально жизнеспособный продукт",
        "text": "<p>Создание нового продукта — это всегда риск. Но как проверить, будет ли ваша идея востребована, не потратив при этом все ресурсы? Ответ — MVP (Minimum Viable Product). Это минимально жизнеспособная версия продукта, которая позволяет протестировать ключевые гипотезы, собрать обратную связь и адаптировать продукт под реальные потребности пользователей.</p><p><strong>В материале вы узнаете, как создать и запустить MVP, чтобы обеспечить успех продукта на рынке.</strong></p><h2>Что такое MVP и зачем он нужен</h2><p>MVP или Minimum Viable Product — это минимально жизнеспособная версия продукта, обладающая базовым набором функций. Роль MVP в процессе разработки заключается в том, чтобы проверить гипотезы и минимизировать риски, связанные с запуском нового продукта.</p><p>Например, MVP для службы доставки еды может быть простым мобильным приложением, где пользователи заказывают еду из ограниченного меню нескольких ресторанов. А для платформы фрилансеров MVP может состоять из веб-сайта с профилями фрилансеров без дополнительных функций в виде чата и отзывов.</p><p>Роль MVP в процессе разработки заключается в том, чтобы проверить гипотезы и минимизировать риски, связанные с запуском нового продукта</p><p>Итак, MVP — это не «сырой» продукт, а стратегический инструмент. Преимущества использования MVP очевидны. Во-первых, он ускоряет процесс выхода на рынок, что позволяет компаниям получить конкурентное преимущество и быстро освоить нишу. Во-вторых, MVP снижает риски, позволяя оценить жизнеспособность идеи с минимальными затратами. И, наконец, он помогает сэкономить ресурсы, так как обратная связь от пользователей позволяет скорректировать направление развития и избежать ненужных затрат.</p><h2>Как подойти к запуску MVP</h2><p>Сфокусироваться на главном. Первый шаг к успешному MVP — определить основную функцию, которая будет решать ключевую потребность пользователей.</p><p>Например, мобильное приложение «Пушкинской карты» было запущено как MVP всего за 2,5 месяца. Оно содержало минимальный набор необходимых функций: регистрацию на Госуслугах, выпуск карты, начисление баланса и обзор событий. Запуск MVP позволил быстро оценить реакцию пользователей и определить направления для дальнейшего развития. На основе собранных данных мы постепенно добавили новые функции и улучшили старые.</p><p>Принять, что ошибки — это нормально. Ошибки на этапе MVP неизбежны, но их стоит воспринимать как возможность для улучшения. Каждый баг и негативный отзыв — это шанс оптимизировать продукт. Важно оперативно вносить изменения в продукт, улучшая его с учетом полученного опыта, чтобы повышать удовлетворенность пользователей уже на старте проекта.</p><p>Двигаться циклами проверки гипотез. Работа с MVP — это непрерывный процесс проверки гипотез. Продумайте гипотезы и критерии их проверки, проведите тестирование, изучите результаты, сделайте выводы, обновите MVP и начните с начала.</p><h2>Этапы запуска MVP</h2><p>Концепция создания продукта часто напоминает путешествие без обратного билета: есть только идея и горящее желание воплотить ее в жизнь. А MVP — это простой и эффективный навигатор на этом пути. Как правильно расставить приоритеты при запуске MVP, чтобы ваше детище выросло из концепта в востребованный продукт.</p><p>Определение целей. Четко сформулируйте, какие задачи должен решать ваш продукт. Например, «Пользователям необходимо решение, которое сократит время поиска информации на 20%» или «Функция X повысит скорость выполнения задачи Y на 50% благодаря оптимизации процесса».</p><p>Исследование аудитории. Собирайте информацию о существующих решениях, предлагаемых конкурентами. Что клиенты ценят в их продукции? Какие у них слабые стороны? Это поможет сформулировать убедительное УТП и, как следствие, получить конкурентное преимущество. Использование AI для исследования аудитории — экономически выгодное решение, которое позволит получить ценные инсайты о потенциальных клиентах, сэкономив время и ресурсы.</p><img src=\"/assets/статьи/15/Исследование аудитории..png\" alt=\"Исследование аудитории\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Исследование аудитории поможет сформулировать хорошее УТП и получить конкурентное преимущество</p><p>Выбор ключевых функций. Задача этого этапа — не только сократить список из возможных функций до наиболее важных, но и создать четкий план действий по их реализации.</p><p>Прототипирование и разработка. Визуализируйте ключевые функции, чтобы пользователи могли взаимодействовать с прототипом и давать обратную связь. Используйте доступные инструменты для прототипирования, например, Figma, чтобы создать интерактивные макеты. А затем соберите команду разработчиков и реализуйте ключевые функции, определенные на этапе прототипирования.</p><p>Тестирование. Теперь необходимо убедиться, что MVP выполняет заявленные функции и соответствует ожиданиям пользователей. Используйте разнообразные методы тестирования. Это могут быть интервью, наблюдения за тем, как пользователи взаимодействуют с продуктом, или онлайн-опросы. Задача — собрать максимальное количество информации о поведении пользователя и его восприятии продукта.</p><h2>Действия, определяющие развитие проекта</h2><img src=\"/assets/статьи/15/Действия, определяющие развитие проекта.png\" alt=\"Действия, определяющие развитие проекта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>После успешного запуска MVP перед командой встает ряд новых задач, которые определяют дальнейшие перспективы проекта. Необходимо понимать, какие метрики стоит отслеживать, как собирать и интерпретировать обратную связь и как оперативно вносить изменения для улучшения продукта.</p><p>Один из ключевых шагов — сбор обратной связи от первых пользователей. Для этого важно обеспечить пользователям простую и удобную возможность делиться своими впечатлениями, чтобы они чувствовали, что их мнение ценно.</p><p>Сегодня разнообразие инструментов позволяет собрать информацию максимально эффективно: сервисы для анкетирования Google Forms или Анкетолог, встроенные формы и всплывающие окна для обратной связи на сайте или в приложении и даже социальные сети, ведь проводить опросы можно прямо там.</p><p>Один из ключевых шагов после запуска MVP — сбор обратной связи от первых пользователей</p><p>В наших проектах мы никогда не перестаем собирать обратную связь от пользователей приложения, ведь она играет ключевую роль в развитии продукта. Мы собираем все отзывы через специальный Telegram-канал, где получаем уведомления о каждом комментарии. Это помогает нам узнавать, на каких устройствах возникают проблемы, быстро находить и исправлять ошибки.</p><h2>Метрики успеха: какие ключевые показатели эффективности (KPI) отслеживать в начальной стадии</h2><img src=\"/assets/статьи/15/Метрики успеха какие ключевые показатели эффективности.png\" alt=\"Метрики успеха\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Чтобы иметь возможность корректировать стратегию развития продукта, важно отслеживать ключевые показатели эффективности (KPI):</p><ul><li>число загрузок в магазинах приложений</li><li>рейтинг в магазинах приложений</li><li>MAU (Monthly active users) — уникальные пользователи, заходившие в приложение в течение месяца</li><li>DAU (Daily active users) — уникальные пользователи, заходившие в приложение в течение суток</li><li>WAU (Weekly active users) — уникальные пользователи, заходившие в приложение в течение недели</li><li>ASL (Average Session Length) — средняя продолжительность сессии</li><li>crash-free — доля сессий, не завершившихся аварийно.</li></ul><p>Чтобы корректировать стратегию развития продукта, важно отслеживать ключевые показатели эффективности (KPI)</p><p>Чтобы оптимизировать процесс работы с KPI, мы в CDI используем внутренний Telegram-канал, в котором фиксируется аналитика по каждому проекту. Благодаря интеграции всех данных в единую базу, каждый участник проекта может в реальном времени отслеживать ключевые показатели и быстро реагировать на изменения.</p><h2>Адаптация продукта: алгоритмы и стратегии для быстрого внесения изменений на основе обратной связи</h2><img src=\"/assets/статьи/15/Адаптация продукта алгоритмы и стратегии для быстрого внесения изменений на основе обратной связи.png\" alt=\"Адаптация продукта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Для оперативного внесения изменений важен комплексный подход. Приоритезируйте задачи: начните с критических проблем, затем улучшайте интерфейс и добавляйте новые функции. Не все предложения и замечания можно внедрить сразу. Разделите их на категории по важности и срочности:</p><ul><li>критические проблемы: ошибки и баги, мешающие пользователям</li><li>улучшения интерфейса: изменения, улучшающие пользовательский опыт</li><li>новые функции: предложения, которые могут повысить ценность продукта.</li></ul><p>Регулярно оценивайте, как внесенные изменения влияют на показатели продукта и пользовательский опыт. Настройте систему мониторинга для отслеживания ключевых метрик и перманентного анализа обратной связи, чтобы выявлять новые области для улучшения.</p><p>Не все предложения и замечания можно внедрить сразу. Разделите их на категории по важности и срочности.</p><p><strong>Вот как этот процесс выглядит на практике в CDI:</strong></p><p>Сбор данных. Все отзывы сразу попадают в нашу базу. Анализ. Аналитик изучает отзывы и выявляет ключевые проблемы и тенденции. Принятие решений. Команда определяет приоритеты для обновлений и улучшений. Реализация. Разработчики вносят изменения в ближайших обновлениях. Обратная связь. Если у пользователя был негативный опыт, о котором он пишет в отзыве, мы сообщаем, что устранили проблему, что часто повышает его оценку приложения.</p><h2>Планы на будущее: как строить дальнейший план развития продукта</h2><p><strong>Вот несколько действий, которые помогут вам сформировать бэклог продукта:</strong></p><p>Анализ обратной связи и поведения пользователей. UX-тестирования, отзывы и анализ данных — все это поможет актуализировать план развития. Оценка усилий и ресурсов. Определите временные затраты для реализации каждой задачи. Убедитесь, что ваша команда располагает необходимыми ресурсами для выполнения приоритетных задач. Планирование релизов. Разработайте график выпуска новых функций и улучшений с учетом реалистичных сроков и возможных форс-мажоров. Коммуникация и прозрачность. Убедитесь, что всей команде известны текущие приоритеты и цели. Поддерживайте открытый диалог с заинтересованными сторонами и пользователями для постоянного улучшения продукта. Регулярная проверка и обновление бэклога. Периодически пересматривайте бэклог, чтобы отражать в нем изменения в приоритетах. Стоит помнить, что первые шаги после запуска MVP являются определяющими для успешного развития вашего продукта. Регулярный анализ основных метрик и пользовательского опыта помогают выявлять ключевые направления для улучшения продукта и гибко реагировать на изменения.</p><p>Итак, MVP — это не просто этап разработки, а стратегический инструмент, который помогает бизнесу расти. Он позволяет быстро тестировать идеи, собирать ценную обратную связь и экономить ресурсы. Если вы хотите создать успешный продукт, начните с MVP.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/15/15.png",
        "animationDelay": "300ms"
    },
    {
        "id": 16,
        "date": "30 марта, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Разработка",
        "title": "Мобильное приложение и адаптивный сайт: что выбрать",
        "title2": "Мобильное приложение vs адаптивный сайт",
        "text": "<p>До сих пор нет однозначного ответа на вопрос, что лучше: адаптивный сайт или мобильное приложение. Выбор между ними зависит от ряда факторов, начиная бюджетом проекта и заканчивая целевой аудиторией бизнеса. Вместе с экспертами digital-агентства CDI разбираемся в особенностях каждого из подходов и рассказываем, когда стоит отдать предпочтение мобильному приложению, а когда лучше направить усилия на разработку адаптивного сайта.</p><h2>Чем мобильное приложение отличается от адаптивного сайта</h2><p>Мобильное приложение — это программный продукт, разработку которого осуществляют либо на нативе (отдельно для платформы iOS и для Android), либо на кроссплатформе (для нескольких платформ сразу благодаря единой кодовой базе).</p><p>Адаптивный сайт — это веб-сайт, верстка которого воспроизводится корректно на экранах с различным разрешением. Внешний вид и функциональность сайта при использовании такой верстки будут адаптированы под экран смартфона, планшета и даже телевизора с функцией Smart TV.</p><p>Сейчас адаптивность веб-сайта основывается на использовании брейкпоинтов, которые важно учитывать на этапе проектирования и кодирования. Брейкпоинты — это ключевые точки, на которых меняется дизайн страницы для обеспечения лучшего пользовательского опыта на различных устройствах.</p><p>Важно понимать, что адаптивность не является встроенной функцией, она требует дополнительных усилий и ресурсов для её реализации. Так, еще на этапе проектирования важно учитывать, как будет меняться верстка в зависимости от размера экрана. Реализация адаптивности требует дополнительных усилий и со стороны разработчика. Это может включать как написание дополнительных стилей, так и тестирование отдельно на ПК, ноутбуке, планшете и смартфоне. Только при правильной настройке и использовании брейкпоинтов адаптивность будет работать эффективно.</p><p>Противоположным подходом является резиновая верстка, при которой элементы растягиваются или сжимаются в зависимости от ширины окна браузера. Такая верстка была популярна до 2010-х годов, но с развитием устройств с различными размерами экранов она отошла на второй план. Несмотря на снижение популярности, резиновая верстка все еще используется в некоторых случаях, особенно когда требуются простые изменения в размере элементов без полной адаптации.</p><h2>Особенности мобильного приложения</h2><p>Согласно недавнему исследованию Exploding Topics, свыше 55% людей по всему миру предпочитает использовать мобильные гаджеты для доступа в интернет, и этот показатель будет только расти. Однако высокие затраты на разработку и маркетинговое продвижение приложений мотивируют бизнес более осознанно подходить к вопросу о целесообразности создания приложения. Кроме того, в 2022 году рынок мобильных приложений России столкнулся с кризисом, обусловленным массовым удалением российских приложений из сторов. Отчет Sensor Tower подтверждает, что с 24 февраля из российского сегмента App Store было исключено приблизительно 7000 приложений.</p><p>Несмотря на то, что разработка и поддержка приложений могут быть затратными, для многих бизнес-моделей они становятся естественным и даже необходимым этапом развития. А все потому, что мобильные приложения обладают рядом особенностей.</p><h3>1. Скорость работы</h3><img src=\"/assets/статьи/16/1. Скорость работы.png\" alt=\"Скорость работы\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Вообще, скорость работы как мобильного приложения, так и сайта зависит в первую очередь не от их индивидуальных особенностей, а от скорости интернета пользователя. Однако мобильное приложение действительно может работать быстрее, чем адаптивный сайт.</p><p>Веб-сайт получает ресурсы (стили, скрипты, шрифты) через HTTP-запросы, и браузер тратит ресурсы на их рендеринг. К тому же сам браузер требует большое количество ресурсов от системы просто за свою работу. Это замедляет работу веб-сайта в сравнении с мобильным приложением в нативной реализации, которое напрямую использует ресурсы системы и берет значительную часть данных из «сборки», не нуждаясь в браузере. То есть, мобильное приложение не тратит системные ресурсы на работу «движка» браузера и не ограничивается его возможностями. Поэтому у него есть преимущества в доступе к системным ресурсам.</p><h3>2. Доступ к встроенным функциям смартфона</h3><p>Аппаратные возможности устройств играют ключевую роль в увеличении как скорости, так и эффективности мобильных приложений. Современные смартфоны оснащены камерой, микрофоном, GPS, акселерометром, компасом и другими компонентами. Они расширяют функциональность приложений, позволяя им предлагать пользователям такие возможности, как сканирование QR-кодов, создание фото и видео, дополненную реальность, голосовые команды, точное определение геопозиции и т.д.</p><p>Мобильные приложения, разработанные нативно, имеют прямой доступ к этим аппаратным компонентам, что обеспечивает высокую скорость и эффективность обработки данных. Нативные приложения написаны с учетом конкретной операционной системы (iOS, Android), поэтому они могут использовать оптимизированные API для работы с аппаратным обеспечением. Это позволяет минимизировать задержки и повысить производительность, что особенно важно для приложений, обрабатывающих данные в режиме реального времени, таких как видеоконференции, игровые приложения и приложения виртуальной реальности.</p><p>Андрей Киселев, руководитель проектов мобильной разработки: «Даже если веб-приложение имеет доступ к некоторым функциям устройства (например, доступ к камере и микрофону через браузер), оно все равно не может конкурировать с нативным приложением по скорости обработки запроса и количеству аппаратных модулей, которые можно задействовать. Веб-приложения работают в контексте браузера, что добавляет слой абстракции и, следовательно, дополнительные накладные расходы».</p><p>Браузерные ограничения и различия в реализации веб-стандартов на разных платформах также могут привести к непредсказуемому поведению и снижению производительности.</p><h3>3. Работа в автономном режиме</h3><p>Многие мобильные приложения могут работать в автономном режиме или при ограниченном интернет-соединении, что делает их удобными в использовании в любое время и в любом месте.</p><p>Важно: работа в автономном режиме возможна только в случае, если функционал приложения это позволяет. Например, игры, блокноты и другие приложения, которые не требуют постоянного подключения к серверу, могут работать без интернета. Однако если приложение требует постоянного обмена данными с сервером или базой данных, то даже в нативной реализации могут возникнуть ошибки при отсутствии подключения.</p><h3>4. Коммуникация с пользователями</h3><img src=\"/assets/статьи/16/4. Коммуникация с пользователями.png\" alt=\"Коммуникация с пользователями\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Мобильные приложения позволяют использовать push-уведомления для информирования пользователей о новом контенте, продуктах и предложениях, что повышает вовлеченность и лояльность пользователей. Конечно, веб-сайты также могут отправлять push-уведомления через браузер, если пользователь дал на это разрешение. Однако push-уведомления из мобильных приложений и push-уведомления с веб-сайтов имеют ряд отличий:</p><ul><li><strong>Техническая реализация.</strong> Пуши от мобильных приложений отравляются от самого приложения через специальные службы, такие как Apple Push Notification Service (APNs) для iOS и Firebase Cloud Messaging (FCM) для Android. Пуши от сайтов отправляются через браузер пользователя: Google Chrome, Яндекс, Safari и другие.</li><li><strong>Доступность.</strong> Пуши от мобильных приложений приходят пользователю, даже если приложение закрыто, но при условии, что устройство включено и подключено к интернету. Пуши от сайтов приходят только тогда, когда браузер запущен, хотя сам сайт может быть закрыт.</li><li><strong>Интерактивность и возможности.</strong> Пуши от мобильных приложений могут использовать расширенные возможности, такие как встроенные медиаплееры, интерактивные кнопки, глубокие ссылки в приложение и т.д. Пуши от сайтов все же ограничены функционалом браузера, хотя последние версии браузеров поддерживают довольно широкие возможности, включая кнопки и простые взаимодействия.</li></ul><p>И все-таки push-уведомления от мобильного приложения обладают преимуществами по сравнению с web push:</p><ul><li>Пользователи, которые установили приложение, обычно более вовлечены, чем те, кто просто посетил сайт. Это делает пуш-уведомления из приложения более эффективными.</li><li>В отличие от веб-пушей, мобильные уведомления могут приходить, даже когда браузер неактивен или закрыт.</li><li>Мобильные уведомления могут включать больше мультимедийных элементов и интерактивных компонентов по сравнению с веб-уведомлениями.</li></ul><p>В целом, пуш-уведомления от мобильных приложений предлагают более глубокую интеграцию и взаимодействие с пользователем, что делает их мощным инструментом для взаимодействия и повышения лояльности.</p><p>Помимо пуш-уведомлений, даже иконка мобильного приложения на устройстве пользователя становится постоянным напоминанием о бренде.</p><h3>5. Безопасность</h3><p>Мобильные приложения могут быть более безопасными за счет их локального хранения на устройстве пользователя. Адаптивные сайты и веб-приложения локализованы в интернете, что делает их более уязвимыми и подверженными различным типам атак, таким как CSRF (межсайтовая подделка запросов), XSS (межсайтовый скриптинг) и SQL-инъекции (внедрение в запрос произвольного SQL-кода). Эти виды атак могут компрометировать данные пользователей и функциональность веб-приложений.</p><p>Андрей Киселев, руководитель проектов мобильной разработки: «Кроме того, магазины приложений выполняют роль своеобразных гарантов качества и безопасности, предъявляя строгие требования к разработчикам. Эти требования включают проверку кода, безопасность данных и соответствие приложений стандартам магазина перед их публикацией. Это значительно повышает уровень доверия пользователей к мобильным приложениям».</p><p>В веб-среде же первую линию защиты обеспечивает браузер. Это создает отличия в подходах к безопасности между мобильными и веб-приложениями.</p><h2>Особенности адаптивного сайта</h2><img src=\"/assets/статьи/16/Особенности адаптивного сайта.png\" alt=\"Особенности адаптивного сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Осенью 2020 года Google объявил о переходе на mobile-first индексацию, которая дает приоритет в поисковой выдаче для ресурсов, адаптированных под смартфоны и планшеты. Чем же они обязаны таким привилегиям?</p><h3>1. Бесшовный доступ для пользователей без дополнительных усилий</h3><p>Главное преимущество адаптивного сайта перед мобильным приложением заключается в том, что вы не утруждаете пользователя на совершение лишних действий. Чтобы пользователь установил мобильное приложение на телефон, он должен четко понимать ценность такой установки. Эту ценность до него нужно донести: например, это может быть программа лояльности с выдачей бонусных баллов за установку приложения, которые пользователь может потратить при первой покупке. Также мобильное приложение на устройстве конкурирует с другими приложениями на экране смартфона. Это борьба за внимание пользователя, к которой нужно быть готовым. Сайт же позволяет пользователю без совершения дополнительных действий быстро зайти, ознакомиться, совершить целевое действие.</p><h3>2. Простота разработки и поддержания</h3><p>Разработка адаптивного сайта осуществляется быстрее, чем мобильного приложения. Преимущество адаптивного подхода заключается в том, что вы вкладываетесь только в одно решение, то есть в сайт. И получаете решение, которое будет корректно отображаться на экранах любого размера. Это делает его реализацию менее затратной по сравнению с разработкой отдельно мобильного приложения и сайта.</p><p>А обновления для адаптивных сайтов могут быть выпущены достаточно быстро, так как для них не требуется проходить процедуру одобрения в магазинах приложений. Пользователи автоматически видят последнюю версию сайта без необходимости скачивания обновлений.</p><h3>3. Поисковая оптимизация</h3><img src=\"/assets/статьи/16/3. Поисковая оптимизация.png\" alt=\"Поисковая оптимизация\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Адаптивные сайты лучше индексируются поисковыми системами, так как у них есть один URL и одинаковый HTML-код для всех устройств. Пользователи могут переходить на адаптивные сайты напрямую из поисковых систем или через ссылки в социальных сетях, не теряя времени на установку приложений, что уменьшает количество шагов до достижения конечной цели и может увеличить конверсию.</p><p>При этом мобильные приложения нуждаются в активном продвижении, чтобы пользователи узнавали о них и скачивали из магазинов.</p><h3>4. Отсутствие ограничений магазинов приложений</h3><p>Адаптивные сайты не подвержены политике и ограничениям магазинов приложений, что позволяет более гибко управлять контентом и функционалом. Так, если мобильное приложение могут легко удалить из магазина приложений, с адаптивным сайтом этого не произойдет — ведь, по сути, это одна из версий сайта.</p><h2>Чек-лист по выбору между мобильным приложением и адаптивным сайтом</h2><p>9 вопросов, на которые необходимо ответить, чтобы сделать правильный выбор.</p><h3>1. Какую аудиторию пользователей вы хотите охватить?</h3><img src=\"/assets/статьи/16/1. Какую аудиторию пользователей.png\" alt=\"Какую аудиторию пользователей\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>При выборе между адаптивным сайтом и мобильным приложением важно учитывать особенности целевой аудитории, для которой создается продукт. Так, пользователям банковских услуг удобнее пользоваться смартфоном, а бухгалтерам для составления отчетности больше подойдет компьютер.</p><h3>2. Будут ли пользователи систематически заходить в приложение, чтобы воспользоваться услугами, которые вы предлагаете?</h3><p>Например, сервисы доставки еды, банки, такси, социальные сети, маркетплейсы, курьерские службы и программы лояльности магазинов и авиакомпаний прочно обосновались в смартфонах пользователей. Даже если взаимодействие с услугой происходит раз в месяц, но сохраняет систематичность, например, оплата мобильной связи или заказ воды в офис, это достаточный уровень вовлеченности для того, чтобы сделать выбор в пользу мобильного приложения.</p><p>Если же вы оказываете услугу один раз в год и реже, потребность в мобильном приложении стремится к нулю. К примеру, ресурс, предлагающий прыжки с парашютом — это разовый интерес. Для него нет необходимости в поддержании полнофункционального мобильного приложения, подразумевающего сложный сервис и разработку, достаточно адаптивной версии сайта.</p><h3>3. Вам нужен доступ к встроенным функциям телефона?</h3><p>Камера, GPS, показатели активности будут хорошо функционировать в связке с мобильным приложением. Если что-то из этого имеет решающее значение для вашего продукта, следует подумать о создании мобильного приложения.</p><h3>4. Сложный ли у вас продукт?</h3><p>Чем сложнее бизнес, тем сложнее и объемнее его интерфейсные решения, поэтому технически сложные проекты зачастую функционируют на основе веб-сайтов. Например, агропромышленное предприятие, для которого нужно контролировать сеть ферм — это сложный механизм. Его едва ли можно реализовать в рамках мобильного приложения, для него лучше использовать десктопную версию. Сюда же можно отнести логистические и бухгалтерские системы — бухгалтер не будет составлять годовую отчетность через смартфон.</p><p>Мобильное приложение в данном случае может стать запасной площадкой с урезанной функциональностью, а отдать первенство в разработке стоит адаптивному сайту.</p><h3>5. Как часто люди будут использовать ваш продукт в автономном режиме?</h3><img src=\"/assets/статьи/16/5. Как часто люди будут использовать ваш продукт в автономном режиме.png\" alt=\"Как часто люди будут использовать ваш продукт в автономном режиме\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Анастасия Вихрова, руководитель продукта: «Если ваше решение предназначено в основном для пользователей, которые работают в автономном режиме, то гораздо лучше разработать мобильное приложение с возможностью работы в офлайн-режиме. В этом случае пользователи смогут получить доступ к нужным данным в любое время, когда это потребуется, даже там, где есть проблемы с подключением к интернету».</p><p>Подумайте о вашей целевой аудитории и особенностях продукта или услуги. Возможно, люди будут часто использовать ваше приложение в таких местах, как спортзалы, поезда и вдали от населенных пунктов.</p><p>Например, приложение Google Maps сейчас позволяет пользователям загружать карту для автономной навигации. А Tripadvisor дает возможность загружать офлайн-путеводитель по городу для поездок за границу.</p><h3>6. У вас небольшой бюджет?</h3><p>Если да, то не стоит спешить разрабатывать мобильное приложение. Согласно исследованию Business of Apps в 2024 году, средняя стоимость разработки приложения начинается от 16 тысяч долларов.</p><p>Нативное приложение обычно считается более дорогим вариантом из-за необходимости разработки отдельных версий для каждой платформы, что подразумевает 2 разные команды разработчиков и в 2 раза больше работы над исправлением ошибок и новыми функциями.</p><p>Разработка кроссплатформенных приложений часто обходится дешевле, чем нативных, потому что позволяет использовать один и тот же код для разных платформ. Однако сложные приложения, требующие глубокой интеграции с системой или высокой производительности, могут потребовать более серьезной работы и, следовательно, стоить дороже.</p><p>Кроме того, делая выбор в пользу мобильного приложения, стоит учитывать, что потребуется заложить затраты на продвижение приложения для того, чтобы о нем узнало как можно больше пользователей.</p><p>Так, самым экономичным вариантом остаются адаптивные сайты, их разработка обойдется значительно дешевле, особенно небольших и средних проектов.</p><h3>7. Вы будете часто обновлять и дорабатывать приложение?</h3><p>Если да, то при ограниченном бюджете вам следует начать с адаптивного сайта. А уже со временем перейти к разработке мобильного приложения.</p><p>Мобильные приложения и веб-сайты сильно различаются в плане разработки и поддержки. Загрузка новой версии мобильного приложения в App Store для iOS и Google Play для Android может быть длительным процессом. Сначала разработчики должны подготовить соответствующий пакет обновления и загрузить его в магазин. Это может занять несколько часов, так как требуется соблюдение технических требований и процедур, специфичных для каждой платформы.</p><p>После загрузки обновления начинается процесс модерации. Он может занимать около недели и иногда даже больше. Во время модерации специалисты магазина проверяют приложение на соответствие принципам публикации, включая безопасность, содержание и качество.</p><p>Со стороны клиента все это означает, что он должен платить зарплату специалистам, занимающимся разработкой и поддержкой приложения. А хорошие мобильные разработчики стоят немало.</p><p>Иван Мрачко, руководитель отдела аналитики и проектирования: «Кроме того, если приложение разрабатывается нативно, то есть отдельно для каждой платформы (iOS и Android), это значительно увеличивает затраты. В этом случае требуются разные команды разработчиков, каждая из которых специализируется на своей платформе».</p><p>Затраты удваиваются, так как нужно оплачивать труд двух команд специалистов, поддерживать два кодовых репозитория.</p><p>Веб-сайты в этом плане гораздо более экономичны. Изменения на сайте могут быть внесены напрямую через систему управления контентом (CMS) или разработчиками, и они сразу же становятся доступны для пользователей без задержек на модерацию и без необходимости загружать обновления через магазин приложений. Это делает поддержку сайта более гибкой и менее затратной в сравнении с мобильными приложениями.</p><h3>8. Есть ли у вашего конкурента мобильное приложение?</h3><p>Возможно, ваше мобильное приложение станет уникальным предложением в отрасли. Если нет, то стоит подумать о том, какими преимуществами его наделить. Для этого важно изучить то, что делают конкуренты, насколько успешно это получается, чего не хватает пользователям, и постараться превзойти то, что уже существует.</p><h3>9. У вас ограниченные сроки на запуск?</h3><img src=\"/assets/статьи/16/9. У вас ограниченные сроки на запуск.png\" alt=\"У вас ограниченные сроки на запуск\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>При разработке нативного мобильного приложения нужно создать отдельную версию приложения для каждой операционной системы и адаптировать его под различные устройства, дождаться одобрения стора для размещения.</p><p>Кроссплатформенные приложения создаются быстрее, чем нативные, что делает их отличным вариантом для быстрого запуска MVP. Однако даже кроссплатформенное приложение все равно требует больше времени на разработку, чем адаптивный сайт, для которого требуется создать только один цифровой продукт, одинаково хорошо работающий на каждом устройстве.</p><h2>Выводы</h2><p>Таким образом, выбирайте мобильное приложение, если:</p><ul><li>ценность вашего продукта обеспечивает постоянный интерес пользователей и их готовность регулярно использовать приложение;</li><li>вы планируете активно подогревать интерес пользователей с помощью push-уведомлений;</li><li>для вашего продукта важен доступ к определенным встроенным функциям телефона;</li><li>вашему продукту требуется высокая производительность.</li></ul><p>И выбирайте адаптивный сайт, если:</p><ul><li>вы хотите охватить более широкую аудиторию;</li><li>ваша целевая аудитория предпочитает пользоваться компьютерами;</li><li>вы хотите быстро запустить продукт;</li><li>вы планируете часто выпускать обновления и дорабатывать свой продукт.</li></ul><p>Итак, адаптивные сайты являются универсальным решением, так как они корректно отображаются на всех типах устройств, от смартфонов до настольных компьютеров. Это удобно для пользователей и облегчает поисковую оптимизацию. А мобильные приложения могут обеспечить более высокую производительность, интеграцию с системными возможностями устройства, а также работу в офлайн-режиме.</p><p>Учитывая особенности обоих подходов, многие компании используют и сайт, и приложение для максимального охвата и удовлетворения потребностей пользователей. При этом кому-то достаточно сайта, а кто-то ведет всю коммуникацию с клиентом через мобильное приложение.</p><p>Каждый бизнес с его аудиторией и потребностями нужно рассматривать индивидуально. Обращайтесь к команде CDI — наши специалисты помогут вам подобрать оптимальное решение для целей, задач и бюджета вашего бизнеса.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/16/16.png",
        "animationDelay": "500ms"
    },
    {
        "id": 17,
        "date": "05 апреля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Разработка",
        "title": "Мобильные приложения: Native, Flutter, PWA — что выбрать",
        "title2": "Типы мобильных приложений",
        "text": "<p>Гурген Балаян, технический руководитель проектов мобильной разработки, сравнивает нативные, кроссплатформенные и PWA-приложения и дает чек-лист по выбору.</p><p>В современном мире технологий выбор правильного инструмента для разработки мобильных приложений становится ключевым фактором как для успешного взаимодействия с целевой аудиторией, так и для эффективного распоряжения ресурсами. Progressive Web Apps (PWA), Flutter-приложения и нативные iOS/Android приложения предоставляют разные подходы и возможности для бизнеса.</p><h2>В чем отличия трех подходов?</h2><img src=\"/assets/статьи/17/В чем отличия трех подходов.png\" alt=\"В чем отличия трех подходов\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>PWA или Progressive Web Application – технология, которая позволяет пользователям установить ваш сайт на смартфон как приложение. По сути этот просто сайт, но со своими нюансами, о которых подробнее расскажу позже.</p><p>Кроссплатформенные мобильные приложения – это приложения, которые разрабатывают на единой кодовой базе сразу для нескольких платформ. Популярным решением на сегодняшний день является Flutter.</p><p>Native или нативные мобильные приложения – это приложения, которые разрабатывают и адаптируют под одну конкретную платформу. То есть, если бизнес решает выбрать нативную разработку, то необходимо разрабатывать отдельное приложение для iOS и отдельное для Android.</p><p>Можно задаться вопросом «А причем тут вообще мобильная разработка и PWA»? Ответ на него достаточно прост. Российский рынок мобильных приложений столкнулся с большой проблемой — удаление приложений из магазинов. Компании начали активно перестраиваться и разрабатывать PWA как альтернативу, ведь в магазины доступ уже закрыт, а терять пользователей не хочется.</p><p>Важно понимать, что современный пользователь смартфона привык устанавливать приложения через магазины, такие как AppStore или GooglePlay. И бизнесу приходится искать ответы на вопрос «Как мотивировать пользователей устанавливать PWA?».</p><p>Итак, рассмотрим детальнее каждую из технологий.</p><h2>PWA</h2><img src=\"/assets/статьи/17/PWA.jpg\" alt=\"PWA\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h3>Технические особенности:</h3><ul><li>PWA используют языки HTML, CSS и JavaScript, что обеспечивает их кроссплатформенность и совместимость с различными браузерами (но не всеми).</li><li>Основной технологический элемент PWA — Service Worker, обеспечивающий работу приложения. Это скрипт, работающий в фоновом режиме независимо от веб-страницы.</li><li>Web App Manifest — это файл JSON, который сообщает браузеру о вашем PWA и о том, как приложение должно вести себя при установке на мобильное устройство. Типичный файл манифеста включает имя приложения, значки, которые приложение должно использовать, и многое другое.</li></ul><h3>Преимущества:</h3><ul><li>Приложения могут работать на разных устройствах и операционных системах, ведь все происходит внутри браузера, а для бизнеса это экономия трудозатрат и времени.</li><li>Поддержка пуш-уведомлений. До недавнего времени это было ограничением, пуши работали только на Android, но с версии iOS 16.4 это стало возможным.</li><li>Есть доступ к возможностям платформы iOS и Android, хоть и ограниченный.</li><li>Поддерживается работа в офлайне и фоновом режиме, но также с ограничениями.</li><li>Запуск с иконки на экране смартфона, аналогично нативным и кроссплатформенным приложениям.</li><li>Размер PWA приложения, как правило, не превышает 1-3 Мб, что может быть большим плюсом для пользователей с ограниченным объемом памяти на устройствах.</li><li>Не нужно размещать приложение в AppStore и Google Play. Его можно установить напрямую с вашего сайта. Но если вдруг захотелось разместить в магазины, то это также можно сделать.</li></ul><h3>Ограничения:</h3><ul><li>Ограниченный доступ к аппаратным ресурсам.</li><li>Отсутствие магазинов, которые гарантируют безопасность пользователям и при этом являются популярными.</li><li>Низкая поддержка iOS. Те функции, которые поддерживаются на Android, могут быть недоступны на iOS.</li></ul><p>На самом деле, чтобы понять, что доступно, а что нет в PWA, достаточно посетить ресурс whatpwacando.today, установить себе его на смартфон и посмотреть все возможности PWA.</p><p>Яркими примерами PWA являются приложения Сбербанка, Альфа-банка и популярный мессенджер Telegram.</p><img src=\"/assets/статьи/17/PWA 1.jpg\" alt=\"PWA примеры\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><img src=\"/assets/статьи/17/Установка PWA на iOS.jpg\" alt=\"Установка PWA на iOS\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><h2>Flutter-приложения</h2><h3>Технические особенности:</h3><ul><li>Flutter использует язык Dart, который компилируется в машинный код, если мы говорим про мобильные платформы, и в JavaScript, если речь идет про web.</li><li>Flutter — это фреймворк с открытым исходным кодом.</li></ul><h3>Преимущества:</h3><ul><li><strong>Кроссплатформенность.</strong> Один код — несколько платформ, другими словами, экономия трудозатрат и времени.</li><li><strong>Декларативный подход в UI.</strong> Декларативный подход означает, что вы описываете, как должен выглядеть UI в том или ином состоянии приложения, а фреймворк берет на себя заботу о рендеринге UI и переходе между состояниями. Наибольшую популярность Flutter сыскал среди разработчиков благодаря этому подходу, так как он ускоряет разработку.</li><li><strong>Совместимость с нативом.</strong> Это значит, что если возникнут какие-то проблемы с реализацией на Flutter, в проект всегда есть возможность «затащить» код на нативе (не без трудностей, конечно).</li><li><strong>Быстрая разработка и удобное изучение фреймворка</strong> за счет Hot Reload (JIT-компиляция). Если коротко, то это позволяет видеть изменения в коде в реальном времени.</li></ul><p>Прежде чем поговорим про ограничения Flutter, хотел бы отметить, что в статье специально не упоминается Kotlin Multiplatform. На мой взгляд, для написания полноценных мультиплатформенных решений время этой технологии еще не настало, хотя оно и не за горами. А время React Native и Xamarin уже проходит.</p><p>К Flutter же интерес разработчиков повышается уже на протяжении нескольких лет: по данным Statista, в 2022 году его популярность выросла на 12% с 2019 года.</p><h3>Ограничения:</h3><ul><li>Flutter — это фреймворк с открытым исходным кодом от Google. Да, по моему мнению это именно ограничение. Все кроссплатформенные решения живут недолго, их заменяют другие кроссплатформенные решения, а тут еще и Google, который славится огромным количеством закрытых проектов. И вдобавок Kotlin Multiplatform, который наступает на пятки.</li><li>Некоторые библиотеки, которые разрабатывает комьюнити, могут быть устаревшими и долго не обновляться.</li><li>Отсутствие специфических функций, которые приходится писать на Native, а также проблемы с интеграцией нативных модулей. На одном из наших проектов мы столкнулись с этой проблемой: она решаема, но требует определенных трудозатрат.</li><li>И все-таки не такая тесная интеграция с экосистемой iOS.</li></ul><p>Примеры приложений, написанных на Flutter: Alibaba, eBay Motors.</p><h2>Native</h2><h3>Технические особенности:</h3><ul><li>Языки программирования: Swift для iOS и Kotlin/Java для Android.</li></ul><h3>Преимущества:</h3><ul><li>Нативные приложения предоставляют наивысшую производительность за счет тесной интеграции с экосистемой операционной системы.</li><li>Реализация проектов любой сложности.</li><li>Доступ к аппаратным ресурсам каждой платформы.</li><li>Комьюнити разработчиков намного больше, чем у предыдущих решений.</li></ul><h3>Ограничения:</h3><ul><li>Разработка и поддержка двух приложений на iOS и Android может потребовать дополнительных ресурсов: кадровых, финансовых и временных.</li></ul><h2>Чек-лист вопросов, давайте сделаем выбор проще</h2><img src=\"/assets/статьи/17/Чек-лист вопросов, давайте сделаем выбор проще.png\" alt=\"Чек-лист вопросов\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>При выборе технологии для разработки мобильного приложения важно ответить на следующие вопросы:</p><ul><li>Какой у вас бюджет на разработку?</li><li>Какие сроки запуска проекта?</li><li>Нужен ли доступ к специфическим функциям устройства (камера, GPS, датчики)?</li><li>Планируете ли вы часто обновлять приложение?</li><li>Важна ли производительность приложения?</li><li>Нужна ли работа в офлайн-режиме?</li><li>Планируете ли вы размещение в магазинах приложений?</li><li>Какой уровень интеграции с платформой вам нужен?</li></ul><h2>Подведем итоги</h2><p>Допустим, вы решили разрабатывать мобильное приложение и не можете определиться с выбором, даже пройдя по чек-листу выше. Первое, что вы должны сделать — это понять, появятся ли у вас в скором времени технические ограничения, если выберете ту или иную технологию. Если таких ограничений нет, и нужно быстро запустить MVP, то выбирайте между PWA и Flutter. Если вы вдруг столкнетесь с такими ограничениями через год-два, то всегда можно перейти на Native. Обычно компании именно так и поступают, ведь бизнесу важно быстро запустить первую версию продукта, собрать аудиторию пользователей, выполнить определенные задачи, проверить гипотезы, провести тестирование. Другой вопрос, что такой переход по итогу может стать более трудозатратным и дорогим, нежели если бы вы изначально разрабатывали на нативе, так как проект за эти год-два мог значительно разрастись.</p><p>А если коротко, то выбор между PWA, Flutter и нативными приложениями зависит от технических, финансовых и временных потребностей вашего проекта. Как правило, если заказчик выбирает кроссплатформенное решение (и оно технически ему подходит) и в будущем не планирует переходить на натив, то разработанное приложение получается на 40% дешевле. Это средняя цифра, которую мы у себя вывели на основе реализованных проектов. Если же в будущем планируется переход на натив, то тут уже сложно сказать, что выгоднее, так как данный расчет будет индивидуален для каждого проекта.</p><p>Мы рекомендуем обращаться к опытной команде мобильной разработки, которая поможет выбрать наиболее подходящий для вас инструмент.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/17/17.png",
        "animationDelay": "700ms"
    },
    {
        "id": 18,
        "date": "10 апреля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Технологии",
        "title": "VR, AR и MR технологии в бизнесе: применение и перспективы",
        "title2": "VR/AR/MR в бизнесе",
        "text": "<p>В современном мире технологии развиваются с ошеломляющей скоростью, и виртуальная реальность (VR), дополненная реальность (AR) и смешанная реальность (MR) являются одними из самых перспективных и инновационных. Эти технологии предлагают бизнесу новые способы взаимодействия с клиентами, позволяют улучшить бизнес-процессы и повысить эффективность работы в целом. В статье разберем, что это за технологии, обозначим их роль на современном рынке и опишем, как и в каких сферах бизнеса они могут быть успешно внедрены.</p><p>Мы также обсудим потенциальные вызовы, связанные с внедрением и использованием VR, AR и MR-технологий, и дадим рекомендации по их преодолению.</p><h2>Что такое VR</h2><img src=\"/assets/статьи/18/Что такое VR.png\" alt=\"Что такое VR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Виртуальная реальность (VR) — это имитация физической реальности, создаваемая компьютерными технологиями. Использование — с помощью специального оборудования: VR-шлемов, контроллеров и сенсоров. Виртуальная реальность полностью погружает пользователя в цифровую среду, отделяя его от реального мира и позволяя взаимодействовать с виртуальными объектами. VR активно используется в различных сферах: обучение, разработка продуктов, игры и развлечения.</p><h2>Что такое AR</h2><img src=\"/assets/статьи/18/Что такое AR.png\" alt=\"Что такое AR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Дополненная реальность (AR) — это технология, которая позволяет наложить цифровые объекты и информацию на изображение реального мира в реальном времени, создавая эффект смешивания виртуального и физического мира. AR можно использовать через различные устройства: смартфоны, планшеты и специализированные очки AR. Дополненная реальность нашла применение во многих отраслях, включая рекламу, медицину, образование и проектирование.</p><h2>Что такое MR</h2><img src=\"/assets/статьи/18/Что такое MR.png\" alt=\"Что такое MR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Смешанная реальность (MR) — это продвинутая форма дополненной реальности, которая объединяет элементы виртуальной и физической реальности, создавая новые пространства, в которых цифровые объекты и информация сосуществуют и взаимодействуют с реальным миром. В отличие от обычной AR, смешанная реальность позволяет виртуальным объектам реагировать на изменения в окружающей среде и получать обратную связь от пользователя в реальном времени. MR-технологии обычно требуют более сложного оборудования, такого как специальные очки смешанной реальности (например, Microsoft HoloLens). Применяются в обучении, промышленном проектировании и медицинской визуализации.</p><h2>Сравнительный обзор технологий VR, AR и MR</h2><p>VR, AR и MR представляют собой разные технологии, каждая из которых имеет свои особенности применения. Мы провели сравнительный анализ и разобрали их ключевые характеристики и различия.</p><p><strong>Краткие выводы:</strong></p><ul><li><strong>VR-технология</strong> полностью погружает пользователя в виртуальный мир, изолируя его от реального окружения. Подходит для игр, симуляторов и виртуальных тренировок. Устройства виртуальной реальности включают гарнитуры, контроллеры и датчики движения.</li><li><strong>AR-технология</strong> позволяет пользователям видеть реальный мир с наложенными на него виртуальными объектами. Позволяет добавлять информацию или визуализацию в реальное окружение, что может быть полезно для навигации, обучения или разработки продуктов. Устройства дополненной реальности включают смартфоны, планшеты и специализированные очки, такие как Google Glass.</li><li><strong>MR-технология</strong> объединяет элементы VR и AR, позволяя пользователям взаимодействовать с виртуальными объектами в реальном мире. Позволяет создавать совместные среды, в которых пользователи могут взаимодействовать с виртуальными объектами, как если бы они были реальными. Устройства смешанной реальности включают продвинутые гарнитуры, такие как Microsoft HoloLens и Magic Leap One.</li></ul><p>VR, AR и MR технологии, хотя и имеют общие черты, представляют собой разные подходы к созданию и взаимодействию с цифровыми средами. Каждая из этих технологий имеет свои преимущества и области применения, и выбор между ними зависит от конкретных целей и потребностей бизнеса. Внедрение данных технологий может помочь компаниям повысить свою эффективность, улучшить взаимодействие с клиентами и обеспечить новые возможности для инноваций и роста.</p><h2>Обзор рынка: текущее состояние и тренды</h2><p>С появлением более мощных компьютеров и устройств, VR, AR и MR технологии стали более популярными и доступными, что способствовало их интеграции в различные отрасли бизнеса. Основными трендами рынка являются улучшение качества изображений и взаимодействия, уменьшение стоимости оборудования, разработка облачных решений и появление новых возможностей для коммерческого использования.</p><p><strong>Примеры ведущих компаний и их продуктов:</strong></p><ul><li><strong>Oculus</strong> (Meta Platforms Inc.) – разработчик VR-шлемов, таких как Oculus Rift и Oculus Quest, а также платформы Oculus Home для VR-контента.</li><li><strong>Microsoft</strong> – создатель очков смешанной реальности HoloLens и платформы Windows Mixed Reality.</li><li><strong>Google</strong> – разработчик платформы ARCore для создания AR-приложений на Android-устройствах и экспериментального проекта Google Glass.</li><li><strong>Apple</strong> – владелец платформы ARKit для создания AR-приложений на iOS-устройствах и разработчик предполагаемых очков AR/VR, которые пока еще находятся в стадии разработки.</li><li><strong>Magic Leap</strong> – компания, создавшая инновационные очки смешанной реальности Magic Leap One, ориентированные на разработчиков и предприятия.</li></ul><p>Согласно исследованиям рынка, ожидается, что VR, AR и MR технологии продолжат развиваться в ближайшие годы. Предполагается, что будут созданы новые прорывные продукты и услуги, которые улучшат взаимодействие между пользователями и виртуальными объектами, расширят возможности для коммерческого использования и увеличат их присутствие в повседневной жизни людей. Основные факторы, способствующие росту рынка, — технологические инновации, увеличение инвестиций и активное применение в различных отраслях бизнеса.</p><h2>Каким сферам бизнеса подойдут VR, AR и MR</h2><img src=\"/assets/статьи/18/Каким сферам бизнеса подойдут VR, AR и MR.png\" alt=\"Каким сферам бизнеса подойдут VR, AR и MR\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Итак, в каких сферах бизнеса VR, AR и MR технологии нашли свое применение, и в каких из них уже есть опыт успешного внедрения?</p><h3>Образование</h3><p>VR, AR и MR могут существенно улучшить процессы обучения и образования. Технологии позволяют создавать интерактивные симуляции и виртуальные лаборатории, обеспечивая студентам возможность изучать сложные темы и проводить эксперименты в безопасной среде. Также эти технологии способствуют развитию навыков и компетенций, необходимых для профессиональной деятельности, например, с помощью VR-тренажеров.</p><h3>Торговля и ритэйл</h3><p>В сфере торговли и ритейла VR, AR и MR могут предложить новые способы продажи товаров и услуг. AR-приложения позволяют покупателям «примерять» товары виртуально, не выходя из дома, а также получать дополнительную информацию о продуктах. VR-технологии могут быть использованы для создания виртуальных магазинов, где клиенты смогут делать покупки в комфортной среде.</p><h3>Производство и промышленность</h3><p>VR, AR и MR технологии могут помочь в процессах проектирования и разработки продукции, предоставляя инженерам и дизайнерам возможность создавать и тестировать прототипы в виртуальной среде. Также они могут облегчить процессы обучения и контроля качества, используя дополненную реальность для пошаговых инструкций и визуализации рабочих процессов.</p><h3>Медицина и здравоохранение</h3><p>VR, AR и MR технологии уже активно используются в медицинской сфере. Врачи могут использовать их для обучения, проведения симуляций хирургических операций и диагностики заболеваний. Пациенты также могут воспользоваться VR и AR для реабилитации и восстановления после травм.</p><h3>Развлечения и игры</h3><p>Самая очевидная сфера для применения технологий VR, AR и MR. VR-технологии создают погружающие игровые миры, предоставляя игрокам уникальные впечатления и новые возможности взаимодействия с окружающей средой. AR-игры, такие как Pokemon Go, привносят элементы виртуального мира в реальную жизнь, стимулируя пользователей к активному образу жизни и социализации. MR-технологии также обещают новые формы развлечений, где реальность и виртуальность будут переплетаться на новых уровнях.</p><h3>Маркетинг и реклама</h3><p>VR, AR и MR могут привнести новизну в маркетинг и рекламу, предоставляя брендам возможность создавать запоминающиеся и интерактивные рекламные кампании. С помощью AR-технологий бренды могут предоставлять клиентам дополнительную информацию о товарах и услугах, а также создавать виртуальные презентации продуктов. VR-технологии могут использоваться для создания погружающих маркетинговых активаций, позволяющих потребителям «почувствовать» продукт или услугу.</p><h3>Строительство и архитектура</h3><p>VR, AR и MR могут играть ключевую роль в сфере строительства и архитектуры, позволяя проектировщикам, инженерам и заказчикам визуализировать проекты до их реализации. Это позволяет определить возможные проблемы и протестировать различные решения еще на стадии проектирования. Также с помощью AR-технологий можно облегчить процесс строительства, предоставляя рабочим дополнительную информацию и наглядные инструкции прямо на месте строительства.</p><h3>Туризм и сфера гостеприимства</h3><p>VR, AR и MR технологии могут внести значительный вклад в развитие сферы туризма и гостеприимства. С их помощью туристические агентства, отели и достопримечательности могут предложить новые и интересные возможности для своих клиентов:</p><ul><li><strong>Виртуальные туры.</strong> Туристические агентства и отели могут использовать VR-технологии для создания виртуальных туров по объектам размещения и туристическим местам, что позволит потенциальным клиентам ознакомиться с предложениями до бронирования.</li><li><strong>Интерактивные гиды.</strong> AR-приложения могут служить интерактивными гидами, предоставляя туристам подробную информацию об истории и культуре местности, а также о ближайших достопримечательностях и ресторанах.</li><li><strong>Туристические развлечения.</strong> VR, AR и MR могут быть использованы для создания инновационных туристических развлечений, например, интерактивных музеев, виртуальных парков развлечений или дополненных реальностью экскурсий, которые смешивают реальный мир с цифровыми элементами.</li></ul><p>Резюмируя: применение VR, AR и MR в сфере туризма и гостеприимства открывает новые возможности для более эффективного и захватывающего путешествия, обогащая опыт туристов и улучшая качество предоставляемых услуг.</p><h2>Преимущества и вызовы внедрения VR, AR и MR-технологий в бизнес</h2><p><strong>Главные преимущества использования технологий для бизнеса:</strong></p><ul><li><strong>Повышение эффективности и сокращение затрат.</strong> VR, AR и MR-технологии улучшают процессы обучения, планирования и проектирования, что в свою очередь может привести к сокращению затрат и повышению производительности.</li><li><strong>Улучшение взаимодействия с клиентами.</strong> Использование VR, AR и MR технологий помогает брендам создать более глубокое и запоминающееся взаимодействие с потребителями, предоставляя им новые и уникальные способы контакта с продуктами и услугами.</li><li><strong>Расширение рынка.</strong> Технологии помогают бизнесу расширить свою клиентскую базу, предоставляя новые и инновационные продукты и услуги, которые могут привлечь новых пользователей.</li><li><strong>Усиление конкурентоспособности.</strong> Компании, интегрирующие VR, AR и MR технологии, могут получить конкурентное преимущество на рынке, опережая своих конкурентов и выделяясь на фоне остальных.</li></ul><p><strong>Технические и финансовые сложности при внедрении технологий:</strong></p><ul><li><strong>Высокие начальные затраты.</strong> Внедрение VR, AR и MR технологий может потребовать значительных капиталовложений для приобретения оборудования, разработки программного обеспечения и обучения персонала.</li><li><strong>Техническая сложность.</strong> Интеграция и использование этих технологий может быть сложным процессом, требующим навыков и экспертизы в области разработки программного обеспечения, дизайна и поддержки.</li><li><strong>Проблемы совместимости.</strong> Иногда может возникнуть необходимость адаптации существующих систем и инфраструктуры для совместимости с VR, AR и MR-технологиями, что может привести к дополнительным затратам и сложностям.</li><li><strong>Отсутствие стандартов и регуляции.</strong> VR, AR и MR-технологии относительно новы, и на данный момент не существует четких стандартов и регулятивных рамок для их использования и внедрения в бизнес. Это может создавать юридическую и техническую неопределенность, которая может затруднять процесс интеграции и внедрения технологий.</li><li><strong>Недостаток квалифицированных кадров.</strong> Внедрение и поддержание VR, AR и MR технологий требует специалистов с определенными навыками и опытом. В связи с этим компаниям может быть сложно найти и привлечь необходимые таланты для успешной интеграции данных технологий.</li><li><strong>Противоречивое отношение потребителей.</strong> Некоторые пользователи могут быть сдержанны в отношении новых технологий, опасаясь проблем с безопасностью, конфиденциальностью или сомневаясь в практичности использования VR, AR и MR. Бизнесу необходимо убедить потребителей в ценности и безопасности таких технологий для успешного внедрения на рынке.</li></ul><p>Несмотря на вызовы, связанные с внедрением VR, AR и MR-технологий, многие компании уже успешно интегрируют их в свою деятельность, получая реальные преимущества. С учетом быстрого развития технологий и снижения стоимости оборудования, эти сложности скоро будут преодолены, что позволит бизнесу использовать полный потенциал VR, AR и MR.</p><h2>Подытожим</h2><p>VR, AR и MR технологии имеют множество преимуществ для бизнеса, таких как повышение эффективности, сокращение затрат, улучшение взаимодействия с клиентами и усиление конкурентоспособности.</p><p>Эти технологии находят широкое применение в различных отраслях, включая образование, торговлю и ритейл, производство и промышленность, медицину и здравоохранение, развлечения и игры, маркетинг и рекламу, строительство и архитектуру.</p><p>Внедрение VR, AR и MR технологий также сопряжено с техническими и финансовыми вызовами, включая высокие начальные затраты, техническую сложность, проблемы совместимости, отсутствие стандартов и регуляции.</p><p>VR, AR и MR представляют собой мощный инструмент для современного бизнеса. Использование этих технологий может стать ключевым фактором успеха для многих компаний в будущем.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/18/18.png",
        "animationDelay": "300ms"
    },
    {
        "id": 19,
        "date": "15 апреля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Как концепция продукта в IT выступает переводчиком с языка клиента на язык разработчиков",
        "title2": "Концепция продукта в IT",
        "text": "<p>В этой статье мы поговорим о таком артефакте и инструменте коммуникации между заказчиком и исполнителем, как концепция продукта в IT. Аналитики CDI расскажут, зачем она нужна, какие включает разделы, как помогает подробно описать требования клиента, а также приведут чек-лист сильной концепции.</p><p>Идет 19-й год деятельности CDI на digital-рынке, и за все это время к нам приходили разные клиенты. Иногда было четкое ТЗ и детальное представление о результате — это идеальный клиент. И наоборот, случалось, что у заказчика есть лишь общее представление о планируемом результате. Например, клиент говорит: «Мне нужен стильный сайт с лаконичным дизайном. Нравится, как сделано у Тинькофф». И все. Это, безусловно, осложняет работу.</p><p>Потому что в первом случае, когда у клиента уже есть детальные, емкие и четкие требования, мы задаем вопросы уточняющего характера, делаем оценку и начинаем работу.</p><p>Во втором случае, когда клиент сам не совсем понимает, какой продукт ему нужен, ситуация требует дополнительной предпроектной подготовки.</p><p>Сначала нам на помощь приходит бриф.</p><h2>Бриф как первичный инструмент коммуникации</h2><img src=\"/assets/статьи/19/Бриф как первичный инструмент коммуникации.png\" alt=\"Бриф как первичный инструмент коммуникации\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Брифинг клиента помогает исполнителю получить четкие и понятные вводные данные, а заказчику — полноценно описать задачу и планируемый результат.</p><p>Предположим, клиент обратился к нам за разработкой корпоративного сайта.</p><p>Бриф на разработку сайта помогает команде:</p><ul><li>понять, что имеется в виду;</li><li>собрать информации по-максимуму;</li><li>узнать много новой информации о клиенте, которой нет в открытых источниках.</li></ul><p>Но даже после брифинга клиента часто не удается до конца прояснить, что должна разработать команда. В этом случае приходит на помощь концепция продукта — своего рода переводчик с языка клиента на язык разработчиков.</p><h2>Какие задачи помогает решить концепция?</h2><ul><li>Позволяет сделать анализ вводных данных.</li><li>Дает понимание обо всех необходимых составляющих продукта.</li><li>Дает возможность разделить процесс создания продукта на этапы.</li><li>Конкретизирует сроки и стоимость на выполнение конкретных работ.</li><li>Определяет, какие функциональности, экраны и сценарии будут заложены.</li><li>Отвечает на вопрос, может ли команда технически реализовать то, что задумано.</li><li>Улучшает взаимопонимание между клиентом и командой разработки.</li></ul><h2>Что входит в формирование концепции IT-проекта</h2><p>Каждый продукт имеет свою уникальную концепцию. Команда должна отталкиваться от решаемых задач. Иногда достаточно просто перечислить шаблоны и описать функциональность. Если есть только требования от заказчика, концепция представляет собой функциональные требования или функциональное описание. Однако от заказчика могут поступить и дополнительные вводные: например, результаты исследований, конкурентный анализ. Тогда концепция продукта расширяется.</p><p>Обратите внимание, что концепция — это не то же самое, что и техническое задание, хотя между ними и есть прямая взаимосвязь.</p><p>Если клиент требует формальное ТЗ (в том числе по ГОСТ), его разработка должна начинаться сразу за созданием концепции проекта.</p><img src=\"/assets/статьи/19/Если клиент требует формальное ТЗ.png\" alt=\"Если клиент требует формальное ТЗ\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Шаблон концепции проекта включает в себя типовые разделы, о которых мы расскажем далее.</p><p>В среднем написание концепции занимает от 20 до 60 часов. Это время может варьироваться исходя из таких данных, как сложность, специфика и объем разрабатываемого продукта.</p><p>В зависимости от компании процесс написания концепции может быть разным. Мы в CDI, как правило, разрабатываем и презентуем концепции еще до заключения договора с клиентом. Это позволяет нам глубже понять стоящие задачи и дать точную оценку.</p><h2>Расскажем подробнее о типовых разделах концепции проекта</h2><p>Теперь поговорим о структуре концепции и раскроем, что входит в каждый из ее разделов.</p><h3>Цели и специфика продукта</h3><p>Этот раздел включает в себя вводные данные по продукту: что за бизнес у клиента, кто планируемый пользователь продукта, какие проблемы продукт будет решать, какие цели стоят перед ним.</p><h3>Описание бизнеса и информация о заказчике</h3><p>В этот раздел включена общая информация о клиенте: чем он занимается, когда была основана его компания, какие услуги она предоставляет на рынке. Раздел помогает глубже понять бизнес заказчика.</p><h3>Цели</h3><img src=\"/assets/статьи/19/Цели.png\" alt=\"Цели\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Цели будущего продукта — это результат, которого команда должна добиться после запуска. Лучше, чтобы цель была написана по принципу SMART, то есть была конкретной, измеримой, достижимой, актуальной и имела ограничение во времени. Приведем примеры правильных и неправильных целей:</p><ul><li><strong>Неправильно:</strong> «Сделать хороший сайт»</li><li><strong>Правильно:</strong> «Увеличить количество онлайн-заявок на 30% за 6 месяцев после запуска сайта»</li></ul><h3>Бизнес-задачи</h3><p>В некоторых проектах этот блок не отображается в концепции. Бизнес-задача должна отвечать на вопрос: «Что сделать, чтобы достичь определенной цели бизнеса?». Если ваша цель — это разработка системы онлайн-поддержки, то бизнес-задача для нее может быть «разработать интерфейс оператора системы».</p><h3>Бизнес-специфика</h3><p>В этом разделе указываются особенности бизнеса. К примеру, у компании есть несколько филиалов, функционирующих в разных часовых поясах, а также отсутствует общая ERP-система. Аналитик учитывает все факторы, которые могут повлиять на ход проекта.</p><h3>Целевая аудитория</h3><img src=\"/assets/статьи/19/Целевая аудитория.png\" alt=\"Целевая аудитория\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Этот блок является одним из важнейших в концепции. Если мы не определим целевую аудиторию, то мы просто создадим продукт в вакууме. Здесь важно разделить аудиторию на группы и у каждой прописать цели.</p><h3>Текущие проблемы</h3><p>В данном разделе аналитики описывают все проблемы текущего решения у клиента. Предположим, оно тормозит, не выдерживает нагрузки или имеет плохую систему редактирования контента. Заказчик может предоставить полезную информацию, например: «Наши пользователи преимущественно смотрят с телевизоров, а сайт на нем плохо виден». Эта информация может помочь нам найти решение.</p><h3>Функциональные возможности</h3><p>Здесь аналитики описывают все основные функции, предполагаемые для сайта, например, авторизация по SMS, интеграция с платежной системой и другие.</p><h3>Технические требования</h3><p>В этом разделе прописываются технические требования и ограничения. Например, если предполагается большое количество посетителей и высокая нагрузка, то сервера должны быть надежными.</p><h3>Наполнение ключевых страниц</h3><p>Здесь мы описываем каждый уникальный шаблон. Разработчики и клиент должны понимать, что предусмотрено на каждой странице.</p><h3>Риски</h3><p>Если аналитики знают, где в ходе разработки продукта могут возникнуть проблемы, они об этом пишут. Например: если контент, создаваемый пользователями, будет содержать информацию, противоречащую законодательству.</p><h3>Предполагаемые интеграции</h3><img src=\"/assets/статьи/19/Предполагаемые интеграции.png\" alt=\"Предполагаемые интеграции\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Этот раздел включает предполагаемые интеграции. Например, с сервисом Яндекс.Карт, с внутренними CRM, ERP и т.д.</p><h3>Источники информации</h3><p>В этом разделе аналитики прописывают источники информации и результаты исследований, которые касаются продукта. Важно учитывать эти данные до начала разработки. Указывается, кто доводит до подрядчика идеи и требования со стороны клиента.</p><h3>Идеи по развитию продукта</h3><p>В этом разделе описывается, как продукт будет развиваться в будущем: возможности масштабирования, добавления новых фичей.</p><p>Каждый раздел концепции включает информацию: от кого пришло требование, ограничение, цель и задачи. Благодаря этому вырисовывается полная картина по продукту. Команда разработки четко понимает, что она будет на текущем этапе, что на следующем, а что пока переместится в бэклог.</p><h2>Как на наш взгляд выглядит хорошая концепция. Чек-лист:</h2><ul><li>В ней собрано столько информации, сколько необходимо, чтобы узнать все подводные камни по продукту и требования заказчика.</li><li>Она написана грамотно и понятно для людей, не являющихся разработчиками и не подкованных технически. Изложение сути продукта — доступное и однозначное.</li><li>Из концепции сразу ясно, для каких целей и каких пользователей создается решение, какие задачи оно будет решать.</li><li>Она хорошо структурирована, все разделы логичны и идут последовательно.</li><li>Описываемая сложная логика в ней дополнена вспомогательным визуалом. Например, схемами, которые расшифровывают непонятные места.</li><li>Даже спустя некоторое время концепция продолжает быть понятной и прозрачной для всех, кто её читает.</li></ul>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/19/19.png",
        "animationDelay": "500ms"
    },
    {
        "id": 20,
        "date": "20 апреля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "To be or not to be: нужен ли вашему бизнесу мобильный сервис",
        "title2": "Мобильное приложение для бизнеса",
        "text": "<p>Какому бизнесу необходима разработка мобильных приложений, а какому пока не требуется? Абстракцию долой: считаем окупаемость нового решения и убеждаемся, что приложение соответствует нашим бизнес-целям.</p><p>Как развивать аудиторию нового приложения, и на какие метрики обращать внимание? Об этом расскажет Вадим Фингеров, директор по развитию CDI.</p><p>Экономический кризис влияет на финансовые планы россиян. Они откладывают покупки, пересматривают будничные растраты и отказываются от дорогостоящих приобретений.</p><p>В новых реалиях рынка бизнесу стало еще важнее эффективно строить коммуникации с клиентами: работать над качеством взаимодействия, создавать высокий уровень лояльности к бренду и ненавязчиво оставаться в поле внимания.</p><p>В последнее время в роли универсального посредника, способствующего построению плотных коммуникаций между бизнесом и клиентом, все чаще выступает мобильное приложение.</p><p>Нередко владельцы бизнеса сомневаются, запускать ли приложение для компании, или ограничиться сайтом и его мобильной версией, и какой бюджет на это необходимо выделить. Сейчас я попробую ответить на популярные вопросы бизнеса по этой теме. Если у вас останутся вопросы после прочтения, обращайтесь, наша команда всегда готова проконсультировать вас по вопросам разработки.</p><h2>Каждый ли бизнес готов к выпуску своего мобильного приложения?</h2><p>На мой взгляд, нет. Обоснованность решения о разработке приложения для бизнеса зависит от запросов пользователей и его будущей окупаемости. В отдельных случаях компаниям выгоднее доработать сайт и его мобильную версию, усиленно вложиться в маркетинг или начать работу с маркетплейсами.</p><p>Когда бизнес приходит в наше агентство с запросом, нужно ли запустить свое приложение, прежде всего, мы анализируем, готова ли компания к появлению нового цифрового сервиса, и как он впишется в её IT-инфраструктуру в целом. Если выпускать приложение рано, то лучше позаботиться о других каналах коммуникации с клиентами.</p><p>Насколько актуальна разработка мобильного приложения, зависит, в том числе, от рынка, на котором присутствует бизнес.</p><p>Для продавца повседневной одежды или сервиса по доставке готовых блюд с большой аудиторией запуск приложения для развития бизнеса выглядит перспективнее, чем для производителя удобрений, продающего средства крупным клиентам.</p><p>Если от 30%, а лучше от 50% пользователей совершает целевые действия на сайте со смартфона, затраты на разработку мобильного приложения окупаются.</p><p>Если предполагается, что пользователь будет нередко возвращаться в сервис, а не разово обращаться за его товарами и услугами.</p><p>В подсчете unit-экономики мобильного приложения помогут фреймворк дерева метрик и оценка продуктовых и маркетинговых метрик. Вы должны удостовериться в прибыльности текущего IT-продукта, определить среднюю длительность его использования клиентами, конверсию, стоимость продвижения, эффективность расширения пользовательской аудитории.</p><p>Недостаточно создать приложение для бизнеса — оно требует регулярного обновления: добавления новых функциональностей и вовлечения пользователей.</p><p>Запустив приложение, важно отслеживать продуктовые и маркетинговые метрики, чтобы удержать аудиторию. Как правило, бизнес следит за стоимостью действия пользователя внутри приложения (CPA), средним доходом, который удается получить за время использования приложения конкретным пользователем (LTV), средней выручкой, получаемой с одного пользователя (ARPU), а также метриками вовлеченности в продукт: retention и количество новых пользователей за период времени.</p><p>Отдельно рассчитываются метрики, связанные с продвижением. В частности, зачастую подсчитывается уровень кликов по объявлениям (CTR), стоимость показа (CPM) и стоимость клика (CPC), которая показывает конверсию из кликов в установки.</p><p>Своевременное отслеживание целевых метрик позволяет правильно реагировать на проблемные ситуации. Например, если мы видим, что растет коэффициент брошенных корзин (CAR), нужно выяснять, в связи с чем это происходит.</p><p>В ходе разработки учитываются бизнес-процессы конкретной компании: в одном случае требуется сделать онлайн-кассу для оформления заказов через приложение, чтобы улучшить пользовательский опыт. А в другом случае нужна команда технической поддержки, чтобы оперативно отвечать на вопросы пользователей.</p><p>В число главных этапов в ходе разработки мобильного приложения входят аналитика и проектирование. На этом этапе работы требуется правильно определить целевую аудиторию приложения, зачем оно нужно пользователям, какие проблемы будет решать, интеграция с какими сервисами потребуется, как приложение будет взаимодействовать с бизнес-системами.</p><p>Также на этом этапе проводится глубокое исследование бизнеса, для которого разрабатывается продукт, и конкурентов на рынке. Качество проделанной аналитики определяет, будет ли мобильное приложение запущено с опорой на бизнес-цели и потребности клиентов, или приложение останется невидимкой в магазинах приложений.</p><p>Разработчики мобильных приложений закладывают порядка 20% времени от проекта на аналитику и проектирование. Часто клиенты хотят максимально ускорить релиз и предлагают проигнорировать этап аналитики. Они стремятся быстрее приступить к дизайну интерфейса и разработке.</p><p>Учитывая опыт CDI, я рекомендую уделять внимание детальному проектированию пользовательского опыта и закладывать бюджет на исследовательскую часть работы. Тщательно продуманные и протестированные приложения пользуются большим успехом среди пользователей: получают высокие оценки в сторах, приносят больше прибыли и известности. Наспех созданные решения могут быть сделаны в отрыве от бизнес-целей, стратегии бизнеса и повлечь за собой крупные финансовые риски. Но и надолго откладывать запуск мобильного приложения не стоит, иначе ваша аудитория достанется конкурентам.</p><h2>Каким образом и когда переводить клиентов компании в mobile</h2><img src=\"/assets/статьи/20/Каким образом и когда переводить клиентов компании в mobile.png\" alt=\"Каким образом и когда переводить клиентов компании в mobile\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Самый первый, кому важно понимать, зачем бизнесу приложение — вы и ваша команда. Вы понимаете, зачем люди будут пользоваться новым сервисом, какие проблемы или задачи решать?</p><p>Например, вы много лет владеете магазином натуральной косметики и продуктов питания. Изначально для ведения бизнеса хватало страниц в соцсетях, затем производство расширилось, заказчиков стало на порядок больше. Заработал интернет-магазин. Теперь клиенты просят разработать мобильное приложение. Им будет удобнее оплачивать заказы со смартфона или начинать выбор товаров на компьютере, а листать каталог с телефона.</p><p>Запросов на появление мобильного приложения все больше, или вы как раз хотите обновить программу лояльности. Появление нового приложения закономерно. Оно полезно для пользователей и поможет вам в решении бизнес-задач.</p><p>Например, мы разработали новую версию мобильного приложения для программы лояльности Jaguar и Land Rover. Приложение позволяет отобразить на экране смартфона партнеров компании, предоставляющих покупателям особые привилегии, техническую информацию об автомобиле, рейтинги дилеров и другую полезную информацию.</p><p>Перевести пользователей с сайта в мобильное приложение не всегда бывает просто. Особенно, в момент релиза. Да и современных пользователей сложно удивить. Мы рекомендуем вам проработать группу привлекательных предложений для них и тестировать эффективность, делая выбор в пользу самых действенных.</p><p>Чтобы убедить клиентов установить приложение, можно пообещать в рассылке по e-mail или публикациях в социальных сетях, что первый заказ через него они оплатят со скидкой в 20%. Также они могут получить товар с бесплатной доставкой либо подарок. Важно, чтобы предложение заинтересовало пользователей, и уложилось в бюджет, заложенный на развитие сервиса.</p><p>Бонусы для тех, кто согласился скачать новое приложение, могут быть сделаны с учетом крупных новостей или праздников. В разгар пандемии пользовалась спросом бесконтактная доставка. Предлагать ее как бонусную услугу было выгодно.</p><p>Покупателей может привлечь появление в приложении функциональности, которой еще нет в интернет-магазине. Например, выбор точек самовывоза товаров или виртуальный шоурум.</p><p>Благодаря промокодам и utm-меткам вы сможете отследить, какое число пользователей пришло благодаря офферам, какая была конверсия, и эффективна ли данная маркетинговая компания.</p><h2>Как общаться с аудиторией мобильного приложения</h2><img src=\"/assets/статьи/20/Расскажу вам о некоторых из распространенных инструментов коммуникации с пользователями приложения.png\" alt=\"Инструменты коммуникации с пользователями приложения\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>По данным аналитиков eMarketer, люди проводят в смартфонах, в среднем, порядка 4 часов в день. Львиную долю от этого времени занимает активность в мобильных приложениях. Как бороться за внимание аудитории, если в магазинах приложений каждый день появляются всё новые и новые сервисы?</p><p>Расскажу вам о некоторых из распространенных инструментов коммуникации с пользователями приложения:</p><h3>1. Пуши</h3><p>Они позволяют бизнесу делиться акциями, интересными новостями проекта, персональными предложениями, появлением новых функциональностей, казуальных игр, статусом заказов. Главное, использовать уведомления аккуратно – многие люди итак утомлены информационным шумом. Назойливые сообщения от бизнеса вызовут отторжение.</p><h3>2. Персональные рекомендации</h3><p>Мы уверены, что для вас не секрет, насколько персональные предложения могут быть эффективнее общих, подготовленных на слишком широкую аудиторию. Применяя рекомендательные системы, бизнес может всесторонне анализировать предпочтения клиентов, историю их заказов и CX. На этой основе можно делать точечные предложения. Клиенты ценят индивидуальный подход и чаще совершают заказы.</p><p>Например, интернет-магазин одежды может давать более точные рекомендации покупателям, отслеживая в приложении, какие вещи нравятся конкретному пользователю, какие товары он возвращает, и по какой причине, и какой размерный ряд ему подходит. Он может предлагать ему товары, которые нравятся другим покупателям со схожими запросами.</p><h3>3. Инструменты геймификации</h3><p>Популярным способом заинтересовать пользователей новым приложением служит геймификация. Механики используются разные: от получения бонусных баллов при регулярном использовании приложения до викторин, сбора игровых кристаллов и «Колеса фортуны». Главное, чтобы в рутинные процессы, например, закупку продуктов или диету приложение добавляло игровые элементы и тем самым развлекало пользователя.</p><p>Например, сервис авиабилетов может предлагать клиентом бонусные мили за прохождение викторин, посвященных правилам перелета, и выполнение простых заданий. Эти мили клиенты в дальнейшем используют при покупке билетов, что повышает их позитивное отношение к сервису.</p><p>В конечном счете, игры в новом приложении должны не только запоминаться пользователю, чтобы побуждать его чаще открывать ваш сервис, но и увеличивать частоту совершения целевых действий. А именно – заказывать услуги, приобретать товары, обращаться за консультацией и т.д.</p><h3>4. Онлайн-консультации и чат-боты</h3><p>За последние несколько лет на рынке повысился спрос на удаленные консультации с экспертами. Этот тренд сохраняется с начала пандемии. Пользователи удаленно обращаются к психологам, юристам, стилистам. Круг профессий, оказывающих консультации дистанционно, растет.</p><p>В вашем сервисе тоже могут быть доступны такие консультации. Часть из них можно реализовать бесплатно, как бонус для пользователей, а часть – платно. Как минимум, должна работать Служба поддержки, готовая оперативно ответить на вопросы клиента.</p><h3>5. Общение с аудиторией через элементы интерфейса</h3><p>Продуманные экраны приложения и дружелюбные, написанные «человеческим языком», интерфейсные подсказки позитивно настроят пользователей. А если вы ещё и найдете, как уместно использовать юмор, запомнитесь клиентам на фоне безликих и неудобно организованных сервисов.</p><p>Профессиональное проектирование приложения и продуктовый копирайтинг становятся все более востребованными на рынке. Ведь коммуникация с пользователем начинается с первого использования им нового приложения. И визуально, и по смыслу все должно быть очевидно. Экраны мобильного приложения должны побуждать пользователя к целевым действиям, а не раздражать.</p><h2>Как расширять аудиторию мобильного приложения</h2><img src=\"/assets/статьи/20/Как расширять аудиторию мобильного приложения.png\" alt=\"Как расширять аудиторию мобильного приложения\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Мобильные приложения помогают бизнесу продавать товары и услуги, реализовывать программы лояльности и усиливать бренды на рынке. В кризис компания может пересмотреть свою стратегию и коммуникации с потребителями так, чтобы предложить им наиболее актуальные и ценные предложения и даже расширить аудиторию.</p><p>Подход к продвижению приложений среди новых пользователей зависит от целей бизнеса.</p><p>Если вы решили выпустить отдельный сервис, механика привлечения пользователей будет напоминать ту, которая обычно используется для продвижения нового продукта – наружная реклама, телереклама, нативные публикации в медиа и соцсетях.</p><p>Вы можете предложить клиенту скачать новое мобильное приложение в офлайн-точке продаж и пообещать ему скидку на первый заказ. Тем самым бизнес оказывается в личном пространстве пользователя и может начать общение с ним через смартфон. Поделитесь с клиентами, что у вас появился новый онлайн-сервис, через рассылки, баннеры, социальные сети и личные рекомендации. Если правильно презентовать выход приложения, его появление порадует пользователей, а не вызовет недоумение.</p><p>От времени, проведенного пользователями в приложениях, зависит вероятность совершения ими целевых действий. Когда впервые произошло распространение Covid-19, европейские клиенты стали на 15% чаще начали использовать сервисы онлайн-доставки, и сразу вырос объем скачивания приложений, поддерживающих услугу.</p><p>В 2021 году россияне потратили в мобильных приложениях почти вдвое больше, чем до пандемии (свыше 1,5 миллиарда долларов). По данным отчета App Annie, объём их затрат в приложениях был на 19% больше, чем в 2020. При этом, в среднем, они проводили в приложениях до 4 часов.</p><p>Радуйте пользователей небольшими, но полезными дополнениями. Например, недавние обновления операционной системы iOS 16 позволяют разрабатывать для мобильных приложений виджеты для экрана блокировки iPhone (часы, напоминания, полезную статистику и т.п.). Можно учесть это при реализации проекта и дополнить его виджетом, который регулярно будет сообщать пользователю о себе и мотивировать чаще заходить в приложение.</p><p>CDI много лет разрабатывает приложения и входит в ТОП отечественных мобильных разработчиков. Мы консультируем бизнес, помогая правильно выбирать, какие сервисы запускать, какие языки программирования использовать, и каким функциональностям уделять внимание в первую очередь. Всегда готовы обсудить с вами запуск нового приложения и помочь с его реализацией.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/20/20.png",
        "animationDelay": "700ms"
    },
    {
        "id": 21,
        "date": "25 апреля, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Разработка",
        "title": "Как ставить задачу разработчикам сайта: чек-лист от CDI",
        "title2": "Постановка задач разработчикам",
        "text": "<p>Как сформулировать хотелки, решить проблемы на берегу и приблизить результат к сайту мечты: чеклист на постановку задач на разработку от CDI.</p><p>Привет! Я Аня, специалист по продукту в digital-агентстве CDI. Наш отдел проектирует сайты и мобильные приложения — выявляет требования и бизнес-цели, изучает предметную область, специфику и цели пользователей, создает архитектуру и интерфейсы будущего решения.</p><p>В этой статье я расскажу о том, что делать, если вы решили обратиться в агентство за разработкой сайта. Как понять чего вы хотите, и как поставить задачу так, чтобы результат вас не разочаровал.</p><p>Перед тем, как обратиться в агентство, нужно четко определить формат работ: разработка сайта — это широкое понятие, поэтому сразу решите, что вам в итоге нужно.</p><ul><li><strong>Редизайн текущего сайта.</strong> В результате редизайна у сайта меняется визуальное решение, а структура страниц и информация на них остаётся прежней.</li><li><strong>Переработка текущего сайта.</strong> В этом случае меняется всё — визуальное решение, структура страниц, информация на них. При переработке могут добавляться новые функции и интеграции.</li><li><strong>Создание нового сайта с нуля.</strong> Структура, информация и визуальное решение также создаются с нуля.</li></ul><p>При редизайне сайта достаточно будет сформулировать пожелания к новому визуальному решению и найти подходящие референсы сайтов, которые вам нравятся.</p><p>При переработке и создании сайта нужно сформулировать гораздо больше требований:</p><ul><li>Цель разработки сайта.</li><li>Кто будет пользоваться сайтом, кто ваша целевая аудитория.</li><li>Сценарии пользователей.</li><li>Функционал сайта.</li><li>Структура сайта.</li><li>Контент.</li></ul><p>Мы очень рекомендуем потратить на это время и силы, потому что, чем конкретнее вы расскажете, что именно вам нужно на новом сайте и какого итогового результата вы ждёте, тем точнее и ниже будет оценка стоимости от агентства. Если в проекте сайта есть какие-то белые пятна, то агентство делает приблизительный расчёт стоимости и закладывает больше рисков, которые увеличивают итоговую цену сайта.</p><p>Далее мы дадим подробную инструкцию, которая поможет вам заранее ответить самому себе на все вопросы по новому сайту и сформировать полное видение конечного продукта.</p><h2>0. Сформулируйте бизнес-цели сайта</h2><img src=\"/assets/статьи/21/0. Сформулируйте бизнес-цели сайта.jpg\" alt=\"Сформулируйте бизнес-цели сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Поймите, для чего вы делаете сайт: какие главные задачи стоят перед ним. Бизнес-цели будут всегда сильно зависеть не только от специфики вашего бизнеса, но и от стадии его развития.</p><p>Например, если вы только открываете небольшой магазин одежды, то у сайта может стоять цель ознакомления пользователя с ассортиментом магазина через сайт. Если бизнес пойдёт в гору, то могут появиться новые цели, например, увеличение продаж магазина не только через офлайн-точку, но и через сайт. А со временем, возможно, появится цель увеличения лояльности клиентов.</p><p>Чем конкретнее вы сформулируете цели, тем легче потом будет проверить, выполняет ли их сайт. Рекомендуем добавить в цели определённости в плане времени и объёма их достижения.</p><p>Один из эффективных способов ставить цели — инструмент SMART.</p><h2>2. Напишите сценарии по каждой задаче</h2><img src=\"/assets/статьи/21/2. Напишите сценарии по каждой задаче.jpg\" alt=\"Напишите сценарии по каждой задаче\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Это опциональный этап, который вы можете пропустить. Но мы рекомендуем его сделать, чтобы с помощью сценариев понять, какой функционал и какая информация понадобятся пользователю.</p><p>Вначале ваши сценарии будут только гипотезами, которые в дальнейшем можно будет проверить с помощью агентства (на этапе аналитики) или уже на готовом сайте (через веб-аналитику).</p><p>Чтобы написать сценарий, нужно определить точку входа пользователя на сайт. Далеко не всегда это будет главная страница. Часто пользователи попадают из поисковых систем сразу на какую-то внутреннюю страницу сайта.</p><p>Далее вам нужно перечислить шаги, которые пользователь будет предпринимать для решения задачи.</p><p>Например:</p><ol><li>Из поисковой системы пользователь переходит на страницу услуги.</li><li>Пользователь изучает информацию по услуге.</li><li>Понимает, что эта услуга ему не подходит.</li><li>Находит в меню пункт «Услуги», нажимает на него и переходит на страницу списка услуг.</li><li>Выбирает подходящую на его взгляд услугу, нажимает на неё и переходит на её страницу.</li><li>Изучает информацию по услуге и понимает, что она ему потенциально подходит.</li><li>Хочет получить консультацию по услуге и нажимает кнопку отправки заявки.</li><li>В открывшейся форме заявки заполняет поля и отправляет её.</li><li>Получает сообщение об успешной отправке заявки.</li></ol><p>На этом этапе вы можете плохо представлять себе структуру будущего сайта, страницы и их функционал. Но всё равно начинайте делать предположения, в каких местах и какие действия совершает пользователь. Это постепенно поможет сформировать полное видение сайта.</p><h2>3. Перечислите основной функционал будущего сайта</h2><img src=\"/assets/статьи/21/3. Перечислите основной функционал будущего сайта.jpg\" alt=\"Перечислите основной функционал будущего сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Часто люди не понимают, что кроется за словосочетанием «функционал сайта». Для упрощения понимания можно сказать так: функционал — это всё, что требует от пользователя больше, чем просто переход по ссылке.</p><p>Например: авторизоваться в личном кабинете, добавить товар в корзину, применить фильтр, отправить заявку или поисковой запрос. Также к функционалу относятся правила отображения контента. Например: показывать на странице товара другие похожие товары.</p><p>Чтобы понять, какой функционал вам нужен, ещё раз перечитайте сценарии и выпишите оттуда действия пользователя.</p><p>Например: если по сценарию пользователь отправляет заявку, то вам нужен функционал создания и отправки заявки. Если вы планируете со временем редактировать поля этой заявки, то вам также понадобится функционал редактирования.</p><img src=\"/assets/статьи/21/Если вы планируете со временем редактировать поля этой заявки, то вам также понадобится функционал редактирования..jpg\" alt=\"Если вы планируете со временем редактировать поля этой заявки\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Можно отталкиваться не только от сценариев, но и от задач пользователя. Например: если у пользователя на сайте есть задача получения консультации, то вам может пригодиться функционал живого чата.</p><img src=\"/assets/статьи/21/Можно отталкиваться не только от сценариев, но и от задач пользователя. Например если у пользователя на сайте есть задача получения консультации, то вам может пригодиться функционал живого чата..jpg\" alt=\"Можно отталкиваться не только от сценариев, но и от задач пользователя\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>К списку функционала, составленному по сценариям и задачам, добавьте функционал, который вы планируете помимо функционала ключевых пользователей. Например: вам как компании важно получать обратную связь от посетителей сайта, но у ключевых пользователей нет такого сценария. Это не страшно, просто добавьте нужный вам функционал в список.</p><h2>4. Перечислите интеграции будущего сайта</h2><img src=\"/assets/статьи/21/4. Перечислите интеграции будущего сайта.jpg\" alt=\"Перечислите интеграции будущего сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Как и в предыдущем этапе, интеграции можно сформулировать самостоятельно либо вычленить их из списка функционала сайта.</p><p>Например: в случае, если вы планируете использовать живой чат, то сайту нужна интеграция с этим сервисом.</p><p>Когда требуется интеграция? Когда на сайт приходят данные из какой-то сторонней системы.</p><p>Например: список товаров из 1С передается на сайт. Или когда сайт сам отправляет данные в стороннюю систему. Например: пользователь подписывается на рассылку и данные о нём передаются в CRM.</p><h2>5. Создайте предварительную структуру сайта</h2><img src=\"/assets/статьи/21/5. Создайте предварительную структуру сайта.jpg\" alt=\"Создайте предварительную структуру сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Исходя из задач и сценариев пользователя, поймите, какие страницы должны быть на сайте.</p><p>Например: если у пользователя задача найти нужную услугу, то ему понадобятся как минимум 2 страницы — страница списка услуг компании и страница самой услуги. А если пользователь будет искать страницу не через список услуг, а через функцию поиска по сайту, то вам понадобится ещё и страница результатов поиска.</p><p>Выпишите все страницы и сделайте из них иерархическую структуру: какая страница в каком разделе должна будет располагаться.</p><p>Дополните этот список другими обязательными страницами.</p><p>Например, если на вашем сайте есть формы, в которых пользователь указывает личные данные (телефон, почта, фамилия и имя), то вам нужно предусмотреть минимум две контентные страницы: страница с пользовательским соглашением и страница с политикой обработки персональных данных.</p><h2>6. Подготовьте контент для нового сайта</h2><img src=\"/assets/статьи/21/6. Подготовьте контент для нового сайта.jpg\" alt=\"Подготовьте контент для нового сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Вы определили, какие страницы будут на новом сайте. Теперь нужно понять, какую информацию вы будете на них размещать. Для начала можно подобрать контент, который вам кажется уместным для каждой страницы, а потом проверить эти страницы по пользовательским сценариям.</p><p>При проверке вы поймёте, хватает ли информации для решения задачи пользователя и в каком месте стоит разместить эту информацию. Возможно, вы увидите, что не хватает какого-то функционала и добавите его в список.</p><p>Также на этом этапе вы сможете понять, какой информации или изображений у вас нет, и заказать их заранее.</p><p>Например, вы планируете на странице о компании разместить фотографии руководителей. Но все текущие фотографии в разном стиле и к тому же устарели. Значит, вам нужно заранее заказать фотосъёмку, чтобы к моменту запуска сайта все фотографии были в наличии.</p><p>Если вы хотите определённую стилистику сайта, структуру, то советуем приложить референсы. Если вы хотите сайт для автосалона, то логично будет приложить ссылки на ресурсы, которые вам нравятся в визуальном и пользовательском плане.</p><p>Писать тексты после дизайна неправильно. Потому что сайт должен быть не только красивый, но и логичный, удобный для пользователя. Отталкиваясь от дизайна, а не от контента вы обязательно забудете важные блоки, не предусмотрите какие-то важные фишки.</p><h2>7. Расскажите агентству о существующих ограничениях разработки</h2><img src=\"/assets/статьи/21/7. Расскажите агентству о существующих ограничениях разработки.jpg\" alt=\"Расскажите агентству о существующих ограничениях разработки\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Подумайте над тем, что может внести ограничения в проект.</p><p>Например, вам очень важно сохранить ссылочную массу со старого сайта: в таком случае кардинально менять структуру сайта нежелательно.</p><p>Ещё одно потенциальное ограничение — разработка сайта на какой-то определённой платформе. Например, вам важно, чтобы новый сайт был разработан на Битриксе, потому что у вас в компании уже есть другие продукты из этой инфраструктуры.</p><h2>8. Выберите человека, который будет отвечать за проект нового сайта</h2><img src=\"/assets/статьи/21/8. Выберите человека, который будет отвечать за проект нового сайта.jpg\" alt=\"Выберите человека, который будет отвечать за проект нового сайта\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>После того, как вы подготовили все материалы по сайту, нужно решить, кто в вашей компании будет коммуницировать с агентством на протяжении всего времени работы над сайтом. Желательно, чтобы это был человек, совмещающий в себе компетенции по бизнесу и IT. Если новый сайт планируется объёмным, то готовьтесь к тому, что участие в проекте будет занимать значительное время вашего сотрудника.</p><h2>9. Определите круг лиц, которые будут принимать решения по сайту</h2><img src=\"/assets/статьи/21/9. Определите круг лиц, которые будут принимать решения по сайту.jpg\" alt=\"Определите круг лиц, которые будут принимать решения по сайту\" style=\"max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px;\" /><p>Перед тем, как начать работу с агентством, решите, кто будет выносить решения по сайту и принимать работу агентства. Чем меньше таких людей, тем лучше. Превратить требования одного человека в элегантное решение всегда легче, чем требования десяти человек.</p><p>К тому же, большое количество лиц, принимающих решения, напрямую влияет на сроки проекта: чем больше людей, тем дольше идут согласования.</p><h2>10. Ответьте на уточняющие вопросы</h2><p>Итак, основная работа проделана. Дальше вам останется ответить на несколько уточняющих вопросов:</p><ul><li>Какое доменное имя будет у вашего сайта?</li><li>Нужна ли будет адаптивная версия сайта для мобильных устройств?</li><li>Понадобятся ли другие языковые версии, кроме русского языка?</li><li>На какие регионы будет рассчитан сайт?</li><li>Какие сроки и предполагаемый бюджет проекта?</li></ul><p>После того, как вы ответите на эти вопросы, нужно собрать всю информацию по десяти этапам в одном или нескольких документах в папке на облачном сервисе и передать ссылку в агентство для дальнейшей оценки.</p><p>Выполнив работу по всем десяти этапам, вы не только получите точную оценку затрат на разработку от агентства, но и сами начнете полнее видеть всю картину вашего нового сайта.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "статьи/21/21.png",
        "animationDelay": "300ms"
    },
    {
        "id": -1,
        "date": "14 сентября, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "6 процессов, которые нужно внедрить в ваш отдел продаж, чтобы ваша конверсия в теплые диалоги выросла до 80%",
        "title2": "6 процессов для отдела продаж",
        "text": "<p>Мы лично протестировали их в своем агентстве CDI и с радостью поделимся с вами:</p><p><strong>⏺ Ежедневный разбор отчета РНП (рука на пульсе)</strong> — это инструмент, который позволит вам ежедневно отслеживать показатели сейлов, начиная от звонков и заканчивая оффлайн-встречами.</p><p>Пишите в комментариях кодовое слово «РНП» и мы отправим подробную файл с этим инструментом вам ⤵️</p><p><strong>⏺ Ежедневный контроль и апдейты по фокусным клиентам</strong></p><p><strong>⏺ Ролевки</strong> (отличный инструмент для разбора различных ситуаций с клиентом и отработки возражений)</p><p><strong>⏺ Встречи раз в неделю 1:1</strong> с разбором воронки / работы с задачами / замечаниями от ОКК / маркетинга</p><p><strong>⏺ Постановка целей по выработке на день / неделю</strong></p><p><strong>⏺ Командное взаимодействие, коннект маркетинга и продаж</strong></p><p><strong>❓ А какие из этих процессов уже есть в вашей компании? Делитесь в комментариях ⤵️</strong></p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "../новость 1.jpg",
        "thumb": "../новость 1.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": -2,
        "date": "06 октября, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Как увеличить количество продаж за счет продающего регламента",
        "title2": "Продающий регламент",
        "text": "<p>После того, как вы настроили взаимодействие отделов маркетинга и продаж, выстроили процессы работы отдела продаж в CRM-системе, важной задачей остается научить менеджеров обрабатывать лиды по правильно выстроенному регламенту.</p><p><strong>📌 Что может включать в себя продающий регламент:</strong></p><p><strong>1️⃣ Многоканальная обработка лидов</strong> (внедрение системы обработки трафика через WhatsApp, IP-телефонию, Viber, Telegram).</p><p>Это обеспечит вам максимальную эффективность связи с клиентом.</p><p><strong>2️⃣ Скорость обработки лидов как залог качества.</strong></p><p>Ускорение обработки входящих заявок должно происходить без потери уровня сервиса. Менеджер должен связаться с клиентом максимально быстро и прокоммуницировать в первые 3 дня, создать приятное впечатление еще с первой реакции и стремиться продать продукт с 1 звонка. Для этого у вас должны быть четкие скрипты и понимание портрета клиента.</p><p>Оптимизировать работу этих двух показателей поможет третья составляющая регламента⤵️</p><p><strong>3️⃣ Первая линия обработки клиентов и их распределение</strong></p><p>Внедрите менеджеров-квалификаторов, которые смогут забрать на себя первую коммуникацию с клиентом, провести первичную квалификацию по базовым вопросам и передать менеджерам, которые дальше будут вести и закрывать сделку.</p><p><strong>👨‍💻 Про еще 2 пункта продающего регламента рассказали в уроке. Чтобы его получить нужно быть подписанным на наш канал и написать слово «Регламент» в комментариях👇🏻 и мы пришлем вам его.</strong></p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "../новость 2.jpg",
        "thumb": "../новость 2.jpg",
        "animationDelay": "500ms"
    },
    {
        "id": -3,
        "date": "20 ноября, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Что должно быть в аналитике РОПа ?",
        "title2": "Аналитика РОПа",
        "text": "<p>Руководитель отдела продаж — это человек, который должен по цифрам видеть, где теряются деньги и как с этим работать. Вот 7 блоков, которые мы считаем критически важными:</p><p><strong>1️⃣ Количество задач в CRM</strong></p><p><strong>⏺</strong> Общее количество задач на день / неделю / месяц</p><p><strong>⏺</strong> Сколько выполнено, сколько просрочено</p><p><strong>⏺</strong> На каких этапах воронки скапливаются задачи</p><p>Показывает, контролирует ли команда воронку. Если много просрочек — заявки теряются, а менеджеры не справляются.</p><p><strong>2️⃣ Коммуникации с клиентами</strong></p><p><strong>⏺</strong> Кол-во звонков, встреч, подборок</p><p><strong>⏺</strong> Среднее число касаний на одного лида</p><p><strong>⏺</strong> Сравнение активности менеджеров между собой</p><p>Активность менеджера напрямую влияет на конверсию. Анализ помогает выявлять «молчаливых» сотрудников и тех, кто перегревает клиентов.</p><p><strong>3️⃣ Количество активных лидов в работе</strong></p><p><strong>⏺</strong> Сколько лидов сейчас «в работе»</p><p><strong>⏺</strong> Сколько у каждого менеджера</p><p><strong>⏺</strong> % лидов, застрявших без движения более 3–5 дней</p><p>Показывает, как эффективно менеджеры ведут своих клиентов. Застой лидов — индикатор потерь.</p><p><strong>4️⃣ Время, проведенное в CRM</strong></p><p><strong>⏺</strong> Время активности в CRM (входы, работа в карточках)</p><p><strong>⏺</strong> Взаимодействия с задачами, звонками, коммуникациями</p><p><strong>⏺</strong> Общее время на платформе на фоне других инструментов</p><p>Оценивает вовлеченность сотрудников в процессы. Если CRM — центр продаж, а менеджеры там не работают — значит, все ключевые действия проходят мимо системы.</p><p><strong>5️⃣ Нагрузка на команду</strong></p><p><strong>⏺</strong> Сколько лидов получает каждый брокер</p><p><strong>⏺</strong> Сколько задач и сделок он ведёт</p><p><strong>⏺</strong> Оценка загрузки и результативности исходя из конверсий</p><p>Это позволяет перераспределить нагрузку и сохранить качество проработки.</p><p><strong>6️⃣ Отчёт от ОКК по ошибкам команды</strong></p><p><strong>⏺</strong> Просроченные задачи</p><p><strong>⏺</strong> Аналитика по причинам отказов</p><p><strong>⏺</strong> Нарушения регламентов общения с клиентами: звонки, переписка</p><p>Позволяет оперативно находить и устранять слабые звенья, снижать риски потери клиента и усиливать скрипты.</p><p><strong>7️⃣ Прогнозирование и фокус</strong></p><p><strong>⏺</strong> Использовать текущие показатели для прогноза сделок</p><p><strong>⏺</strong> Динамика по менеджерам и отделу</p><p><strong>⏺</strong> План по повышению слабых мест в воронке</p><p><strong>⏺</strong> ABC-анализ: кто и что даёт 80% результата</p><p>Даёт РОПу возможность управлять не только фактами, но и будущими результатами.</p><p>Аналитика РОПа — это система, которая показывает, как не терять деньги и масштабировать продажи.</p><p><strong>👨‍💻 CDI предлагает вам провести бесплатный аудит вашей воронки продаж от наших лучших специалистов.</strong></p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "../новость 3.jpg",
        "thumb": "../новость 3.jpg",
        "animationDelay": "700ms"
    },
    {
        "id": -4,
        "date": "03 декабря, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "ТОП-4 ошибки, из-за которых 70% ваших клиентов сливаются на втором звонке",
        "title2": "Ошибки в продажах",
        "text": "<p>Наш отдел ОКК выявил эти основные недочеты в работе менеджеров по продажам:</p><p><strong>1️⃣ Отсутствует структура звонка</strong></p><p>Менеджеры не готовятся к общению: не изучают клиента, не ставят цель звонка или переписки. В итоге разговор ведётся наобум.</p><p>Вместо того, чтобы вести диалог — сотрудники просто реагируют на вопросы. Инициатива уходит к клиенту, а вы теряете контроль.</p><p><strong>Решение:</strong> перед любым касанием - изучите запрос, цели, возможные боли. Подготовьте короткий план: зачем вы общаетесь и к какому следующему шагу должны прийти.</p><p><strong>2️⃣ Менеджеры не отрабатывают возражения</strong></p><p>«Дорого», «мы подумаем», «сравниваем варианты» — это не отказы. Это стандартные сомнения, которые нужно уметь отрабатывать.</p><p>А многие просто замолкают или отправляют ссылку с презентацией, теряя контакт.</p><p><strong>Решение:</strong> обучите команду приёмам работы с возражениями. Главное — не спорить, а раскрывать причины, усиливать ценность и переводить в диалог.</p><p><strong>3️⃣ Не пытаются продать в первом звонке</strong></p><p>Менеджер уходит в чат и теряет инициативу. Вместо того, чтобы управлять диалогом в звонке — пересылает ссылки, отвечает письменно, ждёт, создавая ситуацию, где клиенту проще не отвечать, чем возразить. Продажа замирает.</p><p><strong>Решение:</strong> продавайте голосом. Если контакт уже есть - доводите диалог до следующего шага в моменте: встреча, бриф, демонстрация, договор.</p><p><strong>4️⃣ Не проводится презентация компании и региона</strong></p><p>Если вы не рассказали, в чём сила вашего продукта или команды, не показали кейсы и выгоды — клиент сам решает, насколько вы ему нужны. А чаще — просто уходит к тем, кто объяснил лучше.</p><p><strong>Решение:</strong> внедрите мини-презентацию на каждом этапе. Не зачитывайте регалии, а коротко и по делу — зачем вы, что умеете, почему стоит остаться с вами.</p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "../новость 4.jpg",
        "thumb": "../новость 4.jpg",
        "animationDelay": "300ms"
    },
    {
        "id": -5,
        "date": "15 декабря, 2025",
        "dateIcon": "far fa-calendar-alt",
        "author": "Команда CDI",
        "authorIcon": "far fa-user-circle",
        "tag": "Статьи",
        "title": "Вы потратили бюджет впустую! Почему классическая лидогенерация в B2B больше не работает",
        "title2": "B2B Лидогенерация: что не так?",
        "text": "<p>Еще 3–5 лет назад все было просто:</p><p>— запустил рекламу с красивым фото;</p><p>— получил лиды за 5-10$</p><p>— отдал в отдел продаж — и жди сделок.</p><p>Сегодня ситуация кардинально изменилась:</p><p><strong>⏺</strong> Лид дорожает каждый месяц.</p><p><strong>⏺</strong> Клиенты стали разборчивее и дольше принимают решение.</p><p><strong>⏺</strong> CTR объявлений падает, конкуренция растет.</p><p><strong>⏺</strong> Форма \"Оставьте заявку — мы вам перезвоним\" больше не работает.</p><p><strong>❓ Почему так происходит?</strong></p><p><strong>⏺ Информационный шум</strong></p><p>Рекламы стало больше, покупатели видят каждый день сотни одинаковых объявлений, которые больше не цепляют.</p><p><strong>⏺ Люди переходят к осознанному выбору</strong></p><p>На рынке все подорожало, количество некачественного подряда и потерянных денег увеличилось, люди перестали верить в «горящие предложения» и «скидка только до пятницы», они сначала изучают рынок, компанию, читают отзывы и только потом принимают решение оставить заявку.</p><p><strong>⏺ Изменился путь клиента</strong></p><p>Раньше человек видел рекламу и сразу оставлял заявку. Сегодня он может пройти 5-10 касаний: посмотреть рилс, зайти на сайт, почитать блог, почитать отзывы, сравнить комплексы, сравнить предложения компаний — и только потом проявить интерес.</p><p><strong>✅ Что работает вместо старой лидогенерации?</strong></p><p><strong>🎯 Комплексный маркетинг:</strong></p><p><strong>⏺</strong> SMM-маркетинг</p><p><strong>⏺</strong> Личный бренд компании или агентства</p><p><strong>⏺</strong> Брендовая реклама</p><p><strong>⏺</strong> Вместо одного источника трафика — несколько</p><p><strong>⏺</strong> Внедрение анти-спам системы</p><p><strong>🎯 А чтобы лиды гарантированно доходили до сделок, в симбиозе с лидогенерацией нужно внедрить:</strong></p><p><strong>⏺</strong> Отдел квалификации для выявления нецелевых лидов</p><p><strong>⏺</strong> CRM-маркетинг</p><p><strong>⏺</strong> Отдел ОКК, проверяющий качество работы менеджера с клиентом и возобновляющий коммуникацию с теми, кто по какой-то причине не дошел до покупки.</p><p>Мы стремимся упростить вашу работу с клиентом и сделать ее более качественной, чтобы вам оставалось просто заключить сделку!</p><p><strong>👨‍🏭 Если вы нуждаетесь в надежном партнере по комплексному маркетингу для вашего бизнеса — обращайтесь к нам (<a href=\"https://t.me/CDI_Agency\">https://t.me/CDI_Agency</a>), (<a href=\"https://sbsite.pro//f458d60c87803a386c90bb1ab976fe54_1\">https://sbsite.pro//f458d60c87803a386c90bb1ab976fe54_1</a>) мы проведем для вас бесплатный аудит и разработаем стратегию для вашей компании.</strong></p>",
        "btnText": "Читать далее",
        "btnIcon": "fas fa-angle-right",
        "thumbFull": "../новость 5.jpg",
        "thumb": "../новость 5.jpg",
        "animationDelay": "300ms"
    }
]